TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Thu Dec 01 16:00:54 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    7838                      .dwattr $C$DW$662, DW_AT_name("EST_State_RoverL")
    7839                      .dwattr $C$DW$662, DW_AT_const_value(0x02)
    7840              
    7841              $C$DW$663       .dwtag  DW_TAG_enumerator
    7842                      .dwattr $C$DW$663, DW_AT_name("EST_State_Rs")
    7843                      .dwattr $C$DW$663, DW_AT_const_value(0x03)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  150

    7844              
    7845              $C$DW$664       .dwtag  DW_TAG_enumerator
    7846                      .dwattr $C$DW$664, DW_AT_name("EST_State_RampUp")
    7847                      .dwattr $C$DW$664, DW_AT_const_value(0x04)
    7848              
    7849              $C$DW$665       .dwtag  DW_TAG_enumerator
    7850                      .dwattr $C$DW$665, DW_AT_name("EST_State_IdRated")
    7851                      .dwattr $C$DW$665, DW_AT_const_value(0x05)
    7852              
    7853              $C$DW$666       .dwtag  DW_TAG_enumerator
    7854                      .dwattr $C$DW$666, DW_AT_name("EST_State_RatedFlux_OL")
    7855                      .dwattr $C$DW$666, DW_AT_const_value(0x06)
    7856              
    7857              $C$DW$667       .dwtag  DW_TAG_enumerator
    7858                      .dwattr $C$DW$667, DW_AT_name("EST_State_RatedFlux")
    7859                      .dwattr $C$DW$667, DW_AT_const_value(0x07)
    7860              
    7861              $C$DW$668       .dwtag  DW_TAG_enumerator
    7862                      .dwattr $C$DW$668, DW_AT_name("EST_State_RampDown")
    7863                      .dwattr $C$DW$668, DW_AT_const_value(0x08)
    7864              
    7865              $C$DW$669       .dwtag  DW_TAG_enumerator
    7866                      .dwattr $C$DW$669, DW_AT_name("EST_State_LockRotor")
    7867                      .dwattr $C$DW$669, DW_AT_const_value(0x09)
    7868              
    7869              $C$DW$670       .dwtag  DW_TAG_enumerator
    7870                      .dwattr $C$DW$670, DW_AT_name("EST_State_Ls")
    7871                      .dwattr $C$DW$670, DW_AT_const_value(0x0a)
    7872              
    7873              $C$DW$671       .dwtag  DW_TAG_enumerator
    7874                      .dwattr $C$DW$671, DW_AT_name("EST_State_Rr")
    7875                      .dwattr $C$DW$671, DW_AT_const_value(0x0b)
    7876              
    7877              $C$DW$672       .dwtag  DW_TAG_enumerator
    7878                      .dwattr $C$DW$672, DW_AT_name("EST_State_MotorIdentified")
    7879                      .dwattr $C$DW$672, DW_AT_const_value(0x0c)
    7880              
    7881              $C$DW$673       .dwtag  DW_TAG_enumerator
    7882                      .dwattr $C$DW$673, DW_AT_name("EST_State_OnLine")
    7883                      .dwattr $C$DW$673, DW_AT_const_value(0x0d)
    7884              
    7885              $C$DW$674       .dwtag  DW_TAG_enumerator
    7886                      .dwattr $C$DW$674, DW_AT_name("EST_numStates")
    7887                      .dwattr $C$DW$674, DW_AT_const_value(0x0e)
    7888              
    7889                      .dwendtag $C$DW$T$175
    7890              
    7891              $C$DW$T$176     .dwtag  DW_TAG_typedef
    7892                      .dwattr $C$DW$T$176, DW_AT_name("EST_State_e")
    7893                      .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$175)
    7894                      .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    7895              
    7896              
    7897              $C$DW$T$180     .dwtag  DW_TAG_enumeration_type
    7898                      .dwattr $C$DW$T$180, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  151

    7899              $C$DW$675       .dwtag  DW_TAG_enumerator
    7900                      .dwattr $C$DW$675, DW_AT_name("CTRL_Type_PID_spd")
    7901                      .dwattr $C$DW$675, DW_AT_const_value(0x00)
    7902              
    7903              $C$DW$676       .dwtag  DW_TAG_enumerator
    7904                      .dwattr $C$DW$676, DW_AT_name("CTRL_Type_PID_Id")
    7905                      .dwattr $C$DW$676, DW_AT_const_value(0x01)
    7906              
    7907              $C$DW$677       .dwtag  DW_TAG_enumerator
    7908                      .dwattr $C$DW$677, DW_AT_name("CTRL_Type_PID_Iq")
    7909                      .dwattr $C$DW$677, DW_AT_const_value(0x02)
    7910              
    7911                      .dwendtag $C$DW$T$180
    7912              
    7913              $C$DW$T$181     .dwtag  DW_TAG_typedef
    7914                      .dwattr $C$DW$T$181, DW_AT_name("CTRL_Type_e")
    7915                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$180)
    7916                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    7917              
    7918              $C$DW$678       .dwtag  DW_TAG_TI_far_type
    7919                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$181)
    7920              
    7921              $C$DW$T$182     .dwtag  DW_TAG_const_type
    7922                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$678)
    7923              
    7924              
    7925              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7926                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    7927                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    7928              $C$DW$679       .dwtag  DW_TAG_member
    7929                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$24)
    7930                      .dwattr $C$DW$679, DW_AT_name("ADCRESULT")
    7931                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ADCRESULT")
    7932                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7933                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7934              
    7935              $C$DW$680       .dwtag  DW_TAG_member
    7936                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$25)
    7937                      .dwattr $C$DW$680, DW_AT_name("resvd_1")
    7938                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_resvd_1")
    7939                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7940                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7941              
    7942              $C$DW$681       .dwtag  DW_TAG_member
    7943                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$23)
    7944                      .dwattr $C$DW$681, DW_AT_name("ADCCTL1")
    7945                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_ADCCTL1")
    7946                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    7947                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7948              
    7949              $C$DW$682       .dwtag  DW_TAG_member
    7950                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$23)
    7951                      .dwattr $C$DW$682, DW_AT_name("ADCCTL2")
    7952                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCCTL2")
    7953                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  152

    7954                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7955              
    7956              $C$DW$683       .dwtag  DW_TAG_member
    7957                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$26)
    7958                      .dwattr $C$DW$683, DW_AT_name("rsvd_2")
    7959                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_rsvd_2")
    7960                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    7961                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7962              
    7963              $C$DW$684       .dwtag  DW_TAG_member
    7964                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$23)
    7965                      .dwattr $C$DW$684, DW_AT_name("ADCINTFLG")
    7966                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ADCINTFLG")
    7967                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    7968                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    7969              
    7970              $C$DW$685       .dwtag  DW_TAG_member
    7971                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$23)
    7972                      .dwattr $C$DW$685, DW_AT_name("ADCINTFLGCLR")
    7973                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    7974                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    7975                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    7976              
    7977              $C$DW$686       .dwtag  DW_TAG_member
    7978                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$23)
    7979                      .dwattr $C$DW$686, DW_AT_name("ADCINTOVF")
    7980                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCINTOVF")
    7981                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    7982                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    7983              
    7984              $C$DW$687       .dwtag  DW_TAG_member
    7985                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$23)
    7986                      .dwattr $C$DW$687, DW_AT_name("ADCINTOVFCLR")
    7987                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    7988                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    7989                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7990              
    7991              $C$DW$688       .dwtag  DW_TAG_member
    7992                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$27)
    7993                      .dwattr $C$DW$688, DW_AT_name("INTSELxNy")
    7994                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_INTSELxNy")
    7995                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    7996                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7997              
    7998              $C$DW$689       .dwtag  DW_TAG_member
    7999                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$28)
    8000                      .dwattr $C$DW$689, DW_AT_name("rsvd_3")
    8001                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_3")
    8002                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8003                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8004              
    8005              $C$DW$690       .dwtag  DW_TAG_member
    8006                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$23)
    8007                      .dwattr $C$DW$690, DW_AT_name("SOCPRICTRL")
    8008                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_SOCPRICTRL")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  153

    8009                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8010                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8011              
    8012              $C$DW$691       .dwtag  DW_TAG_member
    8013                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$23)
    8014                      .dwattr $C$DW$691, DW_AT_name("rsvd_4")
    8015                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_4")
    8016                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8017                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8018              
    8019              $C$DW$692       .dwtag  DW_TAG_member
    8020                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$23)
    8021                      .dwattr $C$DW$692, DW_AT_name("ADCSAMPLEMODE")
    8022                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8023                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8024                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8025              
    8026              $C$DW$693       .dwtag  DW_TAG_member
    8027                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$23)
    8028                      .dwattr $C$DW$693, DW_AT_name("rsvd_5")
    8029                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_rsvd_5")
    8030                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8031                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8032              
    8033              $C$DW$694       .dwtag  DW_TAG_member
    8034                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$23)
    8035                      .dwattr $C$DW$694, DW_AT_name("ADCINTSOCSEL1")
    8036                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8037                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8038                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8039              
    8040              $C$DW$695       .dwtag  DW_TAG_member
    8041                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$23)
    8042                      .dwattr $C$DW$695, DW_AT_name("ADCINTSOCSEL2")
    8043                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8044                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8045                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8046              
    8047              $C$DW$696       .dwtag  DW_TAG_member
    8048                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$26)
    8049                      .dwattr $C$DW$696, DW_AT_name("rsvd_6")
    8050                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd_6")
    8051                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8052                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8053              
    8054              $C$DW$697       .dwtag  DW_TAG_member
    8055                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$23)
    8056                      .dwattr $C$DW$697, DW_AT_name("ADCSOCFLG1")
    8057                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8058                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8059                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8060              
    8061              $C$DW$698       .dwtag  DW_TAG_member
    8062                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$23)
    8063                      .dwattr $C$DW$698, DW_AT_name("rsvd_7")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  154

    8064                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_rsvd_7")
    8065                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8066                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8067              
    8068              $C$DW$699       .dwtag  DW_TAG_member
    8069                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$23)
    8070                      .dwattr $C$DW$699, DW_AT_name("ADCSOCFRC1")
    8071                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8072                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8073                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8074              
    8075              $C$DW$700       .dwtag  DW_TAG_member
    8076                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$23)
    8077                      .dwattr $C$DW$700, DW_AT_name("rsvd_8")
    8078                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_rsvd_8")
    8079                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8080                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8081              
    8082              $C$DW$701       .dwtag  DW_TAG_member
    8083                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$23)
    8084                      .dwattr $C$DW$701, DW_AT_name("ADCSOCOVF1")
    8085                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8086                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8087                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8088              
    8089              $C$DW$702       .dwtag  DW_TAG_member
    8090                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$23)
    8091                      .dwattr $C$DW$702, DW_AT_name("rsvd_9")
    8092                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_rsvd_9")
    8093                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8094                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8095              
    8096              $C$DW$703       .dwtag  DW_TAG_member
    8097                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$23)
    8098                      .dwattr $C$DW$703, DW_AT_name("ADCSOCOVFCLR1")
    8099                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8100                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8101                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8102              
    8103              $C$DW$704       .dwtag  DW_TAG_member
    8104                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$23)
    8105                      .dwattr $C$DW$704, DW_AT_name("rsvd_10")
    8106                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd_10")
    8107                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8108                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8109              
    8110              $C$DW$705       .dwtag  DW_TAG_member
    8111                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$24)
    8112                      .dwattr $C$DW$705, DW_AT_name("ADCSOCxCTL")
    8113                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8114                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8115                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8116              
    8117              $C$DW$706       .dwtag  DW_TAG_member
    8118                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  155

    8119                      .dwattr $C$DW$706, DW_AT_name("rsvd_11")
    8120                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd_11")
    8121                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8122                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8123              
    8124              $C$DW$707       .dwtag  DW_TAG_member
    8125                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$23)
    8126                      .dwattr $C$DW$707, DW_AT_name("ADCREFTRIM")
    8127                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8128                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8129                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8130              
    8131              $C$DW$708       .dwtag  DW_TAG_member
    8132                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$23)
    8133                      .dwattr $C$DW$708, DW_AT_name("ADCOFFTRIM")
    8134                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8135                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8136                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8137              
    8138              $C$DW$709       .dwtag  DW_TAG_member
    8139                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$29)
    8140                      .dwattr $C$DW$709, DW_AT_name("resvd_12")
    8141                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_resvd_12")
    8142                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8143                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8144              
    8145              $C$DW$710       .dwtag  DW_TAG_member
    8146                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$23)
    8147                      .dwattr $C$DW$710, DW_AT_name("ADCREV")
    8148                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ADCREV")
    8149                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8150                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8151              
    8152                      .dwendtag $C$DW$T$30
    8153              
    8154              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    8155                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$30)
    8156                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    8157              
    8158              $C$DW$T$90      .dwtag  DW_TAG_typedef
    8159                      .dwattr $C$DW$T$90, DW_AT_name("ADC_Handle")
    8160                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    8161                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    8162              
    8163              
    8164              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    8165                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    8166                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    8167              $C$DW$711       .dwtag  DW_TAG_member
    8168                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$31)
    8169                      .dwattr $C$DW$711, DW_AT_name("alpha_sf")
    8170                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_alpha_sf")
    8171                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8172                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8173              
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  156

    8174              $C$DW$712       .dwtag  DW_TAG_member
    8175                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$31)
    8176                      .dwattr $C$DW$712, DW_AT_name("beta_sf")
    8177                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_beta_sf")
    8178                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8179                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8180              
    8181              $C$DW$713       .dwtag  DW_TAG_member
    8182                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$32)
    8183                      .dwattr $C$DW$713, DW_AT_name("numSensors")
    8184                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_numSensors")
    8185                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8186                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8187              
    8188                      .dwendtag $C$DW$T$33
    8189              
    8190              $C$DW$T$44      .dwtag  DW_TAG_typedef
    8191                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    8192                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    8193                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    8194              
    8195              $C$DW$T$183     .dwtag  DW_TAG_pointer_type
    8196                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$44)
    8197                      .dwattr $C$DW$T$183, DW_AT_address_class(0x20)
    8198              
    8199              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    8200                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    8201                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    8202              
    8203              $C$DW$T$43      .dwtag  DW_TAG_typedef
    8204                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    8205                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    8206                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    8207              
    8208              
    8209              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8210                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    8211                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    8212              $C$DW$714       .dwtag  DW_TAG_member
    8213                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$23)
    8214                      .dwattr $C$DW$714, DW_AT_name("XCLK")
    8215                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_XCLK")
    8216                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8217                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8218              
    8219              $C$DW$715       .dwtag  DW_TAG_member
    8220                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$23)
    8221                      .dwattr $C$DW$715, DW_AT_name("rsvd_1")
    8222                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_rsvd_1")
    8223                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8224                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8225              
    8226              $C$DW$716       .dwtag  DW_TAG_member
    8227                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$23)
    8228                      .dwattr $C$DW$716, DW_AT_name("CLKCTL")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  157

    8229                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_CLKCTL")
    8230                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8231                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8232              
    8233              $C$DW$717       .dwtag  DW_TAG_member
    8234                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$34)
    8235                      .dwattr $C$DW$717, DW_AT_name("rsvd_2")
    8236                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_rsvd_2")
    8237                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8238                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8239              
    8240              $C$DW$718       .dwtag  DW_TAG_member
    8241                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$23)
    8242                      .dwattr $C$DW$718, DW_AT_name("LOSPCP")
    8243                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_LOSPCP")
    8244                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8245                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8246              
    8247              $C$DW$719       .dwtag  DW_TAG_member
    8248                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$23)
    8249                      .dwattr $C$DW$719, DW_AT_name("PCLKCR0")
    8250                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_PCLKCR0")
    8251                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8252                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8253              
    8254              $C$DW$720       .dwtag  DW_TAG_member
    8255                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$23)
    8256                      .dwattr $C$DW$720, DW_AT_name("PCLKCR1")
    8257                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_PCLKCR1")
    8258                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8259                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8260              
    8261              $C$DW$721       .dwtag  DW_TAG_member
    8262                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$26)
    8263                      .dwattr $C$DW$721, DW_AT_name("rsvd_3")
    8264                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_rsvd_3")
    8265                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8266                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8267              
    8268              $C$DW$722       .dwtag  DW_TAG_member
    8269                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$23)
    8270                      .dwattr $C$DW$722, DW_AT_name("PCLKCR3")
    8271                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_PCLKCR3")
    8272                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8273                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8274              
    8275                      .dwendtag $C$DW$T$35
    8276              
    8277              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    8278                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$35)
    8279                      .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    8280              
    8281              $C$DW$T$92      .dwtag  DW_TAG_typedef
    8282                      .dwattr $C$DW$T$92, DW_AT_name("CLK_Handle")
    8283                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  158

    8284                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    8285              
    8286              
    8287              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    8288                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    8289                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    8290              $C$DW$723       .dwtag  DW_TAG_member
    8291                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$32)
    8292                      .dwattr $C$DW$723, DW_AT_name("tmp")
    8293                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_tmp")
    8294                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8295                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8296              
    8297                      .dwendtag $C$DW$T$36
    8298              
    8299              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    8300                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$36)
    8301                      .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    8302              
    8303              $C$DW$T$94      .dwtag  DW_TAG_typedef
    8304                      .dwattr $C$DW$T$94, DW_AT_name("CPU_Handle")
    8305                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    8306                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    8307              
    8308              
    8309              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    8310                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    8311                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    8312              $C$DW$724       .dwtag  DW_TAG_member
    8313                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$37)
    8314                      .dwattr $C$DW$724, DW_AT_name("version")
    8315                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_version")
    8316                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8317                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8318              
    8319              $C$DW$725       .dwtag  DW_TAG_member
    8320                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$39)
    8321                      .dwattr $C$DW$725, DW_AT_name("state")
    8322                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_state")
    8323                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8324                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8325              
    8326              $C$DW$726       .dwtag  DW_TAG_member
    8327                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$39)
    8328                      .dwattr $C$DW$726, DW_AT_name("prevState")
    8329                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_prevState")
    8330                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8331                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8332              
    8333              $C$DW$727       .dwtag  DW_TAG_member
    8334                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$41)
    8335                      .dwattr $C$DW$727, DW_AT_name("errorCode")
    8336                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_errorCode")
    8337                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8338                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  159

    8339              
    8340              $C$DW$728       .dwtag  DW_TAG_member
    8341                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$43)
    8342                      .dwattr $C$DW$728, DW_AT_name("clarkeHandle_I")
    8343                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8344                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8345                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8346              
    8347              $C$DW$729       .dwtag  DW_TAG_member
    8348                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$44)
    8349                      .dwattr $C$DW$729, DW_AT_name("clarke_I")
    8350                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_clarke_I")
    8351                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8352                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8353              
    8354              $C$DW$730       .dwtag  DW_TAG_member
    8355                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$43)
    8356                      .dwattr $C$DW$730, DW_AT_name("clarkeHandle_V")
    8357                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8358                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8359                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8360              
    8361              $C$DW$731       .dwtag  DW_TAG_member
    8362                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$44)
    8363                      .dwattr $C$DW$731, DW_AT_name("clarke_V")
    8364                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_clarke_V")
    8365                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8366                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8367              
    8368              $C$DW$732       .dwtag  DW_TAG_member
    8369                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$46)
    8370                      .dwattr $C$DW$732, DW_AT_name("estHandle")
    8371                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_estHandle")
    8372                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8373                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8374              
    8375              $C$DW$733       .dwtag  DW_TAG_member
    8376                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$48)
    8377                      .dwattr $C$DW$733, DW_AT_name("parkHandle")
    8378                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_parkHandle")
    8379                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8380                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8381              
    8382              $C$DW$734       .dwtag  DW_TAG_member
    8383                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$49)
    8384                      .dwattr $C$DW$734, DW_AT_name("park")
    8385                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_park")
    8386                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8387                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8388              
    8389              $C$DW$735       .dwtag  DW_TAG_member
    8390                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$51)
    8391                      .dwattr $C$DW$735, DW_AT_name("pidHandle_Id")
    8392                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_pidHandle_Id")
    8393                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  160

    8394                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8395              
    8396              $C$DW$736       .dwtag  DW_TAG_member
    8397                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$52)
    8398                      .dwattr $C$DW$736, DW_AT_name("pid_Id")
    8399                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_pid_Id")
    8400                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8401                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8402              
    8403              $C$DW$737       .dwtag  DW_TAG_member
    8404                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$51)
    8405                      .dwattr $C$DW$737, DW_AT_name("pidHandle_Iq")
    8406                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8407                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8408                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8409              
    8410              $C$DW$738       .dwtag  DW_TAG_member
    8411                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$52)
    8412                      .dwattr $C$DW$738, DW_AT_name("pid_Iq")
    8413                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_pid_Iq")
    8414                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8415                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8416              
    8417              $C$DW$739       .dwtag  DW_TAG_member
    8418                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$51)
    8419                      .dwattr $C$DW$739, DW_AT_name("pidHandle_spd")
    8420                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_pidHandle_spd")
    8421                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8422                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8423              
    8424              $C$DW$740       .dwtag  DW_TAG_member
    8425                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$52)
    8426                      .dwattr $C$DW$740, DW_AT_name("pid_spd")
    8427                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_pid_spd")
    8428                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8429                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8430              
    8431              $C$DW$741       .dwtag  DW_TAG_member
    8432                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$54)
    8433                      .dwattr $C$DW$741, DW_AT_name("iparkHandle")
    8434                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_iparkHandle")
    8435                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8436                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8437              
    8438              $C$DW$742       .dwtag  DW_TAG_member
    8439                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$55)
    8440                      .dwattr $C$DW$742, DW_AT_name("ipark")
    8441                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_ipark")
    8442                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8443                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8444              
    8445              $C$DW$743       .dwtag  DW_TAG_member
    8446                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$57)
    8447                      .dwattr $C$DW$743, DW_AT_name("svgenHandle")
    8448                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_svgenHandle")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  161

    8449                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8450                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8451              
    8452              $C$DW$744       .dwtag  DW_TAG_member
    8453                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$58)
    8454                      .dwattr $C$DW$744, DW_AT_name("svgen")
    8455                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_svgen")
    8456                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8457                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8458              
    8459              $C$DW$745       .dwtag  DW_TAG_member
    8460                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$60)
    8461                      .dwattr $C$DW$745, DW_AT_name("trajHandle_Id")
    8462                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_trajHandle_Id")
    8463                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8464                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8465              
    8466              $C$DW$746       .dwtag  DW_TAG_member
    8467                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$61)
    8468                      .dwattr $C$DW$746, DW_AT_name("traj_Id")
    8469                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_traj_Id")
    8470                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8471                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8472              
    8473              $C$DW$747       .dwtag  DW_TAG_member
    8474                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$60)
    8475                      .dwattr $C$DW$747, DW_AT_name("trajHandle_spd")
    8476                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_trajHandle_spd")
    8477                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8478                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8479              
    8480              $C$DW$748       .dwtag  DW_TAG_member
    8481                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$61)
    8482                      .dwattr $C$DW$748, DW_AT_name("traj_spd")
    8483                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_traj_spd")
    8484                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    8485                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8486              
    8487              $C$DW$749       .dwtag  DW_TAG_member
    8488                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$60)
    8489                      .dwattr $C$DW$749, DW_AT_name("trajHandle_spdMax")
    8490                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    8491                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8492                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8493              
    8494              $C$DW$750       .dwtag  DW_TAG_member
    8495                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$61)
    8496                      .dwattr $C$DW$750, DW_AT_name("traj_spdMax")
    8497                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_traj_spdMax")
    8498                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8499                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8500              
    8501              $C$DW$751       .dwtag  DW_TAG_member
    8502                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$62)
    8503                      .dwattr $C$DW$751, DW_AT_name("motorParams")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  162

    8504                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_motorParams")
    8505                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    8506                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8507              
    8508              $C$DW$752       .dwtag  DW_TAG_member
    8509                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$65)
    8510                      .dwattr $C$DW$752, DW_AT_name("waitTimes")
    8511                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_waitTimes")
    8512                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    8513                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8514              
    8515              $C$DW$753       .dwtag  DW_TAG_member
    8516                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$64)
    8517                      .dwattr $C$DW$753, DW_AT_name("counter_state")
    8518                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_counter_state")
    8519                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    8520                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8521              
    8522              $C$DW$754       .dwtag  DW_TAG_member
    8523                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$66)
    8524                      .dwattr $C$DW$754, DW_AT_name("numIsrTicksPerCtrlTick")
    8525                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    8526                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    8527                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8528              
    8529              $C$DW$755       .dwtag  DW_TAG_member
    8530                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$66)
    8531                      .dwattr $C$DW$755, DW_AT_name("numCtrlTicksPerCurrentTick")
    8532                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    8533                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    8534                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8535              
    8536              $C$DW$756       .dwtag  DW_TAG_member
    8537                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$66)
    8538                      .dwattr $C$DW$756, DW_AT_name("numCtrlTicksPerSpeedTick")
    8539                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    8540                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    8541                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8542              
    8543              $C$DW$757       .dwtag  DW_TAG_member
    8544                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$66)
    8545                      .dwattr $C$DW$757, DW_AT_name("numCtrlTicksPerTrajTick")
    8546                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    8547                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    8548                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8549              
    8550              $C$DW$758       .dwtag  DW_TAG_member
    8551                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$64)
    8552                      .dwattr $C$DW$758, DW_AT_name("ctrlFreq_Hz")
    8553                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    8554                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8555                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8556              
    8557              $C$DW$759       .dwtag  DW_TAG_member
    8558                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$64)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  163

    8559                      .dwattr $C$DW$759, DW_AT_name("trajFreq_Hz")
    8560                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_trajFreq_Hz")
    8561                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8562                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8563              
    8564              $C$DW$760       .dwtag  DW_TAG_member
    8565                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$31)
    8566                      .dwattr $C$DW$760, DW_AT_name("trajPeriod_sec")
    8567                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_trajPeriod_sec")
    8568                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8569                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8570              
    8571              $C$DW$761       .dwtag  DW_TAG_member
    8572                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$67)
    8573                      .dwattr $C$DW$761, DW_AT_name("ctrlPeriod_sec")
    8574                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    8575                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    8576                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8577              
    8578              $C$DW$762       .dwtag  DW_TAG_member
    8579                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$31)
    8580                      .dwattr $C$DW$762, DW_AT_name("maxVsMag_pu")
    8581                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_maxVsMag_pu")
    8582                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    8583                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8584              
    8585              $C$DW$763       .dwtag  DW_TAG_member
    8586                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$68)
    8587                      .dwattr $C$DW$763, DW_AT_name("Iab_in")
    8588                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_Iab_in")
    8589                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    8590                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8591              
    8592              $C$DW$764       .dwtag  DW_TAG_member
    8593                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$68)
    8594                      .dwattr $C$DW$764, DW_AT_name("Iab_filt")
    8595                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_Iab_filt")
    8596                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    8597                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8598              
    8599              $C$DW$765       .dwtag  DW_TAG_member
    8600                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$68)
    8601                      .dwattr $C$DW$765, DW_AT_name("Idq_in")
    8602                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_Idq_in")
    8603                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    8604                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8605              
    8606              $C$DW$766       .dwtag  DW_TAG_member
    8607                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$68)
    8608                      .dwattr $C$DW$766, DW_AT_name("Vab_in")
    8609                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_Vab_in")
    8610                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    8611                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8612              
    8613              $C$DW$767       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  164

    8614                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$31)
    8615                      .dwattr $C$DW$767, DW_AT_name("spd_out")
    8616                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_spd_out")
    8617                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    8618                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8619              
    8620              $C$DW$768       .dwtag  DW_TAG_member
    8621                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$68)
    8622                      .dwattr $C$DW$768, DW_AT_name("Vab_out")
    8623                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_Vab_out")
    8624                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    8625                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8626              
    8627              $C$DW$769       .dwtag  DW_TAG_member
    8628                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$68)
    8629                      .dwattr $C$DW$769, DW_AT_name("Vdq_out")
    8630                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_Vdq_out")
    8631                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    8632                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8633              
    8634              $C$DW$770       .dwtag  DW_TAG_member
    8635                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$67)
    8636                      .dwattr $C$DW$770, DW_AT_name("Rhf")
    8637                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_Rhf")
    8638                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    8639                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8640              
    8641              $C$DW$771       .dwtag  DW_TAG_member
    8642                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$67)
    8643                      .dwattr $C$DW$771, DW_AT_name("Lhf")
    8644                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Lhf")
    8645                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    8646                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8647              
    8648              $C$DW$772       .dwtag  DW_TAG_member
    8649                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$67)
    8650                      .dwattr $C$DW$772, DW_AT_name("RoverL")
    8651                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_RoverL")
    8652                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    8653                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8654              
    8655              $C$DW$773       .dwtag  DW_TAG_member
    8656                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$31)
    8657                      .dwattr $C$DW$773, DW_AT_name("Kp_Id")
    8658                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Kp_Id")
    8659                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    8660                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8661              
    8662              $C$DW$774       .dwtag  DW_TAG_member
    8663                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$31)
    8664                      .dwattr $C$DW$774, DW_AT_name("Kp_Iq")
    8665                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Kp_Iq")
    8666                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    8667                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8668              
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  165

    8669              $C$DW$775       .dwtag  DW_TAG_member
    8670                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$31)
    8671                      .dwattr $C$DW$775, DW_AT_name("Kp_spd")
    8672                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_Kp_spd")
    8673                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    8674                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8675              
    8676              $C$DW$776       .dwtag  DW_TAG_member
    8677                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$31)
    8678                      .dwattr $C$DW$776, DW_AT_name("Ki_Id")
    8679                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Ki_Id")
    8680                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    8681                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8682              
    8683              $C$DW$777       .dwtag  DW_TAG_member
    8684                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$31)
    8685                      .dwattr $C$DW$777, DW_AT_name("Ki_Iq")
    8686                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Ki_Iq")
    8687                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    8688                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8689              
    8690              $C$DW$778       .dwtag  DW_TAG_member
    8691                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$31)
    8692                      .dwattr $C$DW$778, DW_AT_name("Ki_spd")
    8693                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Ki_spd")
    8694                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    8695                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8696              
    8697              $C$DW$779       .dwtag  DW_TAG_member
    8698                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$31)
    8699                      .dwattr $C$DW$779, DW_AT_name("Kd_Id")
    8700                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Kd_Id")
    8701                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    8702                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8703              
    8704              $C$DW$780       .dwtag  DW_TAG_member
    8705                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$31)
    8706                      .dwattr $C$DW$780, DW_AT_name("Kd_Iq")
    8707                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Kd_Iq")
    8708                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    8709                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8710              
    8711              $C$DW$781       .dwtag  DW_TAG_member
    8712                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$31)
    8713                      .dwattr $C$DW$781, DW_AT_name("Kd_spd")
    8714                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Kd_spd")
    8715                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    8716                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8717              
    8718              $C$DW$782       .dwtag  DW_TAG_member
    8719                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$31)
    8720                      .dwattr $C$DW$782, DW_AT_name("Ui_Id")
    8721                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Ui_Id")
    8722                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    8723                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  166

    8724              
    8725              $C$DW$783       .dwtag  DW_TAG_member
    8726                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$31)
    8727                      .dwattr $C$DW$783, DW_AT_name("Ui_Iq")
    8728                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Ui_Iq")
    8729                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    8730                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8731              
    8732              $C$DW$784       .dwtag  DW_TAG_member
    8733                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$31)
    8734                      .dwattr $C$DW$784, DW_AT_name("Ui_spd")
    8735                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Ui_spd")
    8736                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    8737                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8738              
    8739              $C$DW$785       .dwtag  DW_TAG_member
    8740                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$68)
    8741                      .dwattr $C$DW$785, DW_AT_name("Idq_ref")
    8742                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Idq_ref")
    8743                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    8744                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8745              
    8746              $C$DW$786       .dwtag  DW_TAG_member
    8747                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$31)
    8748                      .dwattr $C$DW$786, DW_AT_name("IdRated")
    8749                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_IdRated")
    8750                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    8751                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8752              
    8753              $C$DW$787       .dwtag  DW_TAG_member
    8754                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$31)
    8755                      .dwattr $C$DW$787, DW_AT_name("spd_ref")
    8756                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_spd_ref")
    8757                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    8758                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8759              
    8760              $C$DW$788       .dwtag  DW_TAG_member
    8761                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$31)
    8762                      .dwattr $C$DW$788, DW_AT_name("spd_max")
    8763                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_spd_max")
    8764                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    8765                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8766              
    8767              $C$DW$789       .dwtag  DW_TAG_member
    8768                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$66)
    8769                      .dwattr $C$DW$789, DW_AT_name("counter_current")
    8770                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_counter_current")
    8771                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    8772                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8773              
    8774              $C$DW$790       .dwtag  DW_TAG_member
    8775                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$66)
    8776                      .dwattr $C$DW$790, DW_AT_name("counter_isr")
    8777                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_counter_isr")
    8778                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  167

    8779                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    8780              
    8781              $C$DW$791       .dwtag  DW_TAG_member
    8782                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$66)
    8783                      .dwattr $C$DW$791, DW_AT_name("counter_speed")
    8784                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_counter_speed")
    8785                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    8786                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    8787              
    8788              $C$DW$792       .dwtag  DW_TAG_member
    8789                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$66)
    8790                      .dwattr $C$DW$792, DW_AT_name("counter_traj")
    8791                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_counter_traj")
    8792                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    8793                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    8794              
    8795              $C$DW$793       .dwtag  DW_TAG_member
    8796                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$69)
    8797                      .dwattr $C$DW$793, DW_AT_name("flag_enableCtrl")
    8798                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_flag_enableCtrl")
    8799                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    8800                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    8801              
    8802              $C$DW$794       .dwtag  DW_TAG_member
    8803                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$69)
    8804                      .dwattr $C$DW$794, DW_AT_name("flag_enableDcBusComp")
    8805                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    8806                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    8807                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    8808              
    8809              $C$DW$795       .dwtag  DW_TAG_member
    8810                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$69)
    8811                      .dwattr $C$DW$795, DW_AT_name("flag_enablePowerWarp")
    8812                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    8813                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    8814                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    8815              
    8816              $C$DW$796       .dwtag  DW_TAG_member
    8817                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$69)
    8818                      .dwattr $C$DW$796, DW_AT_name("flag_enableOffset")
    8819                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_flag_enableOffset")
    8820                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    8821                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    8822              
    8823              $C$DW$797       .dwtag  DW_TAG_member
    8824                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$69)
    8825                      .dwattr $C$DW$797, DW_AT_name("flag_enableSpeedCtrl")
    8826                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    8827                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    8828                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    8829              
    8830              $C$DW$798       .dwtag  DW_TAG_member
    8831                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$69)
    8832                      .dwattr $C$DW$798, DW_AT_name("flag_enableUserMotorParams")
    8833                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  168

    8834                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    8835                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    8836              
    8837              $C$DW$799       .dwtag  DW_TAG_member
    8838                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$68)
    8839                      .dwattr $C$DW$799, DW_AT_name("Idq_offset_pu")
    8840                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_Idq_offset_pu")
    8841                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    8842                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    8843              
    8844              $C$DW$800       .dwtag  DW_TAG_member
    8845                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$68)
    8846                      .dwattr $C$DW$800, DW_AT_name("Vdq_offset_pu")
    8847                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    8848                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    8849                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    8850              
    8851              $C$DW$801       .dwtag  DW_TAG_member
    8852                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$31)
    8853                      .dwattr $C$DW$801, DW_AT_name("angle_pu")
    8854                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_angle_pu")
    8855                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    8856                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    8857              
    8858              $C$DW$802       .dwtag  DW_TAG_member
    8859                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$31)
    8860                      .dwattr $C$DW$802, DW_AT_name("speed_ref_pu")
    8861                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_speed_ref_pu")
    8862                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    8863                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    8864              
    8865              $C$DW$803       .dwtag  DW_TAG_member
    8866                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$31)
    8867                      .dwattr $C$DW$803, DW_AT_name("speed_fb_pu")
    8868                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_speed_fb_pu")
    8869                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    8870                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    8871              
    8872              $C$DW$804       .dwtag  DW_TAG_member
    8873                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$31)
    8874                      .dwattr $C$DW$804, DW_AT_name("speed_outMax_pu")
    8875                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_speed_outMax_pu")
    8876                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    8877                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    8878              
    8879              $C$DW$805       .dwtag  DW_TAG_member
    8880                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$69)
    8881                      .dwattr $C$DW$805, DW_AT_name("flag_enableCurrentCtrl")
    8882                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    8883                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    8884                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    8885              
    8886                      .dwendtag $C$DW$T$70
    8887              
    8888              $C$DW$T$184     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  169

    8889                      .dwattr $C$DW$T$184, DW_AT_name("CTRL_Obj")
    8890                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$70)
    8891                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    8892              
    8893              $C$DW$T$170     .dwtag  DW_TAG_pointer_type
    8894                      .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$70)
    8895                      .dwattr $C$DW$T$170, DW_AT_address_class(0x20)
    8896              
    8897              $C$DW$T$171     .dwtag  DW_TAG_typedef
    8898                      .dwattr $C$DW$T$171, DW_AT_name("CTRL_Handle")
    8899                      .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$170)
    8900                      .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    8901              
    8902              $C$DW$806       .dwtag  DW_TAG_TI_far_type
    8903                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$171)
    8904              
    8905              $C$DW$T$185     .dwtag  DW_TAG_const_type
    8906                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$806)
    8907              
    8908              
    8909              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    8910                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    8911                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    8912              $C$DW$807       .dwtag  DW_TAG_member
    8913                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$22)
    8914                      .dwattr $C$DW$807, DW_AT_name("rsvd")
    8915                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_rsvd")
    8916                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8917                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    8918              
    8919              $C$DW$808       .dwtag  DW_TAG_member
    8920                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$72)
    8921                      .dwattr $C$DW$808, DW_AT_name("targetProc")
    8922                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_targetProc")
    8923                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8924                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    8925              
    8926              $C$DW$809       .dwtag  DW_TAG_member
    8927                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$22)
    8928                      .dwattr $C$DW$809, DW_AT_name("major")
    8929                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_major")
    8930                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8931                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    8932              
    8933              $C$DW$810       .dwtag  DW_TAG_member
    8934                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$22)
    8935                      .dwattr $C$DW$810, DW_AT_name("minor")
    8936                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_minor")
    8937                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8938                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    8939              
    8940                      .dwendtag $C$DW$T$73
    8941              
    8942              $C$DW$T$37      .dwtag  DW_TAG_typedef
    8943                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  170

    8944                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    8945                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    8946              
    8947              
    8948              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    8949                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8301_Obj_")
    8950                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    8951              $C$DW$811       .dwtag  DW_TAG_member
    8952                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$75)
    8953                      .dwattr $C$DW$811, DW_AT_name("spiHandle")
    8954                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_spiHandle")
    8955                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8956                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    8957              
    8958              $C$DW$812       .dwtag  DW_TAG_member
    8959                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$77)
    8960                      .dwattr $C$DW$812, DW_AT_name("gpioHandle")
    8961                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_gpioHandle")
    8962                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8963                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    8964              
    8965              $C$DW$813       .dwtag  DW_TAG_member
    8966                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$79)
    8967                      .dwattr $C$DW$813, DW_AT_name("gpioNumber")
    8968                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_gpioNumber")
    8969                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8970                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    8971              
    8972              $C$DW$814       .dwtag  DW_TAG_member
    8973                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$69)
    8974                      .dwattr $C$DW$814, DW_AT_name("RxTimeOut")
    8975                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_RxTimeOut")
    8976                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8977                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    8978              
    8979              $C$DW$815       .dwtag  DW_TAG_member
    8980                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$69)
    8981                      .dwattr $C$DW$815, DW_AT_name("enableTimeOut")
    8982                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_enableTimeOut")
    8983                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8984                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    8985              
    8986                      .dwendtag $C$DW$T$80
    8987              
    8988              $C$DW$T$122     .dwtag  DW_TAG_typedef
    8989                      .dwattr $C$DW$T$122, DW_AT_name("DRV8301_Obj")
    8990                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$80)
    8991                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    8992              
    8993              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    8994                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$80)
    8995                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    8996              
    8997              $C$DW$T$121     .dwtag  DW_TAG_typedef
    8998                      .dwattr $C$DW$T$121, DW_AT_name("DRV8301_Handle")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  171

    8999                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    9000                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    9001              
    9002              
    9003              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9004                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    9005                      .dwattr $C$DW$T$19, DW_AT_declaration
    9006                      .dwendtag $C$DW$T$19
    9007              
    9008              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    9009                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$19)
    9010                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    9011              
    9012              $C$DW$T$46      .dwtag  DW_TAG_typedef
    9013                      .dwattr $C$DW$T$46, DW_AT_name("EST_Handle")
    9014                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    9015                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    9016              
    9017              
    9018              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    9019                      .dwattr $C$DW$T$81, DW_AT_name("_FILTER_FO_")
    9020                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0a)
    9021              $C$DW$816       .dwtag  DW_TAG_member
    9022                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$31)
    9023                      .dwattr $C$DW$816, DW_AT_name("a1")
    9024                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_a1")
    9025                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9026                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    9027              
    9028              $C$DW$817       .dwtag  DW_TAG_member
    9029                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$31)
    9030                      .dwattr $C$DW$817, DW_AT_name("b0")
    9031                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_b0")
    9032                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9033                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    9034              
    9035              $C$DW$818       .dwtag  DW_TAG_member
    9036                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$31)
    9037                      .dwattr $C$DW$818, DW_AT_name("b1")
    9038                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_b1")
    9039                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9040                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    9041              
    9042              $C$DW$819       .dwtag  DW_TAG_member
    9043                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$31)
    9044                      .dwattr $C$DW$819, DW_AT_name("x1")
    9045                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_x1")
    9046                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9047                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9048              
    9049              $C$DW$820       .dwtag  DW_TAG_member
    9050                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$31)
    9051                      .dwattr $C$DW$820, DW_AT_name("y1")
    9052                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_y1")
    9053                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  172

    9054                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    9055              
    9056                      .dwendtag $C$DW$T$81
    9057              
    9058              $C$DW$T$135     .dwtag  DW_TAG_typedef
    9059                      .dwattr $C$DW$T$135, DW_AT_name("FILTER_FO_Obj")
    9060                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$81)
    9061                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    9062              
    9063              $C$DW$T$187     .dwtag  DW_TAG_pointer_type
    9064                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$135)
    9065                      .dwattr $C$DW$T$187, DW_AT_address_class(0x20)
    9066              
    9067              
    9068              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9069                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    9070                      .dwattr $C$DW$T$20, DW_AT_declaration
    9071                      .dwendtag $C$DW$T$20
    9072              
    9073              $C$DW$T$136     .dwtag  DW_TAG_pointer_type
    9074                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$20)
    9075                      .dwattr $C$DW$T$136, DW_AT_address_class(0x20)
    9076              
    9077              $C$DW$T$137     .dwtag  DW_TAG_typedef
    9078                      .dwattr $C$DW$T$137, DW_AT_name("FILTER_FO_Handle")
    9079                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
    9080                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    9081              
    9082              
    9083              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    9084                      .dwattr $C$DW$T$82, DW_AT_name("_FLASH_Obj_")
    9085                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
    9086              $C$DW$821       .dwtag  DW_TAG_member
    9087                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$23)
    9088                      .dwattr $C$DW$821, DW_AT_name("FOPT")
    9089                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_FOPT")
    9090                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9091                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    9092              
    9093              $C$DW$822       .dwtag  DW_TAG_member
    9094                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$23)
    9095                      .dwattr $C$DW$822, DW_AT_name("rsvd_1")
    9096                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_rsvd_1")
    9097                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9098                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    9099              
    9100              $C$DW$823       .dwtag  DW_TAG_member
    9101                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$23)
    9102                      .dwattr $C$DW$823, DW_AT_name("FPWR")
    9103                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_FPWR")
    9104                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9105                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    9106              
    9107              $C$DW$824       .dwtag  DW_TAG_member
    9108                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  173

    9109                      .dwattr $C$DW$824, DW_AT_name("FSTATUS")
    9110                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_FSTATUS")
    9111                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9112                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    9113              
    9114              $C$DW$825       .dwtag  DW_TAG_member
    9115                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$23)
    9116                      .dwattr $C$DW$825, DW_AT_name("FSTDBYWAIT")
    9117                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9118                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9119                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    9120              
    9121              $C$DW$826       .dwtag  DW_TAG_member
    9122                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$23)
    9123                      .dwattr $C$DW$826, DW_AT_name("FACTIVEWAIT")
    9124                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9125                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9126                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    9127              
    9128              $C$DW$827       .dwtag  DW_TAG_member
    9129                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$23)
    9130                      .dwattr $C$DW$827, DW_AT_name("FBANKWAIT")
    9131                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_FBANKWAIT")
    9132                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9133                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    9134              
    9135              $C$DW$828       .dwtag  DW_TAG_member
    9136                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$23)
    9137                      .dwattr $C$DW$828, DW_AT_name("FOTPWAIT")
    9138                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_FOTPWAIT")
    9139                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9140                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    9141              
    9142                      .dwendtag $C$DW$T$82
    9143              
    9144              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    9145                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$82)
    9146                      .dwattr $C$DW$T$95, DW_AT_address_class(0x20)
    9147              
    9148              $C$DW$T$96      .dwtag  DW_TAG_typedef
    9149                      .dwattr $C$DW$T$96, DW_AT_name("FLASH_Handle")
    9150                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    9151                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    9152              
    9153              
    9154              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    9155                      .dwattr $C$DW$T$86, DW_AT_name("_GPIO_Obj_")
    9156                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x6a)
    9157              $C$DW$829       .dwtag  DW_TAG_member
    9158                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$83)
    9159                      .dwattr $C$DW$829, DW_AT_name("GPACTRL")
    9160                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_GPACTRL")
    9161                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9162                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    9163              
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:00 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0548010                          PAGE  174

    9164              $C$DW$830       .dwtag  DW_TAG_member
    9165                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$83)
    9166                      .dwattr $C$DW$830, DW_AT_name("GPAQSEL1")
    9167                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_GPAQSEL1")
    9168                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9169                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    9170              
    9171              $C$DW$831       .dwtag  DW_TAG_member
    9172                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$83)
    9173                      .dwattr $C$DW$831, DW_AT_name("GPAQSEL2")
    9174                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_GPAQSEL2")
    9175                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9176                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    9177              
    9178              $C$DW$832       .dwtag  DW_TAG_member
    9179                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$83)
    9180                      .dwattr $C$DW$832, DW_AT_name("GPAMUX1")
    9181                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_GPAMUX1")
    9182                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9183                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    9184              
    9185              $C$DW$833       .dwtag  DW_TAG_member
    9186                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$83)
    9187                      .dwattr $C$DW$833, DW_AT_name("GPAMUX2")
    9188                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_GPAMUX2")
    9189                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9190                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    9191              
    9192              $C$DW$834       .dwtag  DW_TAG_member
    9193                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$83)
    9194                      .dwattr $C$DW$834, DW_AT_name("GPADIR")
    9195                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_GPADIR")
