TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Thu Dec 01 16:31:31 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/drivers/drvic/drv8301/src/32b/f
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   78

    4091              
    4092              $C$DW$365       .dwtag  DW_TAG_enumerator
    4093                      .dwattr $C$DW$365, DW_AT_name("DRV8301_RegName_Status_2")
    4094                      .dwattr $C$DW$365, DW_AT_const_value(0x800)
    4095              
    4096              $C$DW$366       .dwtag  DW_TAG_enumerator
    4097                      .dwattr $C$DW$366, DW_AT_name("DRV8301_RegName_Control_1")
    4098                      .dwattr $C$DW$366, DW_AT_const_value(0x1000)
    4099              
    4100              $C$DW$367       .dwtag  DW_TAG_enumerator
    4101                      .dwattr $C$DW$367, DW_AT_name("DRV8301_RegName_Control_2")
    4102                      .dwattr $C$DW$367, DW_AT_const_value(0x1800)
    4103              
    4104                      .dwendtag $C$DW$T$106
    4105              
    4106              $C$DW$T$107     .dwtag  DW_TAG_typedef
    4107                      .dwattr $C$DW$T$107, DW_AT_name("DRV8301_RegName_e")
    4108                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    4109                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    4110              
    4111              $C$DW$368       .dwtag  DW_TAG_TI_far_type
    4112                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$107)
    4113              
    4114              $C$DW$T$108     .dwtag  DW_TAG_const_type
    4115                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$368)
    4116              
    4117              
    4118              $C$DW$T$109     .dwtag  DW_TAG_enumeration_type
    4119                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    4120              $C$DW$369       .dwtag  DW_TAG_enumerator
    4121                      .dwattr $C$DW$369, DW_AT_name("DRV8301_FaultType_NoFault")
    4122                      .dwattr $C$DW$369, DW_AT_const_value(0x00)
    4123              
    4124              $C$DW$370       .dwtag  DW_TAG_enumerator
    4125                      .dwattr $C$DW$370, DW_AT_name("DRV8301_FaultType_FETLC_OC")
    4126                      .dwattr $C$DW$370, DW_AT_const_value(0x01)
    4127              
    4128              $C$DW$371       .dwtag  DW_TAG_enumerator
    4129                      .dwattr $C$DW$371, DW_AT_name("DRV8301_FaultType_FETHC_OC")
    4130                      .dwattr $C$DW$371, DW_AT_const_value(0x02)
    4131              
    4132              $C$DW$372       .dwtag  DW_TAG_enumerator
    4133                      .dwattr $C$DW$372, DW_AT_name("DRV8301_FaultType_FETLB_OC")
    4134                      .dwattr $C$DW$372, DW_AT_const_value(0x04)
    4135              
    4136              $C$DW$373       .dwtag  DW_TAG_enumerator
    4137                      .dwattr $C$DW$373, DW_AT_name("DRV8301_FaultType_FETHB_OC")
    4138                      .dwattr $C$DW$373, DW_AT_const_value(0x08)
    4139              
    4140              $C$DW$374       .dwtag  DW_TAG_enumerator
    4141                      .dwattr $C$DW$374, DW_AT_name("DRV8301_FaultType_FETLA_OC")
    4142                      .dwattr $C$DW$374, DW_AT_const_value(0x10)
    4143              
    4144              $C$DW$375       .dwtag  DW_TAG_enumerator
    4145                      .dwattr $C$DW$375, DW_AT_name("DRV8301_FaultType_FETHA_OC")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   79

    4146                      .dwattr $C$DW$375, DW_AT_const_value(0x20)
    4147              
    4148              $C$DW$376       .dwtag  DW_TAG_enumerator
    4149                      .dwattr $C$DW$376, DW_AT_name("DRV8301_FaultType_OTW")
    4150                      .dwattr $C$DW$376, DW_AT_const_value(0x40)
    4151              
    4152              $C$DW$377       .dwtag  DW_TAG_enumerator
    4153                      .dwattr $C$DW$377, DW_AT_name("DRV8301_FaultType_OTSD")
    4154                      .dwattr $C$DW$377, DW_AT_const_value(0x80)
    4155              
    4156              $C$DW$378       .dwtag  DW_TAG_enumerator
    4157                      .dwattr $C$DW$378, DW_AT_name("DRV8301_FaultType_PVDD_UV")
    4158                      .dwattr $C$DW$378, DW_AT_const_value(0x100)
    4159              
    4160              $C$DW$379       .dwtag  DW_TAG_enumerator
    4161                      .dwattr $C$DW$379, DW_AT_name("DRV8301_FaultType_GVDD_UV")
    4162                      .dwattr $C$DW$379, DW_AT_const_value(0x200)
    4163              
    4164              $C$DW$380       .dwtag  DW_TAG_enumerator
    4165                      .dwattr $C$DW$380, DW_AT_name("DRV8301_FaultType_GVDD_OV")
    4166                      .dwattr $C$DW$380, DW_AT_const_value(0x400)
    4167              
    4168                      .dwendtag $C$DW$T$109
    4169              
    4170              $C$DW$T$110     .dwtag  DW_TAG_typedef
    4171                      .dwattr $C$DW$T$110, DW_AT_name("DRV8301_FaultType_e")
    4172                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    4173                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    4174              
    4175              
    4176              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4177                      .dwattr $C$DW$T$26, DW_AT_name("_DRV8301_Obj_")
    4178                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    4179              $C$DW$381       .dwtag  DW_TAG_member
    4180                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    4181                      .dwattr $C$DW$381, DW_AT_name("spiHandle")
    4182                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_spiHandle")
    4183                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4184                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4185              
    4186              $C$DW$382       .dwtag  DW_TAG_member
    4187                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$22)
    4188                      .dwattr $C$DW$382, DW_AT_name("gpioHandle")
    4189                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_gpioHandle")
    4190                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4191                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4192              
    4193              $C$DW$383       .dwtag  DW_TAG_member
    4194                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$24)
    4195                      .dwattr $C$DW$383, DW_AT_name("gpioNumber")
    4196                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_gpioNumber")
    4197                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4198                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4199              
    4200              $C$DW$384       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   80

    4201                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$25)
    4202                      .dwattr $C$DW$384, DW_AT_name("RxTimeOut")
    4203                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_RxTimeOut")
    4204                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4205                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4206              
    4207              $C$DW$385       .dwtag  DW_TAG_member
    4208                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$25)
    4209                      .dwattr $C$DW$385, DW_AT_name("enableTimeOut")
    4210                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_enableTimeOut")
    4211                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4212                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4213              
    4214                      .dwendtag $C$DW$T$26
    4215              
    4216              $C$DW$T$113     .dwtag  DW_TAG_typedef
    4217                      .dwattr $C$DW$T$113, DW_AT_name("DRV8301_Obj")
    4218                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$26)
    4219                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    4220              
    4221              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    4222                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$26)
    4223                      .dwattr $C$DW$T$69, DW_AT_address_class(0x20)
    4224              
    4225              $C$DW$T$70      .dwtag  DW_TAG_typedef
    4226                      .dwattr $C$DW$T$70, DW_AT_name("DRV8301_Handle")
    4227                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    4228                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4229              
    4230              $C$DW$386       .dwtag  DW_TAG_TI_far_type
    4231                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$70)
    4232              
    4233              $C$DW$T$114     .dwtag  DW_TAG_const_type
    4234                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$386)
    4235              
    4236              
    4237              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4238                      .dwattr $C$DW$T$37, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    4239                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x05)
    4240              $C$DW$387       .dwtag  DW_TAG_member
    4241                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$28)
    4242                      .dwattr $C$DW$387, DW_AT_name("DRV8301_CURRENT")
    4243                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    4244                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4245                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4246              
    4247              $C$DW$388       .dwtag  DW_TAG_member
    4248                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$30)
    4249                      .dwattr $C$DW$388, DW_AT_name("DRV8301_RESET")
    4250                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_DRV8301_RESET")
    4251                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4252                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4253              
    4254              $C$DW$389       .dwtag  DW_TAG_member
    4255                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   81

    4256                      .dwattr $C$DW$389, DW_AT_name("PWM_MODE")
    4257                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_PWM_MODE")
    4258                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4259                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4260              
    4261              $C$DW$390       .dwtag  DW_TAG_member
    4262                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$34)
    4263                      .dwattr $C$DW$390, DW_AT_name("OC_MODE")
    4264                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_OC_MODE")
    4265                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4266                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4267              
    4268              $C$DW$391       .dwtag  DW_TAG_member
    4269                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$36)
    4270                      .dwattr $C$DW$391, DW_AT_name("OC_ADJ_SET")
    4271                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    4272                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4273                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4274              
    4275                      .dwendtag $C$DW$T$37
    4276              
    4277              $C$DW$T$52      .dwtag  DW_TAG_typedef
    4278                      .dwattr $C$DW$T$52, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    4279                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$37)
    4280                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4281              
    4282              
    4283              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4284                      .dwattr $C$DW$T$46, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    4285                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    4286              $C$DW$392       .dwtag  DW_TAG_member
    4287                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$39)
    4288                      .dwattr $C$DW$392, DW_AT_name("OCTW_SET")
    4289                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_OCTW_SET")
    4290                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4291                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4292              
    4293              $C$DW$393       .dwtag  DW_TAG_member
    4294                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$41)
    4295                      .dwattr $C$DW$393, DW_AT_name("GAIN")
    4296                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_GAIN")
    4297                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4298                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4299              
    4300              $C$DW$394       .dwtag  DW_TAG_member
    4301                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$43)
    4302                      .dwattr $C$DW$394, DW_AT_name("DC_CAL_CH1p2")
    4303                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    4304                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4305                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4306              
    4307              $C$DW$395       .dwtag  DW_TAG_member
    4308                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$45)
    4309                      .dwattr $C$DW$395, DW_AT_name("OC_TOFF")
    4310                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_OC_TOFF")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   82

    4311                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4312                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4313              
    4314                      .dwendtag $C$DW$T$46
    4315              
    4316              $C$DW$T$53      .dwtag  DW_TAG_typedef
    4317                      .dwattr $C$DW$T$53, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    4318                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$46)
    4319                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4320              
    4321              
    4322              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    4323                      .dwattr $C$DW$T$47, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    4324                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x0b)
    4325              $C$DW$396       .dwtag  DW_TAG_member
    4326                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$25)
    4327                      .dwattr $C$DW$396, DW_AT_name("FAULT")
    4328                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_FAULT")
    4329                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4330                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4331              
    4332              $C$DW$397       .dwtag  DW_TAG_member
    4333                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$25)
    4334                      .dwattr $C$DW$397, DW_AT_name("GVDD_UV")
    4335                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_GVDD_UV")
    4336                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4337                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4338              
    4339              $C$DW$398       .dwtag  DW_TAG_member
    4340                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$25)
    4341                      .dwattr $C$DW$398, DW_AT_name("PVDD_UV")
    4342                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_PVDD_UV")
    4343                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4344                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4345              
    4346              $C$DW$399       .dwtag  DW_TAG_member
    4347                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$25)
    4348                      .dwattr $C$DW$399, DW_AT_name("OTSD")
    4349                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_OTSD")
    4350                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4351                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4352              
    4353              $C$DW$400       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$25)
    4355                      .dwattr $C$DW$400, DW_AT_name("OTW")
    4356                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_OTW")
    4357                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4358                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4359              
    4360              $C$DW$401       .dwtag  DW_TAG_member
    4361                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$25)
    4362                      .dwattr $C$DW$401, DW_AT_name("FETHA_OC")
    4363                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_FETHA_OC")
    4364                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4365                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   83

    4366              
    4367              $C$DW$402       .dwtag  DW_TAG_member
    4368                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$25)
    4369                      .dwattr $C$DW$402, DW_AT_name("FETLA_OC")
    4370                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_FETLA_OC")
    4371                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4372                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4373              
    4374              $C$DW$403       .dwtag  DW_TAG_member
    4375                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$25)
    4376                      .dwattr $C$DW$403, DW_AT_name("FETHB_OC")
    4377                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_FETHB_OC")
    4378                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4379                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4380              
    4381              $C$DW$404       .dwtag  DW_TAG_member
    4382                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$25)
    4383                      .dwattr $C$DW$404, DW_AT_name("FETLB_OC")
    4384                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_FETLB_OC")
    4385                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4386                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4387              
    4388              $C$DW$405       .dwtag  DW_TAG_member
    4389                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$25)
    4390                      .dwattr $C$DW$405, DW_AT_name("FETHC_OC")
    4391                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_FETHC_OC")
    4392                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4393                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4394              
    4395              $C$DW$406       .dwtag  DW_TAG_member
    4396                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$25)
    4397                      .dwattr $C$DW$406, DW_AT_name("FETLC_OC")
    4398                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_FETLC_OC")
    4399                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4400                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4401              
    4402                      .dwendtag $C$DW$T$47
    4403              
    4404              $C$DW$T$50      .dwtag  DW_TAG_typedef
    4405                      .dwattr $C$DW$T$50, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    4406                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$47)
    4407                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4408              
    4409              
    4410              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4411                      .dwattr $C$DW$T$49, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    4412                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    4413              $C$DW$407       .dwtag  DW_TAG_member
    4414                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$25)
    4415                      .dwattr $C$DW$407, DW_AT_name("GVDD_OV")
    4416                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_GVDD_OV")
    4417                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4418                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4419              
    4420              $C$DW$408       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   84

    4421                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$48)
    4422                      .dwattr $C$DW$408, DW_AT_name("DeviceID")
    4423                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_DeviceID")
    4424                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4425                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4426              
    4427                      .dwendtag $C$DW$T$49
    4428              
    4429              $C$DW$T$51      .dwtag  DW_TAG_typedef
    4430                      .dwattr $C$DW$T$51, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    4431                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$49)
    4432                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4433              
    4434              
    4435              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4436                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    4437                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x18)
    4438              $C$DW$409       .dwtag  DW_TAG_member
    4439                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$50)
    4440                      .dwattr $C$DW$409, DW_AT_name("Stat_Reg_1")
    4441                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Stat_Reg_1")
    4442                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4443                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4444              
    4445              $C$DW$410       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$51)
    4447                      .dwattr $C$DW$410, DW_AT_name("Stat_Reg_2")
    4448                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Stat_Reg_2")
    4449                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4450                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4451              
    4452              $C$DW$411       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$52)
    4454                      .dwattr $C$DW$411, DW_AT_name("Ctrl_Reg_1")
    4455                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    4456                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4457                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4458              
    4459              $C$DW$412       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$53)
    4461                      .dwattr $C$DW$412, DW_AT_name("Ctrl_Reg_2")
    4462                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    4463                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4464                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4465              
    4466              $C$DW$413       .dwtag  DW_TAG_member
    4467                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$25)
    4468                      .dwattr $C$DW$413, DW_AT_name("SndCmd")
    4469                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_SndCmd")
    4470                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4471                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4472              
    4473              $C$DW$414       .dwtag  DW_TAG_member
    4474                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$25)
    4475                      .dwattr $C$DW$414, DW_AT_name("RcvCmd")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   85

    4476                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_RcvCmd")
    4477                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4478                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4479              
    4480                      .dwendtag $C$DW$T$54
    4481              
    4482              $C$DW$T$120     .dwtag  DW_TAG_typedef
    4483                      .dwattr $C$DW$T$120, DW_AT_name("DRV_SPI_8301_Vars_t")
    4484                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$54)
    4485                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    4486              
    4487              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    4488                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    4489                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    4490              
    4491              $C$DW$415       .dwtag  DW_TAG_TI_far_type
    4492                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$121)
    4493              
    4494              $C$DW$T$122     .dwtag  DW_TAG_const_type
    4495                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$415)
    4496              
    4497              
    4498              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    4499                      .dwattr $C$DW$T$64, DW_AT_name("_GPIO_Obj_")
    4500                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x6a)
    4501              $C$DW$416       .dwtag  DW_TAG_member
    4502                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$56)
    4503                      .dwattr $C$DW$416, DW_AT_name("GPACTRL")
    4504                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_GPACTRL")
    4505                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4506                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4507              
    4508              $C$DW$417       .dwtag  DW_TAG_member
    4509                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$56)
    4510                      .dwattr $C$DW$417, DW_AT_name("GPAQSEL1")
    4511                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_GPAQSEL1")
    4512                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4513                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4514              
    4515              $C$DW$418       .dwtag  DW_TAG_member
    4516                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$56)
    4517                      .dwattr $C$DW$418, DW_AT_name("GPAQSEL2")
    4518                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_GPAQSEL2")
    4519                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4520                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4521              
    4522              $C$DW$419       .dwtag  DW_TAG_member
    4523                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$56)
    4524                      .dwattr $C$DW$419, DW_AT_name("GPAMUX1")
    4525                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_GPAMUX1")
    4526                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4527                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4528              
    4529              $C$DW$420       .dwtag  DW_TAG_member
    4530                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   86

    4531                      .dwattr $C$DW$420, DW_AT_name("GPAMUX2")
    4532                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_GPAMUX2")
    4533                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4534                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4535              
    4536              $C$DW$421       .dwtag  DW_TAG_member
    4537                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$56)
    4538                      .dwattr $C$DW$421, DW_AT_name("GPADIR")
    4539                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_GPADIR")
    4540                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4541                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4542              
    4543              $C$DW$422       .dwtag  DW_TAG_member
    4544                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$56)
    4545                      .dwattr $C$DW$422, DW_AT_name("GPAPUD")
    4546                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_GPAPUD")
    4547                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4548                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4549              
    4550              $C$DW$423       .dwtag  DW_TAG_member
    4551                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$58)
    4552                      .dwattr $C$DW$423, DW_AT_name("rsvd_1")
    4553                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_rsvd_1")
    4554                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4555                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4556              
    4557              $C$DW$424       .dwtag  DW_TAG_member
    4558                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$56)
    4559                      .dwattr $C$DW$424, DW_AT_name("GPBCTRL")
    4560                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_GPBCTRL")
    4561                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4562                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4563              
    4564              $C$DW$425       .dwtag  DW_TAG_member
    4565                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$56)
    4566                      .dwattr $C$DW$425, DW_AT_name("GPBQSEL1")
    4567                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_GPBQSEL1")
    4568                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4569                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4570              
    4571              $C$DW$426       .dwtag  DW_TAG_member
    4572                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$58)
    4573                      .dwattr $C$DW$426, DW_AT_name("rsvd_2")
    4574                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_rsvd_2")
    4575                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4576                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4577              
    4578              $C$DW$427       .dwtag  DW_TAG_member
    4579                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$56)
    4580                      .dwattr $C$DW$427, DW_AT_name("GPBMUX1")
    4581                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_GPBMUX1")
    4582                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4583                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4584              
    4585              $C$DW$428       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   87

    4586                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$58)
    4587                      .dwattr $C$DW$428, DW_AT_name("rsvd_3")
    4588                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_rsvd_3")
    4589                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4590                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4591              
    4592              $C$DW$429       .dwtag  DW_TAG_member
    4593                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$56)
    4594                      .dwattr $C$DW$429, DW_AT_name("GPBDIR")
    4595                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_GPBDIR")
    4596                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4597                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4598              
    4599              $C$DW$430       .dwtag  DW_TAG_member
    4600                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$56)
    4601                      .dwattr $C$DW$430, DW_AT_name("GPBPUD")
    4602                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_GPBPUD")
    4603                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4604                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4605              
    4606              $C$DW$431       .dwtag  DW_TAG_member
    4607                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$59)
    4608                      .dwattr $C$DW$431, DW_AT_name("rsvd_4")
    4609                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_rsvd_4")
    4610                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4611                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4612              
    4613              $C$DW$432       .dwtag  DW_TAG_member
    4614                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$56)
    4615                      .dwattr $C$DW$432, DW_AT_name("AIOMUX1")
    4616                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_AIOMUX1")
    4617                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4618                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4619              
    4620              $C$DW$433       .dwtag  DW_TAG_member
    4621                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$58)
    4622                      .dwattr $C$DW$433, DW_AT_name("rsvd_5")
    4623                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_rsvd_5")
    4624                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4625                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4626              
    4627              $C$DW$434       .dwtag  DW_TAG_member
    4628                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$56)
    4629                      .dwattr $C$DW$434, DW_AT_name("AIODIR")
    4630                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_AIODIR")
    4631                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4632                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4633              
    4634              $C$DW$435       .dwtag  DW_TAG_member
    4635                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$60)
    4636                      .dwattr $C$DW$435, DW_AT_name("rsvd_6")
    4637                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_rsvd_6")
    4638                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4639                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4640              
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   88

    4641              $C$DW$436       .dwtag  DW_TAG_member
    4642                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$56)
    4643                      .dwattr $C$DW$436, DW_AT_name("GPADAT")
    4644                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_GPADAT")
    4645                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4646                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4647              
    4648              $C$DW$437       .dwtag  DW_TAG_member
    4649                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$56)
    4650                      .dwattr $C$DW$437, DW_AT_name("GPASET")
    4651                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_GPASET")
    4652                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4653                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4654              
    4655              $C$DW$438       .dwtag  DW_TAG_member
    4656                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$56)
    4657                      .dwattr $C$DW$438, DW_AT_name("GPACLEAR")
    4658                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_GPACLEAR")
    4659                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4660                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4661              
    4662              $C$DW$439       .dwtag  DW_TAG_member
    4663                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$56)
    4664                      .dwattr $C$DW$439, DW_AT_name("GPATOGGLE")
    4665                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_GPATOGGLE")
    4666                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4667                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4668              
    4669              $C$DW$440       .dwtag  DW_TAG_member
    4670                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$56)
    4671                      .dwattr $C$DW$440, DW_AT_name("GPBDAT")
    4672                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_GPBDAT")
    4673                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4674                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4675              
    4676              $C$DW$441       .dwtag  DW_TAG_member
    4677                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$56)
    4678                      .dwattr $C$DW$441, DW_AT_name("GPBSET")
    4679                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_GPBSET")
    4680                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4681                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4682              
    4683              $C$DW$442       .dwtag  DW_TAG_member
    4684                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$56)
    4685                      .dwattr $C$DW$442, DW_AT_name("GPBCLEAR")
    4686                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_GPBCLEAR")
    4687                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4688                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4689              
    4690              $C$DW$443       .dwtag  DW_TAG_member
    4691                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$56)
    4692                      .dwattr $C$DW$443, DW_AT_name("GPBTOGGLE")
    4693                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_GPBTOGGLE")
    4694                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4695                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   89

    4696              
    4697              $C$DW$444       .dwtag  DW_TAG_member
    4698                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$61)
    4699                      .dwattr $C$DW$444, DW_AT_name("rsvd_7")
    4700                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_rsvd_7")
    4701                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4702                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4703              
    4704              $C$DW$445       .dwtag  DW_TAG_member
    4705                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$56)
    4706                      .dwattr $C$DW$445, DW_AT_name("AIODAT")
    4707                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_AIODAT")
    4708                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4709                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4710              
    4711              $C$DW$446       .dwtag  DW_TAG_member
    4712                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$56)
    4713                      .dwattr $C$DW$446, DW_AT_name("AIOSET")
    4714                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_AIOSET")
    4715                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    4716                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4717              
    4718              $C$DW$447       .dwtag  DW_TAG_member
    4719                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$56)
    4720                      .dwattr $C$DW$447, DW_AT_name("AIOCLEAR")
    4721                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_AIOCLEAR")
    4722                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4723                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4724              
    4725              $C$DW$448       .dwtag  DW_TAG_member
    4726                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$56)
    4727                      .dwattr $C$DW$448, DW_AT_name("AIOTOGGLE")
    4728                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_AIOTOGGLE")
    4729                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4730                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4731              
    4732              $C$DW$449       .dwtag  DW_TAG_member
    4733                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$62)
    4734                      .dwattr $C$DW$449, DW_AT_name("GPIOXINTnSEL")
    4735                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    4736                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4737                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4738              
    4739              $C$DW$450       .dwtag  DW_TAG_member
    4740                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$63)
    4741                      .dwattr $C$DW$450, DW_AT_name("rsvd_8")
    4742                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_rsvd_8")
    4743                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4744                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4745              
    4746              $C$DW$451       .dwtag  DW_TAG_member
    4747                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$56)
    4748                      .dwattr $C$DW$451, DW_AT_name("GPIOLPMSEL")
    4749                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    4750                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   90

    4751                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4752              
    4753                      .dwendtag $C$DW$T$64
    4754              
    4755              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    4756                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$64)
    4757                      .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    4758              
    4759              $C$DW$T$22      .dwtag  DW_TAG_typedef
    4760                      .dwattr $C$DW$T$22, DW_AT_name("GPIO_Handle")
    4761                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    4762                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    4763              
    4764              $C$DW$452       .dwtag  DW_TAG_TI_far_type
    4765                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$22)
    4766              
    4767              $C$DW$T$125     .dwtag  DW_TAG_const_type
    4768                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$452)
    4769              
    4770              
    4771              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    4772                      .dwattr $C$DW$T$65, DW_AT_name("_SPI_Obj_")
    4773                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
    4774              $C$DW$453       .dwtag  DW_TAG_member
    4775                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$57)
    4776                      .dwattr $C$DW$453, DW_AT_name("SPICCR")
    4777                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_SPICCR")
    4778                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4779                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4780              
    4781              $C$DW$454       .dwtag  DW_TAG_member
    4782                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$57)
    4783                      .dwattr $C$DW$454, DW_AT_name("SPICTL")
    4784                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_SPICTL")
    4785                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4786                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4787              
    4788              $C$DW$455       .dwtag  DW_TAG_member
    4789                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$57)
    4790                      .dwattr $C$DW$455, DW_AT_name("SPIST")
    4791                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_SPIST")
    4792                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4793                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4794              
    4795              $C$DW$456       .dwtag  DW_TAG_member
    4796                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$57)
    4797                      .dwattr $C$DW$456, DW_AT_name("rsvd_1")
    4798                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_rsvd_1")
    4799                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4800                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4801              
    4802              $C$DW$457       .dwtag  DW_TAG_member
    4803                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$57)
    4804                      .dwattr $C$DW$457, DW_AT_name("SPIBRR")
    4805                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_SPIBRR")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   91

    4806                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4807                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4808              
    4809              $C$DW$458       .dwtag  DW_TAG_member
    4810                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$57)
    4811                      .dwattr $C$DW$458, DW_AT_name("rsvd_2")
    4812                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_rsvd_2")
    4813                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4814                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4815              
    4816              $C$DW$459       .dwtag  DW_TAG_member
    4817                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$57)
    4818                      .dwattr $C$DW$459, DW_AT_name("SPIEMU")
    4819                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_SPIEMU")
    4820                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4821                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4822              
    4823              $C$DW$460       .dwtag  DW_TAG_member
    4824                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$57)
    4825                      .dwattr $C$DW$460, DW_AT_name("SPIRXBUF")
    4826                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_SPIRXBUF")
    4827                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4828                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4829              
    4830              $C$DW$461       .dwtag  DW_TAG_member
    4831                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$57)
    4832                      .dwattr $C$DW$461, DW_AT_name("SPITXBUF")
    4833                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_SPITXBUF")
    4834                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4835                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4836              
    4837              $C$DW$462       .dwtag  DW_TAG_member
    4838                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$57)
    4839                      .dwattr $C$DW$462, DW_AT_name("SPIDAT")
    4840                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_SPIDAT")
    4841                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4842                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4843              
    4844              $C$DW$463       .dwtag  DW_TAG_member
    4845                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$57)
    4846                      .dwattr $C$DW$463, DW_AT_name("SPIFFTX")
    4847                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_SPIFFTX")
    4848                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4849                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4850              
    4851              $C$DW$464       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$57)
    4853                      .dwattr $C$DW$464, DW_AT_name("SPIFFRX")
    4854                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_SPIFFRX")
    4855                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4856                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4857              
    4858              $C$DW$465       .dwtag  DW_TAG_member
    4859                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$57)
    4860                      .dwattr $C$DW$465, DW_AT_name("SPIFFCT")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   92

    4861                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_SPIFFCT")
    4862                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4863                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4864              
    4865              $C$DW$466       .dwtag  DW_TAG_member
    4866                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$58)
    4867                      .dwattr $C$DW$466, DW_AT_name("rsvd_3")
    4868                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_rsvd_3")
    4869                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4870                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4871              
    4872              $C$DW$467       .dwtag  DW_TAG_member
    4873                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$57)
    4874                      .dwattr $C$DW$467, DW_AT_name("SPIPRI")
    4875                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_SPIPRI")
    4876                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4877                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4878              
    4879                      .dwendtag $C$DW$T$65
    4880              
    4881              $C$DW$T$127     .dwtag  DW_TAG_typedef
    4882                      .dwattr $C$DW$T$127, DW_AT_name("SPI_Obj")
    4883                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$65)
    4884                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    4885              
    4886              $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    4887                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$65)
    4888                      .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
    4889              
    4890              $C$DW$T$20      .dwtag  DW_TAG_typedef
    4891                      .dwattr $C$DW$T$20, DW_AT_name("SPI_Handle")
    4892                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4893                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4894              
    4895              $C$DW$468       .dwtag  DW_TAG_TI_far_type
    4896                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    4897              
    4898              $C$DW$T$128     .dwtag  DW_TAG_const_type
    4899                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$468)
    4900              
    4901              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4902                      .dwattr $C$DW$T$2, DW_AT_name("void")
    4903              
    4904              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4905                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4906                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    4907              
    4908              $C$DW$469       .dwtag  DW_TAG_TI_far_type
    4909                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$3)
    4910              
    4911              $C$DW$T$130     .dwtag  DW_TAG_const_type
    4912                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$469)
    4913              
    4914              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4915                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:31:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0544810                          PAGE   93

    4916                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4917                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4918              
    4919              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4920                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4921                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4922                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4923              
    4924              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4925                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4926                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4927                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4928              
    4929              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4930                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4931                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4932                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4933              
    4934              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4935                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4936                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4937                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4938              
    4939              $C$DW$T$9       .dwtag  DW_TAG_base_type
