TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Thu Dec 01 16:01:08 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4338                      .dwattr $C$DW$512, DW_AT_const_value(0x01)
    4339              
    4340              $C$DW$513       .dwtag  DW_TAG_enumerator
    4341                      .dwattr $C$DW$513, DW_AT_name("PIE_GroupNumber_3")
    4342                      .dwattr $C$DW$513, DW_AT_const_value(0x02)
    4343              
    4344              $C$DW$514       .dwtag  DW_TAG_enumerator
    4345                      .dwattr $C$DW$514, DW_AT_name("PIE_GroupNumber_4")
    4346                      .dwattr $C$DW$514, DW_AT_const_value(0x03)
    4347              
    4348              $C$DW$515       .dwtag  DW_TAG_enumerator
    4349                      .dwattr $C$DW$515, DW_AT_name("PIE_GroupNumber_5")
    4350                      .dwattr $C$DW$515, DW_AT_const_value(0x04)
    4351              
    4352              $C$DW$516       .dwtag  DW_TAG_enumerator
    4353                      .dwattr $C$DW$516, DW_AT_name("PIE_GroupNumber_6")
    4354                      .dwattr $C$DW$516, DW_AT_const_value(0x05)
    4355              
    4356              $C$DW$517       .dwtag  DW_TAG_enumerator
    4357                      .dwattr $C$DW$517, DW_AT_name("PIE_GroupNumber_7")
    4358                      .dwattr $C$DW$517, DW_AT_const_value(0x06)
    4359              
    4360              $C$DW$518       .dwtag  DW_TAG_enumerator
    4361                      .dwattr $C$DW$518, DW_AT_name("PIE_GroupNumber_8")
    4362                      .dwattr $C$DW$518, DW_AT_const_value(0x07)
    4363              
    4364              $C$DW$519       .dwtag  DW_TAG_enumerator
    4365                      .dwattr $C$DW$519, DW_AT_name("PIE_GroupNumber_9")
    4366                      .dwattr $C$DW$519, DW_AT_const_value(0x08)
    4367              
    4368              $C$DW$520       .dwtag  DW_TAG_enumerator
    4369                      .dwattr $C$DW$520, DW_AT_name("PIE_GroupNumber_10")
    4370                      .dwattr $C$DW$520, DW_AT_const_value(0x09)
    4371              
    4372              $C$DW$521       .dwtag  DW_TAG_enumerator
    4373                      .dwattr $C$DW$521, DW_AT_name("PIE_GroupNumber_11")
    4374                      .dwattr $C$DW$521, DW_AT_const_value(0x0a)
    4375              
    4376              $C$DW$522       .dwtag  DW_TAG_enumerator
    4377                      .dwattr $C$DW$522, DW_AT_name("PIE_GroupNumber_12")
    4378                      .dwattr $C$DW$522, DW_AT_const_value(0x0b)
    4379              
    4380                      .dwendtag $C$DW$T$218
    4381              
    4382              $C$DW$T$219     .dwtag  DW_TAG_typedef
    4383                      .dwattr $C$DW$T$219, DW_AT_name("PIE_GroupNumber_e")
    4384                      .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$218)
    4385                      .dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
    4386              
    4387              
    4388              $C$DW$T$221     .dwtag  DW_TAG_enumeration_type
    4389                      .dwattr $C$DW$T$221, DW_AT_byte_size(0x01)
    4390              $C$DW$523       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   86

    4391                      .dwattr $C$DW$523, DW_AT_name("CTRL_Type_PID_spd")
    4392                      .dwattr $C$DW$523, DW_AT_const_value(0x00)
    4393              
    4394              $C$DW$524       .dwtag  DW_TAG_enumerator
    4395                      .dwattr $C$DW$524, DW_AT_name("CTRL_Type_PID_Id")
    4396                      .dwattr $C$DW$524, DW_AT_const_value(0x01)
    4397              
    4398              $C$DW$525       .dwtag  DW_TAG_enumerator
    4399                      .dwattr $C$DW$525, DW_AT_name("CTRL_Type_PID_Iq")
    4400                      .dwattr $C$DW$525, DW_AT_const_value(0x02)
    4401              
    4402                      .dwendtag $C$DW$T$221
    4403              
    4404              $C$DW$T$222     .dwtag  DW_TAG_typedef
    4405                      .dwattr $C$DW$T$222, DW_AT_name("CTRL_Type_e")
    4406                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    4407                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    4408              
    4409              
    4410              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    4411                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    4412              $C$DW$526       .dwtag  DW_TAG_enumerator
    4413                      .dwattr $C$DW$526, DW_AT_name("HAL_SensorType_Current")
    4414                      .dwattr $C$DW$526, DW_AT_const_value(0x00)
    4415              
    4416              $C$DW$527       .dwtag  DW_TAG_enumerator
    4417                      .dwattr $C$DW$527, DW_AT_name("HAL_SensorType_Voltage")
    4418                      .dwattr $C$DW$527, DW_AT_const_value(0x01)
    4419              
    4420                      .dwendtag $C$DW$T$224
    4421              
    4422              $C$DW$T$225     .dwtag  DW_TAG_typedef
    4423                      .dwattr $C$DW$T$225, DW_AT_name("HAL_SensorType_e")
    4424                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    4425                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    4426              
    4427              
    4428              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4429                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    4430                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    4431              $C$DW$528       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$24)
    4433                      .dwattr $C$DW$528, DW_AT_name("ADCRESULT")
    4434                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_ADCRESULT")
    4435                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4436                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4437              
    4438              $C$DW$529       .dwtag  DW_TAG_member
    4439                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$25)
    4440                      .dwattr $C$DW$529, DW_AT_name("resvd_1")
    4441                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_resvd_1")
    4442                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4443                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4444              
    4445              $C$DW$530       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   87

    4446                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$23)
    4447                      .dwattr $C$DW$530, DW_AT_name("ADCCTL1")
    4448                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_ADCCTL1")
    4449                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4450                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4451              
    4452              $C$DW$531       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$23)
    4454                      .dwattr $C$DW$531, DW_AT_name("ADCCTL2")
    4455                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_ADCCTL2")
    4456                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4457                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4458              
    4459              $C$DW$532       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$26)
    4461                      .dwattr $C$DW$532, DW_AT_name("rsvd_2")
    4462                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_rsvd_2")
    4463                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4464                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4465              
    4466              $C$DW$533       .dwtag  DW_TAG_member
    4467                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$23)
    4468                      .dwattr $C$DW$533, DW_AT_name("ADCINTFLG")
    4469                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_ADCINTFLG")
    4470                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4471                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4472              
    4473              $C$DW$534       .dwtag  DW_TAG_member
    4474                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$23)
    4475                      .dwattr $C$DW$534, DW_AT_name("ADCINTFLGCLR")
    4476                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4477                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4478                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4479              
    4480              $C$DW$535       .dwtag  DW_TAG_member
    4481                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$23)
    4482                      .dwattr $C$DW$535, DW_AT_name("ADCINTOVF")
    4483                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_ADCINTOVF")
    4484                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4485                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    4486              
    4487              $C$DW$536       .dwtag  DW_TAG_member
    4488                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$23)
    4489                      .dwattr $C$DW$536, DW_AT_name("ADCINTOVFCLR")
    4490                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4491                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4492                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    4493              
    4494              $C$DW$537       .dwtag  DW_TAG_member
    4495                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$27)
    4496                      .dwattr $C$DW$537, DW_AT_name("INTSELxNy")
    4497                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_INTSELxNy")
    4498                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4499                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    4500              
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   88

    4501              $C$DW$538       .dwtag  DW_TAG_member
    4502                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$28)
    4503                      .dwattr $C$DW$538, DW_AT_name("rsvd_3")
    4504                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_rsvd_3")
    4505                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4506                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    4507              
    4508              $C$DW$539       .dwtag  DW_TAG_member
    4509                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$23)
    4510                      .dwattr $C$DW$539, DW_AT_name("SOCPRICTRL")
    4511                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4512                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4513                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    4514              
    4515              $C$DW$540       .dwtag  DW_TAG_member
    4516                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$23)
    4517                      .dwattr $C$DW$540, DW_AT_name("rsvd_4")
    4518                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_rsvd_4")
    4519                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4520                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    4521              
    4522              $C$DW$541       .dwtag  DW_TAG_member
    4523                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$23)
    4524                      .dwattr $C$DW$541, DW_AT_name("ADCSAMPLEMODE")
    4525                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4526                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4527                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    4528              
    4529              $C$DW$542       .dwtag  DW_TAG_member
    4530                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$23)
    4531                      .dwattr $C$DW$542, DW_AT_name("rsvd_5")
    4532                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_rsvd_5")
    4533                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4534                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    4535              
    4536              $C$DW$543       .dwtag  DW_TAG_member
    4537                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$23)
    4538                      .dwattr $C$DW$543, DW_AT_name("ADCINTSOCSEL1")
    4539                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4540                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4541                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    4542              
    4543              $C$DW$544       .dwtag  DW_TAG_member
    4544                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$23)
    4545                      .dwattr $C$DW$544, DW_AT_name("ADCINTSOCSEL2")
    4546                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4547                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4548                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    4549              
    4550              $C$DW$545       .dwtag  DW_TAG_member
    4551                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$26)
    4552                      .dwattr $C$DW$545, DW_AT_name("rsvd_6")
    4553                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_rsvd_6")
    4554                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4555                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   89

    4556              
    4557              $C$DW$546       .dwtag  DW_TAG_member
    4558                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$23)
    4559                      .dwattr $C$DW$546, DW_AT_name("ADCSOCFLG1")
    4560                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4561                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4562                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    4563              
    4564              $C$DW$547       .dwtag  DW_TAG_member
    4565                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$23)
    4566                      .dwattr $C$DW$547, DW_AT_name("rsvd_7")
    4567                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_rsvd_7")
    4568                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4569                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    4570              
    4571              $C$DW$548       .dwtag  DW_TAG_member
    4572                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$23)
    4573                      .dwattr $C$DW$548, DW_AT_name("ADCSOCFRC1")
    4574                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4575                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4576                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    4577              
    4578              $C$DW$549       .dwtag  DW_TAG_member
    4579                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$23)
    4580                      .dwattr $C$DW$549, DW_AT_name("rsvd_8")
    4581                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_rsvd_8")
    4582                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4583                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    4584              
    4585              $C$DW$550       .dwtag  DW_TAG_member
    4586                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$23)
    4587                      .dwattr $C$DW$550, DW_AT_name("ADCSOCOVF1")
    4588                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4589                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4590                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    4591              
    4592              $C$DW$551       .dwtag  DW_TAG_member
    4593                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$23)
    4594                      .dwattr $C$DW$551, DW_AT_name("rsvd_9")
    4595                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_rsvd_9")
    4596                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4597                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    4598              
    4599              $C$DW$552       .dwtag  DW_TAG_member
    4600                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$23)
    4601                      .dwattr $C$DW$552, DW_AT_name("ADCSOCOVFCLR1")
    4602                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4603                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4604                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    4605              
    4606              $C$DW$553       .dwtag  DW_TAG_member
    4607                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$23)
    4608                      .dwattr $C$DW$553, DW_AT_name("rsvd_10")
    4609                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_rsvd_10")
    4610                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   90

    4611                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    4612              
    4613              $C$DW$554       .dwtag  DW_TAG_member
    4614                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$24)
    4615                      .dwattr $C$DW$554, DW_AT_name("ADCSOCxCTL")
    4616                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4617                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4618                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    4619              
    4620              $C$DW$555       .dwtag  DW_TAG_member
    4621                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$24)
    4622                      .dwattr $C$DW$555, DW_AT_name("rsvd_11")
    4623                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_rsvd_11")
    4624                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4625                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    4626              
    4627              $C$DW$556       .dwtag  DW_TAG_member
    4628                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$23)
    4629                      .dwattr $C$DW$556, DW_AT_name("ADCREFTRIM")
    4630                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4631                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4632                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    4633              
    4634              $C$DW$557       .dwtag  DW_TAG_member
    4635                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$23)
    4636                      .dwattr $C$DW$557, DW_AT_name("ADCOFFTRIM")
    4637                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4638                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4639                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    4640              
    4641              $C$DW$558       .dwtag  DW_TAG_member
    4642                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$29)
    4643                      .dwattr $C$DW$558, DW_AT_name("resvd_12")
    4644                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_resvd_12")
    4645                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4646                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    4647              
    4648              $C$DW$559       .dwtag  DW_TAG_member
    4649                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$23)
    4650                      .dwattr $C$DW$559, DW_AT_name("ADCREV")
    4651                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_ADCREV")
    4652                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4653                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    4654              
    4655                      .dwendtag $C$DW$T$30
    4656              
    4657              $C$DW$T$227     .dwtag  DW_TAG_typedef
    4658                      .dwattr $C$DW$T$227, DW_AT_name("ADC_Obj")
    4659                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$30)
    4660                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    4661              
    4662              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
    4663                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$30)
    4664                      .dwattr $C$DW$T$116, DW_AT_address_class(0x20)
    4665              
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   91

    4666              $C$DW$T$117     .dwtag  DW_TAG_typedef
    4667                      .dwattr $C$DW$T$117, DW_AT_name("ADC_Handle")
    4668                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    4669                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    4670              
    4671              
    4672              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4673                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    4674                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    4675              $C$DW$560       .dwtag  DW_TAG_member
    4676                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$31)
    4677                      .dwattr $C$DW$560, DW_AT_name("alpha_sf")
    4678                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_alpha_sf")
    4679                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4680                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    4681              
    4682              $C$DW$561       .dwtag  DW_TAG_member
    4683                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$31)
    4684                      .dwattr $C$DW$561, DW_AT_name("beta_sf")
    4685                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_beta_sf")
    4686                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4687                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    4688              
    4689              $C$DW$562       .dwtag  DW_TAG_member
    4690                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$32)
    4691                      .dwattr $C$DW$562, DW_AT_name("numSensors")
    4692                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_numSensors")
    4693                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4694                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    4695              
    4696                      .dwendtag $C$DW$T$33
    4697              
    4698              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4699                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    4700                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    4701                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4702              
    4703              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    4704                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    4705                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    4706              
    4707              $C$DW$T$43      .dwtag  DW_TAG_typedef
    4708                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    4709                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4710                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4711              
    4712              
    4713              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4714                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    4715                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    4716              $C$DW$563       .dwtag  DW_TAG_member
    4717                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$23)
    4718                      .dwattr $C$DW$563, DW_AT_name("XCLK")
    4719                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_XCLK")
    4720                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   92

    4721                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    4722              
    4723              $C$DW$564       .dwtag  DW_TAG_member
    4724                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$23)
    4725                      .dwattr $C$DW$564, DW_AT_name("rsvd_1")
    4726                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_rsvd_1")
    4727                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4728                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    4729              
    4730              $C$DW$565       .dwtag  DW_TAG_member
    4731                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$23)
    4732                      .dwattr $C$DW$565, DW_AT_name("CLKCTL")
    4733                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_CLKCTL")
    4734                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4735                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    4736              
    4737              $C$DW$566       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$34)
    4739                      .dwattr $C$DW$566, DW_AT_name("rsvd_2")
    4740                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_rsvd_2")
    4741                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4742                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    4743              
    4744              $C$DW$567       .dwtag  DW_TAG_member
    4745                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$23)
    4746                      .dwattr $C$DW$567, DW_AT_name("LOSPCP")
    4747                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_LOSPCP")
    4748                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4749                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    4750              
    4751              $C$DW$568       .dwtag  DW_TAG_member
    4752                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$23)
    4753                      .dwattr $C$DW$568, DW_AT_name("PCLKCR0")
    4754                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_PCLKCR0")
    4755                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4756                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    4757              
    4758              $C$DW$569       .dwtag  DW_TAG_member
    4759                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$23)
    4760                      .dwattr $C$DW$569, DW_AT_name("PCLKCR1")
    4761                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_PCLKCR1")
    4762                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4763                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    4764              
    4765              $C$DW$570       .dwtag  DW_TAG_member
    4766                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$26)
    4767                      .dwattr $C$DW$570, DW_AT_name("rsvd_3")
    4768                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_rsvd_3")
    4769                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4770                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    4771              
    4772              $C$DW$571       .dwtag  DW_TAG_member
    4773                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$23)
    4774                      .dwattr $C$DW$571, DW_AT_name("PCLKCR3")
    4775                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_PCLKCR3")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   93

    4776                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4777                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    4778              
    4779                      .dwendtag $C$DW$T$35
    4780              
    4781              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    4782                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$35)
    4783                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
    4784              
    4785              $C$DW$T$119     .dwtag  DW_TAG_typedef
    4786                      .dwattr $C$DW$T$119, DW_AT_name("CLK_Handle")
    4787                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    4788                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    4789              
    4790              
    4791              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4792                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    4793                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    4794              $C$DW$572       .dwtag  DW_TAG_member
    4795                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$32)
    4796                      .dwattr $C$DW$572, DW_AT_name("tmp")
    4797                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_tmp")
    4798                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4799                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    4800              
    4801                      .dwendtag $C$DW$T$36
    4802              
    4803              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    4804                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$36)
    4805                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    4806              
    4807              $C$DW$T$121     .dwtag  DW_TAG_typedef
    4808                      .dwattr $C$DW$T$121, DW_AT_name("CPU_Handle")
    4809                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    4810                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    4811              
    4812              
    4813              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4814                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    4815                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    4816              $C$DW$573       .dwtag  DW_TAG_member
    4817                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$37)
    4818                      .dwattr $C$DW$573, DW_AT_name("version")
    4819                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_version")
    4820                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4821                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    4822              
    4823              $C$DW$574       .dwtag  DW_TAG_member
    4824                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$39)
    4825                      .dwattr $C$DW$574, DW_AT_name("state")
    4826                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_state")
    4827                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4828                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    4829              
    4830              $C$DW$575       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   94

    4831                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$39)
    4832                      .dwattr $C$DW$575, DW_AT_name("prevState")
    4833                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_prevState")
    4834                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4835                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    4836              
    4837              $C$DW$576       .dwtag  DW_TAG_member
    4838                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$41)
    4839                      .dwattr $C$DW$576, DW_AT_name("errorCode")
    4840                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_errorCode")
    4841                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4842                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    4843              
    4844              $C$DW$577       .dwtag  DW_TAG_member
    4845                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$43)
    4846                      .dwattr $C$DW$577, DW_AT_name("clarkeHandle_I")
    4847                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4848                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4849                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    4850              
    4851              $C$DW$578       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$44)
    4853                      .dwattr $C$DW$578, DW_AT_name("clarke_I")
    4854                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_clarke_I")
    4855                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4856                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    4857              
    4858              $C$DW$579       .dwtag  DW_TAG_member
    4859                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$43)
    4860                      .dwattr $C$DW$579, DW_AT_name("clarkeHandle_V")
    4861                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4862                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4863                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    4864              
    4865              $C$DW$580       .dwtag  DW_TAG_member
    4866                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$44)
    4867                      .dwattr $C$DW$580, DW_AT_name("clarke_V")
    4868                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_clarke_V")
    4869                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4870                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    4871              
    4872              $C$DW$581       .dwtag  DW_TAG_member
    4873                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$46)
    4874                      .dwattr $C$DW$581, DW_AT_name("estHandle")
    4875                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_estHandle")
    4876                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4877                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    4878              
    4879              $C$DW$582       .dwtag  DW_TAG_member
    4880                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$48)
    4881                      .dwattr $C$DW$582, DW_AT_name("parkHandle")
    4882                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_parkHandle")
    4883                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4884                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    4885              
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   95

    4886              $C$DW$583       .dwtag  DW_TAG_member
    4887                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$49)
    4888                      .dwattr $C$DW$583, DW_AT_name("park")
    4889                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_park")
    4890                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4891                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    4892              
    4893              $C$DW$584       .dwtag  DW_TAG_member
    4894                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$51)
    4895                      .dwattr $C$DW$584, DW_AT_name("pidHandle_Id")
    4896                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_pidHandle_Id")
    4897                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4898                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    4899              
    4900              $C$DW$585       .dwtag  DW_TAG_member
    4901                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$52)
    4902                      .dwattr $C$DW$585, DW_AT_name("pid_Id")
    4903                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_pid_Id")
    4904                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4905                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    4906              
    4907              $C$DW$586       .dwtag  DW_TAG_member
    4908                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$51)
    4909                      .dwattr $C$DW$586, DW_AT_name("pidHandle_Iq")
    4910                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4911                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4912                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    4913              
    4914              $C$DW$587       .dwtag  DW_TAG_member
    4915                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$52)
    4916                      .dwattr $C$DW$587, DW_AT_name("pid_Iq")
    4917                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_pid_Iq")
    4918                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4919                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    4920              
    4921              $C$DW$588       .dwtag  DW_TAG_member
    4922                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$51)
    4923                      .dwattr $C$DW$588, DW_AT_name("pidHandle_spd")
    4924                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_pidHandle_spd")
    4925                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4926                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    4927              
    4928              $C$DW$589       .dwtag  DW_TAG_member
    4929                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$52)
    4930                      .dwattr $C$DW$589, DW_AT_name("pid_spd")
    4931                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_pid_spd")
    4932                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4933                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    4934              
    4935              $C$DW$590       .dwtag  DW_TAG_member
    4936                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$54)
    4937                      .dwattr $C$DW$590, DW_AT_name("iparkHandle")
    4938                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_iparkHandle")
    4939                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4940                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   96

    4941              
    4942              $C$DW$591       .dwtag  DW_TAG_member
    4943                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$55)
    4944                      .dwattr $C$DW$591, DW_AT_name("ipark")
    4945                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_ipark")
    4946                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4947                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    4948              
    4949              $C$DW$592       .dwtag  DW_TAG_member
    4950                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$57)
    4951                      .dwattr $C$DW$592, DW_AT_name("svgenHandle")
    4952                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_svgenHandle")
    4953                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4954                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    4955              
    4956              $C$DW$593       .dwtag  DW_TAG_member
    4957                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$58)
    4958                      .dwattr $C$DW$593, DW_AT_name("svgen")
    4959                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_svgen")
    4960                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4961                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    4962              
    4963              $C$DW$594       .dwtag  DW_TAG_member
    4964                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$60)
    4965                      .dwattr $C$DW$594, DW_AT_name("trajHandle_Id")
    4966                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_trajHandle_Id")
    4967                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4968                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    4969              
    4970              $C$DW$595       .dwtag  DW_TAG_member
    4971                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$61)
    4972                      .dwattr $C$DW$595, DW_AT_name("traj_Id")
    4973                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_traj_Id")
    4974                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4975                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    4976              
    4977              $C$DW$596       .dwtag  DW_TAG_member
    4978                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$60)
    4979                      .dwattr $C$DW$596, DW_AT_name("trajHandle_spd")
    4980                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_trajHandle_spd")
    4981                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4982                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    4983              
    4984              $C$DW$597       .dwtag  DW_TAG_member
    4985                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$61)
    4986                      .dwattr $C$DW$597, DW_AT_name("traj_spd")
    4987                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_traj_spd")
    4988                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4989                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4990              
    4991              $C$DW$598       .dwtag  DW_TAG_member
    4992                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$60)
    4993                      .dwattr $C$DW$598, DW_AT_name("trajHandle_spdMax")
    4994                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4995                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   97

    4996                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4997              
    4998              $C$DW$599       .dwtag  DW_TAG_member
    4999                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$61)
    5000                      .dwattr $C$DW$599, DW_AT_name("traj_spdMax")
    5001                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_traj_spdMax")
    5002                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5003                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    5004              
    5005              $C$DW$600       .dwtag  DW_TAG_member
    5006                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$62)
    5007                      .dwattr $C$DW$600, DW_AT_name("motorParams")
    5008                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_motorParams")
    5009                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    5010                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    5011              
    5012              $C$DW$601       .dwtag  DW_TAG_member
    5013                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$65)
    5014                      .dwattr $C$DW$601, DW_AT_name("waitTimes")
    5015                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_waitTimes")
    5016                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5017                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    5018              
    5019              $C$DW$602       .dwtag  DW_TAG_member
    5020                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$64)
    5021                      .dwattr $C$DW$602, DW_AT_name("counter_state")
    5022                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_counter_state")
    5023                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    5024                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    5025              
    5026              $C$DW$603       .dwtag  DW_TAG_member
    5027                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$66)
    5028                      .dwattr $C$DW$603, DW_AT_name("numIsrTicksPerCtrlTick")
    5029                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    5030                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    5031                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    5032              
    5033              $C$DW$604       .dwtag  DW_TAG_member
    5034                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$66)
    5035                      .dwattr $C$DW$604, DW_AT_name("numCtrlTicksPerCurrentTick")
    5036                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    5037                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    5038                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    5039              
    5040              $C$DW$605       .dwtag  DW_TAG_member
    5041                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$66)
    5042                      .dwattr $C$DW$605, DW_AT_name("numCtrlTicksPerSpeedTick")
    5043                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    5044                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    5045                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    5046              
    5047              $C$DW$606       .dwtag  DW_TAG_member
    5048                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$66)
    5049                      .dwattr $C$DW$606, DW_AT_name("numCtrlTicksPerTrajTick")
    5050                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   98

    5051                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    5052                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    5053              
    5054              $C$DW$607       .dwtag  DW_TAG_member
    5055                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$64)
    5056                      .dwattr $C$DW$607, DW_AT_name("ctrlFreq_Hz")
    5057                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    5058                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5059                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    5060              
    5061              $C$DW$608       .dwtag  DW_TAG_member
    5062                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$64)
    5063                      .dwattr $C$DW$608, DW_AT_name("trajFreq_Hz")
    5064                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_trajFreq_Hz")
    5065                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    5066                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    5067              
    5068              $C$DW$609       .dwtag  DW_TAG_member
    5069                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$31)
    5070                      .dwattr $C$DW$609, DW_AT_name("trajPeriod_sec")
    5071                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_trajPeriod_sec")
    5072                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    5073                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    5074              
    5075              $C$DW$610       .dwtag  DW_TAG_member
    5076                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$67)
    5077                      .dwattr $C$DW$610, DW_AT_name("ctrlPeriod_sec")
    5078                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    5079                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    5080                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    5081              
    5082              $C$DW$611       .dwtag  DW_TAG_member
    5083                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$31)
    5084                      .dwattr $C$DW$611, DW_AT_name("maxVsMag_pu")
    5085                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_maxVsMag_pu")
    5086                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    5087                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    5088              
    5089              $C$DW$612       .dwtag  DW_TAG_member
    5090                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$68)
    5091                      .dwattr $C$DW$612, DW_AT_name("Iab_in")
    5092                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_Iab_in")
    5093                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    5094                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    5095              
    5096              $C$DW$613       .dwtag  DW_TAG_member
    5097                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$68)
    5098                      .dwattr $C$DW$613, DW_AT_name("Iab_filt")
    5099                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_Iab_filt")
    5100                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    5101                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    5102              
    5103              $C$DW$614       .dwtag  DW_TAG_member
    5104                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$68)
    5105                      .dwattr $C$DW$614, DW_AT_name("Idq_in")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE   99

    5106                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_Idq_in")
    5107                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    5108                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    5109              
    5110              $C$DW$615       .dwtag  DW_TAG_member
    5111                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$68)
    5112                      .dwattr $C$DW$615, DW_AT_name("Vab_in")
    5113                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_Vab_in")
    5114                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    5115                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    5116              
    5117              $C$DW$616       .dwtag  DW_TAG_member
    5118                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$31)
    5119                      .dwattr $C$DW$616, DW_AT_name("spd_out")
    5120                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_spd_out")
    5121                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    5122                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    5123              
    5124              $C$DW$617       .dwtag  DW_TAG_member
    5125                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$68)
    5126                      .dwattr $C$DW$617, DW_AT_name("Vab_out")
    5127                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_Vab_out")
    5128                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    5129                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    5130              
    5131              $C$DW$618       .dwtag  DW_TAG_member
    5132                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$68)
    5133                      .dwattr $C$DW$618, DW_AT_name("Vdq_out")
    5134                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_Vdq_out")
    5135                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    5136                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    5137              
    5138              $C$DW$619       .dwtag  DW_TAG_member
    5139                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$67)
    5140                      .dwattr $C$DW$619, DW_AT_name("Rhf")
    5141                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_Rhf")
    5142                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    5143                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    5144              
    5145              $C$DW$620       .dwtag  DW_TAG_member
    5146                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$67)
    5147                      .dwattr $C$DW$620, DW_AT_name("Lhf")
    5148                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_Lhf")
    5149                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    5150                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    5151              
    5152              $C$DW$621       .dwtag  DW_TAG_member
    5153                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$67)
    5154                      .dwattr $C$DW$621, DW_AT_name("RoverL")
    5155                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_RoverL")
    5156                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    5157                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    5158              
    5159              $C$DW$622       .dwtag  DW_TAG_member
    5160                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE  100

    5161                      .dwattr $C$DW$622, DW_AT_name("Kp_Id")
    5162                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_Kp_Id")
    5163                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    5164                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    5165              
    5166              $C$DW$623       .dwtag  DW_TAG_member
    5167                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$31)
    5168                      .dwattr $C$DW$623, DW_AT_name("Kp_Iq")
    5169                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_Kp_Iq")
    5170                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    5171                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    5172              
    5173              $C$DW$624       .dwtag  DW_TAG_member
    5174                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$31)
    5175                      .dwattr $C$DW$624, DW_AT_name("Kp_spd")
    5176                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_Kp_spd")
    5177                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    5178                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    5179              
    5180              $C$DW$625       .dwtag  DW_TAG_member
    5181                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$31)
    5182                      .dwattr $C$DW$625, DW_AT_name("Ki_Id")
    5183                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_Ki_Id")
    5184                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    5185                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    5186              
    5187              $C$DW$626       .dwtag  DW_TAG_member
    5188                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$31)
    5189                      .dwattr $C$DW$626, DW_AT_name("Ki_Iq")
    5190                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_Ki_Iq")
    5191                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    5192                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    5193              
    5194              $C$DW$627       .dwtag  DW_TAG_member
    5195                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$31)
    5196                      .dwattr $C$DW$627, DW_AT_name("Ki_spd")
    5197                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_Ki_spd")
    5198                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    5199                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    5200              
    5201              $C$DW$628       .dwtag  DW_TAG_member
    5202                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$31)
    5203                      .dwattr $C$DW$628, DW_AT_name("Kd_Id")
    5204                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_Kd_Id")
    5205                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    5206                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    5207              
    5208              $C$DW$629       .dwtag  DW_TAG_member
    5209                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$31)
    5210                      .dwattr $C$DW$629, DW_AT_name("Kd_Iq")
    5211                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_Kd_Iq")
    5212                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    5213                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    5214              
    5215              $C$DW$630       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE  101

    5216                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$31)
    5217                      .dwattr $C$DW$630, DW_AT_name("Kd_spd")
    5218                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_Kd_spd")
    5219                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    5220                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    5221              
    5222              $C$DW$631       .dwtag  DW_TAG_member
    5223                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$31)
    5224                      .dwattr $C$DW$631, DW_AT_name("Ui_Id")
    5225                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_Ui_Id")
    5226                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    5227                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    5228              
    5229              $C$DW$632       .dwtag  DW_TAG_member
    5230                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$31)
    5231                      .dwattr $C$DW$632, DW_AT_name("Ui_Iq")
    5232                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_Ui_Iq")
    5233                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    5234                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    5235              
    5236              $C$DW$633       .dwtag  DW_TAG_member
    5237                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$31)
    5238                      .dwattr $C$DW$633, DW_AT_name("Ui_spd")
    5239                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_Ui_spd")
    5240                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    5241                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    5242              
    5243              $C$DW$634       .dwtag  DW_TAG_member
    5244                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$68)
    5245                      .dwattr $C$DW$634, DW_AT_name("Idq_ref")
    5246                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_Idq_ref")
    5247                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    5248                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    5249              
    5250              $C$DW$635       .dwtag  DW_TAG_member
    5251                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$31)
    5252                      .dwattr $C$DW$635, DW_AT_name("IdRated")
    5253                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_IdRated")
    5254                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    5255                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    5256              
    5257              $C$DW$636       .dwtag  DW_TAG_member
    5258                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$31)
    5259                      .dwattr $C$DW$636, DW_AT_name("spd_ref")
    5260                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_spd_ref")
    5261                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    5262                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    5263              
    5264              $C$DW$637       .dwtag  DW_TAG_member
    5265                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$31)
    5266                      .dwattr $C$DW$637, DW_AT_name("spd_max")
    5267                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_spd_max")
    5268                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    5269                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    5270              
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE  102

    5271              $C$DW$638       .dwtag  DW_TAG_member
    5272                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$66)
    5273                      .dwattr $C$DW$638, DW_AT_name("counter_current")
    5274                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_counter_current")
    5275                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    5276                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    5277              
    5278              $C$DW$639       .dwtag  DW_TAG_member
    5279                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$66)
    5280                      .dwattr $C$DW$639, DW_AT_name("counter_isr")
    5281                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_counter_isr")
    5282                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    5283                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    5284              
    5285              $C$DW$640       .dwtag  DW_TAG_member
    5286                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$66)
    5287                      .dwattr $C$DW$640, DW_AT_name("counter_speed")
    5288                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_counter_speed")
    5289                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    5290                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    5291              
    5292              $C$DW$641       .dwtag  DW_TAG_member
    5293                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$66)
    5294                      .dwattr $C$DW$641, DW_AT_name("counter_traj")
    5295                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_counter_traj")
    5296                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    5297                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    5298              
    5299              $C$DW$642       .dwtag  DW_TAG_member
    5300                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$69)
    5301                      .dwattr $C$DW$642, DW_AT_name("flag_enableCtrl")
    5302                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_flag_enableCtrl")
    5303                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    5304                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    5305              
    5306              $C$DW$643       .dwtag  DW_TAG_member
    5307                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$69)
    5308                      .dwattr $C$DW$643, DW_AT_name("flag_enableDcBusComp")
    5309                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    5310                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    5311                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    5312              
    5313              $C$DW$644       .dwtag  DW_TAG_member
    5314                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$69)
    5315                      .dwattr $C$DW$644, DW_AT_name("flag_enablePowerWarp")
    5316                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    5317                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    5318                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    5319              
    5320              $C$DW$645       .dwtag  DW_TAG_member
    5321                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$69)
    5322                      .dwattr $C$DW$645, DW_AT_name("flag_enableOffset")
    5323                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_flag_enableOffset")
    5324                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    5325                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE  103

    5326              
    5327              $C$DW$646       .dwtag  DW_TAG_member
    5328                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$69)
    5329                      .dwattr $C$DW$646, DW_AT_name("flag_enableSpeedCtrl")
    5330                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    5331                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    5332                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    5333              
    5334              $C$DW$647       .dwtag  DW_TAG_member
    5335                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$69)
    5336                      .dwattr $C$DW$647, DW_AT_name("flag_enableUserMotorParams")
    5337                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    5338                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    5339                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    5340              
    5341              $C$DW$648       .dwtag  DW_TAG_member
    5342                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$68)
    5343                      .dwattr $C$DW$648, DW_AT_name("Idq_offset_pu")
    5344                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_Idq_offset_pu")
    5345                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    5346                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    5347              
    5348              $C$DW$649       .dwtag  DW_TAG_member
    5349                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$68)
    5350                      .dwattr $C$DW$649, DW_AT_name("Vdq_offset_pu")
    5351                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    5352                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    5353                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    5354              
    5355              $C$DW$650       .dwtag  DW_TAG_member
    5356                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$31)
    5357                      .dwattr $C$DW$650, DW_AT_name("angle_pu")
    5358                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_angle_pu")
    5359                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    5360                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    5361              
    5362              $C$DW$651       .dwtag  DW_TAG_member
    5363                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$31)
    5364                      .dwattr $C$DW$651, DW_AT_name("speed_ref_pu")
    5365                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_speed_ref_pu")
    5366                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    5367                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    5368              
    5369              $C$DW$652       .dwtag  DW_TAG_member
    5370                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$31)
    5371                      .dwattr $C$DW$652, DW_AT_name("speed_fb_pu")
    5372                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_speed_fb_pu")
    5373                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    5374                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    5375              
    5376              $C$DW$653       .dwtag  DW_TAG_member
    5377                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$31)
    5378                      .dwattr $C$DW$653, DW_AT_name("speed_outMax_pu")
    5379                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_speed_outMax_pu")
    5380                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE  104

    5381                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    5382              
    5383              $C$DW$654       .dwtag  DW_TAG_member
    5384                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$69)
    5385                      .dwattr $C$DW$654, DW_AT_name("flag_enableCurrentCtrl")
    5386                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    5387                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    5388                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    5389              
    5390                      .dwendtag $C$DW$T$70
    5391              
    5392              $C$DW$T$228     .dwtag  DW_TAG_typedef
    5393                      .dwattr $C$DW$T$228, DW_AT_name("CTRL_Obj")
    5394                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$70)
    5395                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    5396              
    5397              $C$DW$T$229     .dwtag  DW_TAG_pointer_type
    5398                      .dwattr $C$DW$T$229, DW_AT_type(*$C$DW$T$228)
    5399                      .dwattr $C$DW$T$229, DW_AT_address_class(0x20)
    5400              
    5401              $C$DW$T$199     .dwtag  DW_TAG_pointer_type
    5402                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$70)
    5403                      .dwattr $C$DW$T$199, DW_AT_address_class(0x20)
    5404              
    5405              $C$DW$T$200     .dwtag  DW_TAG_typedef
    5406                      .dwattr $C$DW$T$200, DW_AT_name("CTRL_Handle")
    5407                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
    5408                      .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    5409              
    5410              $C$DW$655       .dwtag  DW_TAG_TI_far_type
    5411                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$200)
    5412              
    5413              $C$DW$T$230     .dwtag  DW_TAG_const_type
    5414                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$655)
    5415              
    5416              
    5417              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    5418                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    5419                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    5420              $C$DW$656       .dwtag  DW_TAG_member
    5421                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$22)
    5422                      .dwattr $C$DW$656, DW_AT_name("rsvd")
    5423                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_rsvd")
    5424                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5425                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    5426              
    5427              $C$DW$657       .dwtag  DW_TAG_member
    5428                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$72)
    5429                      .dwattr $C$DW$657, DW_AT_name("targetProc")
    5430                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_targetProc")
    5431                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5432                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    5433              
    5434              $C$DW$658       .dwtag  DW_TAG_member
    5435                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE  105

    5436                      .dwattr $C$DW$658, DW_AT_name("major")
    5437                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_major")
    5438                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5439                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5440              
    5441              $C$DW$659       .dwtag  DW_TAG_member
    5442                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$22)
    5443                      .dwattr $C$DW$659, DW_AT_name("minor")
    5444                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_minor")
    5445                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5446                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5447              
    5448                      .dwendtag $C$DW$T$73
    5449              
    5450              $C$DW$T$37      .dwtag  DW_TAG_typedef
    5451                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
    5452                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    5453                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    5454              
    5455              $C$DW$T$238     .dwtag  DW_TAG_pointer_type
    5456                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$37)
    5457                      .dwattr $C$DW$T$238, DW_AT_address_class(0x20)
    5458              
    5459              
    5460              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    5461                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8301_Obj_")
    5462                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    5463              $C$DW$660       .dwtag  DW_TAG_member
    5464                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$75)
    5465                      .dwattr $C$DW$660, DW_AT_name("spiHandle")
    5466                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_spiHandle")
    5467                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5468                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5469              
    5470              $C$DW$661       .dwtag  DW_TAG_member
    5471                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$77)
    5472                      .dwattr $C$DW$661, DW_AT_name("gpioHandle")
    5473                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_gpioHandle")
    5474                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5475                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5476              
    5477              $C$DW$662       .dwtag  DW_TAG_member
    5478                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$79)
    5479                      .dwattr $C$DW$662, DW_AT_name("gpioNumber")
    5480                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_gpioNumber")
    5481                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5482                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    5483              
    5484              $C$DW$663       .dwtag  DW_TAG_member
    5485                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$69)
    5486                      .dwattr $C$DW$663, DW_AT_name("RxTimeOut")
    5487                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_RxTimeOut")
    5488                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5489                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    5490              
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE  106

    5491              $C$DW$664       .dwtag  DW_TAG_member
    5492                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$69)
    5493                      .dwattr $C$DW$664, DW_AT_name("enableTimeOut")
    5494                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_enableTimeOut")
    5495                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5496                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5497              
    5498                      .dwendtag $C$DW$T$80
    5499              
    5500              $C$DW$T$149     .dwtag  DW_TAG_typedef
    5501                      .dwattr $C$DW$T$149, DW_AT_name("DRV8301_Obj")
    5502                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$80)
    5503                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    5504              
    5505              $C$DW$T$147     .dwtag  DW_TAG_pointer_type
    5506                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$80)
    5507                      .dwattr $C$DW$T$147, DW_AT_address_class(0x20)
    5508              
    5509              $C$DW$T$148     .dwtag  DW_TAG_typedef
    5510                      .dwattr $C$DW$T$148, DW_AT_name("DRV8301_Handle")
    5511                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
    5512                      .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    5513              
    5514              
    5515              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    5516                      .dwattr $C$DW$T$91, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    5517                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x05)
    5518              $C$DW$665       .dwtag  DW_TAG_member
    5519                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$82)
    5520                      .dwattr $C$DW$665, DW_AT_name("DRV8301_CURRENT")
    5521                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    5522                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5523                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5524              
    5525              $C$DW$666       .dwtag  DW_TAG_member
    5526                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$84)
    5527                      .dwattr $C$DW$666, DW_AT_name("DRV8301_RESET")
    5528                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_DRV8301_RESET")
    5529                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5530                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5531              
    5532              $C$DW$667       .dwtag  DW_TAG_member
    5533                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$86)
    5534                      .dwattr $C$DW$667, DW_AT_name("PWM_MODE")
    5535                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_PWM_MODE")
    5536                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5537                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5538              
    5539              $C$DW$668       .dwtag  DW_TAG_member
    5540                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$88)
    5541                      .dwattr $C$DW$668, DW_AT_name("OC_MODE")
    5542                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_OC_MODE")
    5543                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5544                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5545              
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE  107

    5546              $C$DW$669       .dwtag  DW_TAG_member
    5547                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$90)
    5548                      .dwattr $C$DW$669, DW_AT_name("OC_ADJ_SET")
    5549                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    5550                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5551                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5552              
    5553                      .dwendtag $C$DW$T$91
    5554              
    5555              $C$DW$T$105     .dwtag  DW_TAG_typedef
    5556                      .dwattr $C$DW$T$105, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    5557                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$91)
    5558                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    5559              
    5560              
    5561              $C$DW$T$100     .dwtag  DW_TAG_structure_type
    5562                      .dwattr $C$DW$T$100, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    5563                      .dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
    5564              $C$DW$670       .dwtag  DW_TAG_member
    5565                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$93)
    5566                      .dwattr $C$DW$670, DW_AT_name("OCTW_SET")
    5567                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_OCTW_SET")
    5568                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5569                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5570              
    5571              $C$DW$671       .dwtag  DW_TAG_member
    5572                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$95)
    5573                      .dwattr $C$DW$671, DW_AT_name("GAIN")
    5574                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_GAIN")
    5575                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5576                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    5577              
    5578              $C$DW$672       .dwtag  DW_TAG_member
    5579                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$97)
    5580                      .dwattr $C$DW$672, DW_AT_name("DC_CAL_CH1p2")
    5581                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    5582                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5583                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5584              
    5585              $C$DW$673       .dwtag  DW_TAG_member
    5586                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$99)
    5587                      .dwattr $C$DW$673, DW_AT_name("OC_TOFF")
    5588                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_OC_TOFF")
    5589                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5590                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5591              
    5592                      .dwendtag $C$DW$T$100
    5593              
    5594              $C$DW$T$106     .dwtag  DW_TAG_typedef
    5595                      .dwattr $C$DW$T$106, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    5596                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$100)
    5597                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    5598              
    5599              
    5600              $C$DW$T$101     .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE  108

    5601                      .dwattr $C$DW$T$101, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    5602                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x0b)
    5603              $C$DW$674       .dwtag  DW_TAG_member
    5604                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$69)
    5605                      .dwattr $C$DW$674, DW_AT_name("FAULT")
    5606                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_FAULT")
    5607                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5608                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5609              
    5610              $C$DW$675       .dwtag  DW_TAG_member
    5611                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$69)
    5612                      .dwattr $C$DW$675, DW_AT_name("GVDD_UV")
    5613                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_GVDD_UV")
    5614                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5615                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5616              
    5617              $C$DW$676       .dwtag  DW_TAG_member
    5618                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$69)
    5619                      .dwattr $C$DW$676, DW_AT_name("PVDD_UV")
    5620                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_PVDD_UV")
    5621                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5622                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5623              
    5624              $C$DW$677       .dwtag  DW_TAG_member
    5625                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$69)
    5626                      .dwattr $C$DW$677, DW_AT_name("OTSD")
    5627                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_OTSD")
    5628                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5629                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5630              
    5631              $C$DW$678       .dwtag  DW_TAG_member
    5632                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$69)
    5633                      .dwattr $C$DW$678, DW_AT_name("OTW")
    5634                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_OTW")
    5635                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5636                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5637              
    5638              $C$DW$679       .dwtag  DW_TAG_member
    5639                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$69)
    5640                      .dwattr $C$DW$679, DW_AT_name("FETHA_OC")
    5641                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_FETHA_OC")
    5642                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5643                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5644              
    5645              $C$DW$680       .dwtag  DW_TAG_member
    5646                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$69)
    5647                      .dwattr $C$DW$680, DW_AT_name("FETLA_OC")
    5648                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_FETLA_OC")
    5649                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5650                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5651              
    5652              $C$DW$681       .dwtag  DW_TAG_member
    5653                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$69)
    5654                      .dwattr $C$DW$681, DW_AT_name("FETHB_OC")
    5655                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_FETHB_OC")
TMS320C2000 Assembler PC v15.12.3 Thu Dec 01 16:01:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0596010                          PAGE  109

    5656                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5657                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5658              
    5659              $C$DW$682       .dwtag  DW_TAG_member
    5660                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$69)
    5661                      .dwattr $C$DW$682, DW_AT_name("FETLB_OC")
    5662                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_FETLB_OC")
    5663                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5664                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5665              
    5666              $C$DW$683       .dwtag  DW_TAG_member
    5667                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$69)
    5668                      .dwattr $C$DW$683, DW_AT_name("FETHC_OC")
    5669                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_FETHC_OC")
    5670                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5671                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5672              
    5673              $C$DW$684       .dwtag  DW_TAG_member
    5674                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$69)
    5675                      .dwattr $C$DW$684, DW_AT_name("FETLC_OC")
    5676                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_FETLC_OC")
    5677                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5678                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5679              
    5680                      .dwendtag $C$DW$T$101
    5681              
    5682              $C$DW$T$103     .dwtag  DW_TAG_typedef
    5683                      .dwattr $C$DW$T$103, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    5684                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$101)
    5685                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    5686              
    5687              
    5688              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    5689                      .dwattr $C$DW$T$102, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    5690                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x02)
    5691              $C$DW$685       .dwtag  DW_TAG_member
    5692                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$69)
    5693                      .dwattr $C$DW$685, DW_AT_name("GVDD_OV")
