TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Jan 31 20:28:28 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/drivers/drvic/drv8301/src/32b/f
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4092              $C$DW$362       .dwtag  DW_TAG_enumerator
    4093                      .dwattr $C$DW$362, DW_AT_name("DRV8301_RegName_Status_1")
    4094                      .dwattr $C$DW$362, DW_AT_const_value(0x00)
    4095              
    4096              $C$DW$363       .dwtag  DW_TAG_enumerator
    4097                      .dwattr $C$DW$363, DW_AT_name("DRV8301_RegName_Status_2")
    4098                      .dwattr $C$DW$363, DW_AT_const_value(0x800)
    4099              
    4100              $C$DW$364       .dwtag  DW_TAG_enumerator
    4101                      .dwattr $C$DW$364, DW_AT_name("DRV8301_RegName_Control_1")
    4102                      .dwattr $C$DW$364, DW_AT_const_value(0x1000)
    4103              
    4104              $C$DW$365       .dwtag  DW_TAG_enumerator
    4105                      .dwattr $C$DW$365, DW_AT_name("DRV8301_RegName_Control_2")
    4106                      .dwattr $C$DW$365, DW_AT_const_value(0x1800)
    4107              
    4108                      .dwendtag $C$DW$T$106
    4109              
    4110              $C$DW$T$107     .dwtag  DW_TAG_typedef
    4111                      .dwattr $C$DW$T$107, DW_AT_name("DRV8301_RegName_e")
    4112                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    4113                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    4114              
    4115              $C$DW$366       .dwtag  DW_TAG_TI_far_type
    4116                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$107)
    4117              
    4118              $C$DW$T$108     .dwtag  DW_TAG_const_type
    4119                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$366)
    4120              
    4121              
    4122              $C$DW$T$109     .dwtag  DW_TAG_enumeration_type
    4123                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    4124              $C$DW$367       .dwtag  DW_TAG_enumerator
    4125                      .dwattr $C$DW$367, DW_AT_name("DRV8301_FaultType_NoFault")
    4126                      .dwattr $C$DW$367, DW_AT_const_value(0x00)
    4127              
    4128              $C$DW$368       .dwtag  DW_TAG_enumerator
    4129                      .dwattr $C$DW$368, DW_AT_name("DRV8301_FaultType_FETLC_OC")
    4130                      .dwattr $C$DW$368, DW_AT_const_value(0x01)
    4131              
    4132              $C$DW$369       .dwtag  DW_TAG_enumerator
    4133                      .dwattr $C$DW$369, DW_AT_name("DRV8301_FaultType_FETHC_OC")
    4134                      .dwattr $C$DW$369, DW_AT_const_value(0x02)
    4135              
    4136              $C$DW$370       .dwtag  DW_TAG_enumerator
    4137                      .dwattr $C$DW$370, DW_AT_name("DRV8301_FaultType_FETLB_OC")
    4138                      .dwattr $C$DW$370, DW_AT_const_value(0x04)
    4139              
    4140              $C$DW$371       .dwtag  DW_TAG_enumerator
    4141                      .dwattr $C$DW$371, DW_AT_name("DRV8301_FaultType_FETHB_OC")
    4142                      .dwattr $C$DW$371, DW_AT_const_value(0x08)
    4143              
    4144              $C$DW$372       .dwtag  DW_TAG_enumerator
    4145                      .dwattr $C$DW$372, DW_AT_name("DRV8301_FaultType_FETLA_OC")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   79

    4146                      .dwattr $C$DW$372, DW_AT_const_value(0x10)
    4147              
    4148              $C$DW$373       .dwtag  DW_TAG_enumerator
    4149                      .dwattr $C$DW$373, DW_AT_name("DRV8301_FaultType_FETHA_OC")
    4150                      .dwattr $C$DW$373, DW_AT_const_value(0x20)
    4151              
    4152              $C$DW$374       .dwtag  DW_TAG_enumerator
    4153                      .dwattr $C$DW$374, DW_AT_name("DRV8301_FaultType_OTW")
    4154                      .dwattr $C$DW$374, DW_AT_const_value(0x40)
    4155              
    4156              $C$DW$375       .dwtag  DW_TAG_enumerator
    4157                      .dwattr $C$DW$375, DW_AT_name("DRV8301_FaultType_OTSD")
    4158                      .dwattr $C$DW$375, DW_AT_const_value(0x80)
    4159              
    4160              $C$DW$376       .dwtag  DW_TAG_enumerator
    4161                      .dwattr $C$DW$376, DW_AT_name("DRV8301_FaultType_PVDD_UV")
    4162                      .dwattr $C$DW$376, DW_AT_const_value(0x100)
    4163              
    4164              $C$DW$377       .dwtag  DW_TAG_enumerator
    4165                      .dwattr $C$DW$377, DW_AT_name("DRV8301_FaultType_GVDD_UV")
    4166                      .dwattr $C$DW$377, DW_AT_const_value(0x200)
    4167              
    4168              $C$DW$378       .dwtag  DW_TAG_enumerator
    4169                      .dwattr $C$DW$378, DW_AT_name("DRV8301_FaultType_GVDD_OV")
    4170                      .dwattr $C$DW$378, DW_AT_const_value(0x400)
    4171              
    4172                      .dwendtag $C$DW$T$109
    4173              
    4174              $C$DW$T$110     .dwtag  DW_TAG_typedef
    4175                      .dwattr $C$DW$T$110, DW_AT_name("DRV8301_FaultType_e")
    4176                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    4177                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    4178              
    4179              
    4180              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4181                      .dwattr $C$DW$T$26, DW_AT_name("_DRV8301_Obj_")
    4182                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    4183              $C$DW$379       .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    4185                      .dwattr $C$DW$379, DW_AT_name("spiHandle")
    4186                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_spiHandle")
    4187                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4188                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4189              
    4190              $C$DW$380       .dwtag  DW_TAG_member
    4191                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$22)
    4192                      .dwattr $C$DW$380, DW_AT_name("gpioHandle")
    4193                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_gpioHandle")
    4194                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4195                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4196              
    4197              $C$DW$381       .dwtag  DW_TAG_member
    4198                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$24)
    4199                      .dwattr $C$DW$381, DW_AT_name("gpioNumber")
    4200                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_gpioNumber")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   80

    4201                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4202                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4203              
    4204              $C$DW$382       .dwtag  DW_TAG_member
    4205                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$25)
    4206                      .dwattr $C$DW$382, DW_AT_name("RxTimeOut")
    4207                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_RxTimeOut")
    4208                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4209                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4210              
    4211              $C$DW$383       .dwtag  DW_TAG_member
    4212                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$25)
    4213                      .dwattr $C$DW$383, DW_AT_name("enableTimeOut")
    4214                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_enableTimeOut")
    4215                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4216                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4217              
    4218                      .dwendtag $C$DW$T$26
    4219              
    4220              $C$DW$T$113     .dwtag  DW_TAG_typedef
    4221                      .dwattr $C$DW$T$113, DW_AT_name("DRV8301_Obj")
    4222                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$26)
    4223                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    4224              
    4225              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    4226                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$26)
    4227                      .dwattr $C$DW$T$69, DW_AT_address_class(0x20)
    4228              
    4229              $C$DW$T$70      .dwtag  DW_TAG_typedef
    4230                      .dwattr $C$DW$T$70, DW_AT_name("DRV8301_Handle")
    4231                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    4232                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4233              
    4234              $C$DW$384       .dwtag  DW_TAG_TI_far_type
    4235                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$70)
    4236              
    4237              $C$DW$T$114     .dwtag  DW_TAG_const_type
    4238                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$384)
    4239              
    4240              
    4241              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4242                      .dwattr $C$DW$T$37, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    4243                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x05)
    4244              $C$DW$385       .dwtag  DW_TAG_member
    4245                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$28)
    4246                      .dwattr $C$DW$385, DW_AT_name("DRV8301_CURRENT")
    4247                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    4248                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4249                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4250              
    4251              $C$DW$386       .dwtag  DW_TAG_member
    4252                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$30)
    4253                      .dwattr $C$DW$386, DW_AT_name("DRV8301_RESET")
    4254                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_DRV8301_RESET")
    4255                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   81

    4256                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4257              
    4258              $C$DW$387       .dwtag  DW_TAG_member
    4259                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$32)
    4260                      .dwattr $C$DW$387, DW_AT_name("PWM_MODE")
    4261                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_PWM_MODE")
    4262                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4263                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4264              
    4265              $C$DW$388       .dwtag  DW_TAG_member
    4266                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$34)
    4267                      .dwattr $C$DW$388, DW_AT_name("OC_MODE")
    4268                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_OC_MODE")
    4269                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4270                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4271              
    4272              $C$DW$389       .dwtag  DW_TAG_member
    4273                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$36)
    4274                      .dwattr $C$DW$389, DW_AT_name("OC_ADJ_SET")
    4275                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    4276                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4277                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4278              
    4279                      .dwendtag $C$DW$T$37
    4280              
    4281              $C$DW$T$52      .dwtag  DW_TAG_typedef
    4282                      .dwattr $C$DW$T$52, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    4283                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$37)
    4284                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4285              
    4286              
    4287              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4288                      .dwattr $C$DW$T$46, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    4289                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    4290              $C$DW$390       .dwtag  DW_TAG_member
    4291                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$39)
    4292                      .dwattr $C$DW$390, DW_AT_name("OCTW_SET")
    4293                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_OCTW_SET")
    4294                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4295                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4296              
    4297              $C$DW$391       .dwtag  DW_TAG_member
    4298                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$41)
    4299                      .dwattr $C$DW$391, DW_AT_name("GAIN")
    4300                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_GAIN")
    4301                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4302                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4303              
    4304              $C$DW$392       .dwtag  DW_TAG_member
    4305                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$43)
    4306                      .dwattr $C$DW$392, DW_AT_name("DC_CAL_CH1p2")
    4307                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    4308                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4309                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4310              
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   82

    4311              $C$DW$393       .dwtag  DW_TAG_member
    4312                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$45)
    4313                      .dwattr $C$DW$393, DW_AT_name("OC_TOFF")
    4314                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_OC_TOFF")
    4315                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4316                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4317              
    4318                      .dwendtag $C$DW$T$46
    4319              
    4320              $C$DW$T$53      .dwtag  DW_TAG_typedef
    4321                      .dwattr $C$DW$T$53, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    4322                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$46)
    4323                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4324              
    4325              
    4326              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    4327                      .dwattr $C$DW$T$47, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    4328                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x0b)
    4329              $C$DW$394       .dwtag  DW_TAG_member
    4330                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$25)
    4331                      .dwattr $C$DW$394, DW_AT_name("FAULT")
    4332                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_FAULT")
    4333                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4334                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4335              
    4336              $C$DW$395       .dwtag  DW_TAG_member
    4337                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$25)
    4338                      .dwattr $C$DW$395, DW_AT_name("GVDD_UV")
    4339                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_GVDD_UV")
    4340                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4341                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4342              
    4343              $C$DW$396       .dwtag  DW_TAG_member
    4344                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$25)
    4345                      .dwattr $C$DW$396, DW_AT_name("PVDD_UV")
    4346                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_PVDD_UV")
    4347                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4348                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4349              
    4350              $C$DW$397       .dwtag  DW_TAG_member
    4351                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$25)
    4352                      .dwattr $C$DW$397, DW_AT_name("OTSD")
    4353                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_OTSD")
    4354                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4355                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4356              
    4357              $C$DW$398       .dwtag  DW_TAG_member
    4358                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$25)
    4359                      .dwattr $C$DW$398, DW_AT_name("OTW")
    4360                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_OTW")
    4361                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4362                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4363              
    4364              $C$DW$399       .dwtag  DW_TAG_member
    4365                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   83

    4366                      .dwattr $C$DW$399, DW_AT_name("FETHA_OC")
    4367                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_FETHA_OC")
    4368                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4369                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4370              
    4371              $C$DW$400       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$25)
    4373                      .dwattr $C$DW$400, DW_AT_name("FETLA_OC")
    4374                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_FETLA_OC")
    4375                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4376                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4377              
    4378              $C$DW$401       .dwtag  DW_TAG_member
    4379                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$25)
    4380                      .dwattr $C$DW$401, DW_AT_name("FETHB_OC")
    4381                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_FETHB_OC")
    4382                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4383                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4384              
    4385              $C$DW$402       .dwtag  DW_TAG_member
    4386                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$25)
    4387                      .dwattr $C$DW$402, DW_AT_name("FETLB_OC")
    4388                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_FETLB_OC")
    4389                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4390                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4391              
    4392              $C$DW$403       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$25)
    4394                      .dwattr $C$DW$403, DW_AT_name("FETHC_OC")
    4395                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_FETHC_OC")
    4396                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4397                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4398              
    4399              $C$DW$404       .dwtag  DW_TAG_member
    4400                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$25)
    4401                      .dwattr $C$DW$404, DW_AT_name("FETLC_OC")
    4402                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_FETLC_OC")
    4403                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4404                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4405              
    4406                      .dwendtag $C$DW$T$47
    4407              
    4408              $C$DW$T$50      .dwtag  DW_TAG_typedef
    4409                      .dwattr $C$DW$T$50, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    4410                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$47)
    4411                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4412              
    4413              
    4414              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4415                      .dwattr $C$DW$T$49, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    4416                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    4417              $C$DW$405       .dwtag  DW_TAG_member
    4418                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$25)
    4419                      .dwattr $C$DW$405, DW_AT_name("GVDD_OV")
    4420                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_GVDD_OV")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   84

    4421                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4422                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4423              
    4424              $C$DW$406       .dwtag  DW_TAG_member
    4425                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$48)
    4426                      .dwattr $C$DW$406, DW_AT_name("DeviceID")
    4427                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_DeviceID")
    4428                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4429                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4430              
    4431                      .dwendtag $C$DW$T$49
    4432              
    4433              $C$DW$T$51      .dwtag  DW_TAG_typedef
    4434                      .dwattr $C$DW$T$51, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    4435                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$49)
    4436                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4437              
    4438              
    4439              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4440                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    4441                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x18)
    4442              $C$DW$407       .dwtag  DW_TAG_member
    4443                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$50)
    4444                      .dwattr $C$DW$407, DW_AT_name("Stat_Reg_1")
    4445                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Stat_Reg_1")
    4446                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4447                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4448              
    4449              $C$DW$408       .dwtag  DW_TAG_member
    4450                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$51)
    4451                      .dwattr $C$DW$408, DW_AT_name("Stat_Reg_2")
    4452                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Stat_Reg_2")
    4453                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4454                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4455              
    4456              $C$DW$409       .dwtag  DW_TAG_member
    4457                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$52)
    4458                      .dwattr $C$DW$409, DW_AT_name("Ctrl_Reg_1")
    4459                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    4460                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4461                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4462              
    4463              $C$DW$410       .dwtag  DW_TAG_member
    4464                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$53)
    4465                      .dwattr $C$DW$410, DW_AT_name("Ctrl_Reg_2")
    4466                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    4467                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4468                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4469              
    4470              $C$DW$411       .dwtag  DW_TAG_member
    4471                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$25)
    4472                      .dwattr $C$DW$411, DW_AT_name("SndCmd")
    4473                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_SndCmd")
    4474                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4475                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   85

    4476              
    4477              $C$DW$412       .dwtag  DW_TAG_member
    4478                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$25)
    4479                      .dwattr $C$DW$412, DW_AT_name("RcvCmd")
    4480                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_RcvCmd")
    4481                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4482                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4483              
    4484                      .dwendtag $C$DW$T$54
    4485              
    4486              $C$DW$T$120     .dwtag  DW_TAG_typedef
    4487                      .dwattr $C$DW$T$120, DW_AT_name("DRV_SPI_8301_Vars_t")
    4488                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$54)
    4489                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    4490              
    4491              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    4492                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    4493                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    4494              
    4495              $C$DW$413       .dwtag  DW_TAG_TI_far_type
    4496                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$121)
    4497              
    4498              $C$DW$T$122     .dwtag  DW_TAG_const_type
    4499                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$413)
    4500              
    4501              
    4502              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    4503                      .dwattr $C$DW$T$64, DW_AT_name("_GPIO_Obj_")
    4504                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x6a)
    4505              $C$DW$414       .dwtag  DW_TAG_member
    4506                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$56)
    4507                      .dwattr $C$DW$414, DW_AT_name("GPACTRL")
    4508                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_GPACTRL")
    4509                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4510                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4511              
    4512              $C$DW$415       .dwtag  DW_TAG_member
    4513                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$56)
    4514                      .dwattr $C$DW$415, DW_AT_name("GPAQSEL1")
    4515                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_GPAQSEL1")
    4516                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4517                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4518              
    4519              $C$DW$416       .dwtag  DW_TAG_member
    4520                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$56)
    4521                      .dwattr $C$DW$416, DW_AT_name("GPAQSEL2")
    4522                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_GPAQSEL2")
    4523                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4524                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4525              
    4526              $C$DW$417       .dwtag  DW_TAG_member
    4527                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$56)
    4528                      .dwattr $C$DW$417, DW_AT_name("GPAMUX1")
    4529                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_GPAMUX1")
    4530                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   86

    4531                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4532              
    4533              $C$DW$418       .dwtag  DW_TAG_member
    4534                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$56)
    4535                      .dwattr $C$DW$418, DW_AT_name("GPAMUX2")
    4536                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_GPAMUX2")
    4537                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4538                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4539              
    4540              $C$DW$419       .dwtag  DW_TAG_member
    4541                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$56)
    4542                      .dwattr $C$DW$419, DW_AT_name("GPADIR")
    4543                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_GPADIR")
    4544                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4545                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4546              
    4547              $C$DW$420       .dwtag  DW_TAG_member
    4548                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$56)
    4549                      .dwattr $C$DW$420, DW_AT_name("GPAPUD")
    4550                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_GPAPUD")
    4551                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4552                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4553              
    4554              $C$DW$421       .dwtag  DW_TAG_member
    4555                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$58)
    4556                      .dwattr $C$DW$421, DW_AT_name("rsvd_1")
    4557                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_rsvd_1")
    4558                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4559                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4560              
    4561              $C$DW$422       .dwtag  DW_TAG_member
    4562                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$56)
    4563                      .dwattr $C$DW$422, DW_AT_name("GPBCTRL")
    4564                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_GPBCTRL")
    4565                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4566                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4567              
    4568              $C$DW$423       .dwtag  DW_TAG_member
    4569                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$56)
    4570                      .dwattr $C$DW$423, DW_AT_name("GPBQSEL1")
    4571                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_GPBQSEL1")
    4572                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4573                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4574              
    4575              $C$DW$424       .dwtag  DW_TAG_member
    4576                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$58)
    4577                      .dwattr $C$DW$424, DW_AT_name("rsvd_2")
    4578                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_rsvd_2")
    4579                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4580                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4581              
    4582              $C$DW$425       .dwtag  DW_TAG_member
    4583                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$56)
    4584                      .dwattr $C$DW$425, DW_AT_name("GPBMUX1")
    4585                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_GPBMUX1")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   87

    4586                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4587                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4588              
    4589              $C$DW$426       .dwtag  DW_TAG_member
    4590                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$58)
    4591                      .dwattr $C$DW$426, DW_AT_name("rsvd_3")
    4592                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_rsvd_3")
    4593                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4594                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4595              
    4596              $C$DW$427       .dwtag  DW_TAG_member
    4597                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$56)
    4598                      .dwattr $C$DW$427, DW_AT_name("GPBDIR")
    4599                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_GPBDIR")
    4600                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4601                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4602              
    4603              $C$DW$428       .dwtag  DW_TAG_member
    4604                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$56)
    4605                      .dwattr $C$DW$428, DW_AT_name("GPBPUD")
    4606                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_GPBPUD")
    4607                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4608                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4609              
    4610              $C$DW$429       .dwtag  DW_TAG_member
    4611                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$59)
    4612                      .dwattr $C$DW$429, DW_AT_name("rsvd_4")
    4613                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_rsvd_4")
    4614                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4615                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4616              
    4617              $C$DW$430       .dwtag  DW_TAG_member
    4618                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$56)
    4619                      .dwattr $C$DW$430, DW_AT_name("AIOMUX1")
    4620                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_AIOMUX1")
    4621                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4622                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4623              
    4624              $C$DW$431       .dwtag  DW_TAG_member
    4625                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$58)
    4626                      .dwattr $C$DW$431, DW_AT_name("rsvd_5")
    4627                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_rsvd_5")
    4628                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4629                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4630              
    4631              $C$DW$432       .dwtag  DW_TAG_member
    4632                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$56)
    4633                      .dwattr $C$DW$432, DW_AT_name("AIODIR")
    4634                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_AIODIR")
    4635                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4636                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4637              
    4638              $C$DW$433       .dwtag  DW_TAG_member
    4639                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$60)
    4640                      .dwattr $C$DW$433, DW_AT_name("rsvd_6")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   88

    4641                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_rsvd_6")
    4642                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4643                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4644              
    4645              $C$DW$434       .dwtag  DW_TAG_member
    4646                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$56)
    4647                      .dwattr $C$DW$434, DW_AT_name("GPADAT")
    4648                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_GPADAT")
    4649                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4650                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4651              
    4652              $C$DW$435       .dwtag  DW_TAG_member
    4653                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$56)
    4654                      .dwattr $C$DW$435, DW_AT_name("GPASET")
    4655                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_GPASET")
    4656                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4657                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4658              
    4659              $C$DW$436       .dwtag  DW_TAG_member
    4660                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$56)
    4661                      .dwattr $C$DW$436, DW_AT_name("GPACLEAR")
    4662                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_GPACLEAR")
    4663                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4664                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4665              
    4666              $C$DW$437       .dwtag  DW_TAG_member
    4667                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$56)
    4668                      .dwattr $C$DW$437, DW_AT_name("GPATOGGLE")
    4669                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_GPATOGGLE")
    4670                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4671                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4672              
    4673              $C$DW$438       .dwtag  DW_TAG_member
    4674                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$56)
    4675                      .dwattr $C$DW$438, DW_AT_name("GPBDAT")
    4676                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_GPBDAT")
    4677                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4678                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4679              
    4680              $C$DW$439       .dwtag  DW_TAG_member
    4681                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$56)
    4682                      .dwattr $C$DW$439, DW_AT_name("GPBSET")
    4683                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_GPBSET")
    4684                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4685                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4686              
    4687              $C$DW$440       .dwtag  DW_TAG_member
    4688                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$56)
    4689                      .dwattr $C$DW$440, DW_AT_name("GPBCLEAR")
    4690                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_GPBCLEAR")
    4691                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4692                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4693              
    4694              $C$DW$441       .dwtag  DW_TAG_member
    4695                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   89

    4696                      .dwattr $C$DW$441, DW_AT_name("GPBTOGGLE")
    4697                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_GPBTOGGLE")
    4698                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4699                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4700              
    4701              $C$DW$442       .dwtag  DW_TAG_member
    4702                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$61)
    4703                      .dwattr $C$DW$442, DW_AT_name("rsvd_7")
    4704                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_rsvd_7")
    4705                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4706                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4707              
    4708              $C$DW$443       .dwtag  DW_TAG_member
    4709                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$56)
    4710                      .dwattr $C$DW$443, DW_AT_name("AIODAT")
    4711                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_AIODAT")
    4712                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4713                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4714              
    4715              $C$DW$444       .dwtag  DW_TAG_member
    4716                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$56)
    4717                      .dwattr $C$DW$444, DW_AT_name("AIOSET")
    4718                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_AIOSET")
    4719                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    4720                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4721              
    4722              $C$DW$445       .dwtag  DW_TAG_member
    4723                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$56)
    4724                      .dwattr $C$DW$445, DW_AT_name("AIOCLEAR")
    4725                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_AIOCLEAR")
    4726                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4727                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4728              
    4729              $C$DW$446       .dwtag  DW_TAG_member
    4730                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$56)
    4731                      .dwattr $C$DW$446, DW_AT_name("AIOTOGGLE")
    4732                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_AIOTOGGLE")
    4733                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4734                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4735              
    4736              $C$DW$447       .dwtag  DW_TAG_member
    4737                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$62)
    4738                      .dwattr $C$DW$447, DW_AT_name("GPIOXINTnSEL")
    4739                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    4740                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4741                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4742              
    4743              $C$DW$448       .dwtag  DW_TAG_member
    4744                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$63)
    4745                      .dwattr $C$DW$448, DW_AT_name("rsvd_8")
    4746                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_rsvd_8")
    4747                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4748                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4749              
    4750              $C$DW$449       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   90

    4751                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$56)
    4752                      .dwattr $C$DW$449, DW_AT_name("GPIOLPMSEL")
    4753                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    4754                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4755                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4756              
    4757                      .dwendtag $C$DW$T$64
    4758              
    4759              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    4760                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$64)
    4761                      .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    4762              
    4763              $C$DW$T$22      .dwtag  DW_TAG_typedef
    4764                      .dwattr $C$DW$T$22, DW_AT_name("GPIO_Handle")
    4765                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    4766                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    4767              
    4768              $C$DW$450       .dwtag  DW_TAG_TI_far_type
    4769                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$22)
    4770              
    4771              $C$DW$T$125     .dwtag  DW_TAG_const_type
    4772                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$450)
    4773              
    4774              
    4775              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    4776                      .dwattr $C$DW$T$65, DW_AT_name("_SPI_Obj_")
    4777                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
    4778              $C$DW$451       .dwtag  DW_TAG_member
    4779                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$57)
    4780                      .dwattr $C$DW$451, DW_AT_name("SPICCR")
    4781                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_SPICCR")
    4782                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4783                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4784              
    4785              $C$DW$452       .dwtag  DW_TAG_member
    4786                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$57)
    4787                      .dwattr $C$DW$452, DW_AT_name("SPICTL")
    4788                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_SPICTL")
    4789                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4790                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4791              
    4792              $C$DW$453       .dwtag  DW_TAG_member
    4793                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$57)
    4794                      .dwattr $C$DW$453, DW_AT_name("SPIST")
    4795                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_SPIST")
    4796                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4797                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4798              
    4799              $C$DW$454       .dwtag  DW_TAG_member
    4800                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$57)
    4801                      .dwattr $C$DW$454, DW_AT_name("rsvd_1")
    4802                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_rsvd_1")
    4803                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4804                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4805              
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   91

    4806              $C$DW$455       .dwtag  DW_TAG_member
    4807                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$57)
    4808                      .dwattr $C$DW$455, DW_AT_name("SPIBRR")
    4809                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_SPIBRR")
    4810                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4811                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4812              
    4813              $C$DW$456       .dwtag  DW_TAG_member
    4814                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$57)
    4815                      .dwattr $C$DW$456, DW_AT_name("rsvd_2")
    4816                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_rsvd_2")
    4817                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4818                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4819              
    4820              $C$DW$457       .dwtag  DW_TAG_member
    4821                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$57)
    4822                      .dwattr $C$DW$457, DW_AT_name("SPIEMU")
    4823                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_SPIEMU")
    4824                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4825                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4826              
    4827              $C$DW$458       .dwtag  DW_TAG_member
    4828                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$57)
    4829                      .dwattr $C$DW$458, DW_AT_name("SPIRXBUF")
    4830                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_SPIRXBUF")
    4831                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4832                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4833              
    4834              $C$DW$459       .dwtag  DW_TAG_member
    4835                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$57)
    4836                      .dwattr $C$DW$459, DW_AT_name("SPITXBUF")
    4837                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_SPITXBUF")
    4838                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4839                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4840              
    4841              $C$DW$460       .dwtag  DW_TAG_member
    4842                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$57)
    4843                      .dwattr $C$DW$460, DW_AT_name("SPIDAT")
    4844                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_SPIDAT")
    4845                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4846                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4847              
    4848              $C$DW$461       .dwtag  DW_TAG_member
    4849                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$57)
    4850                      .dwattr $C$DW$461, DW_AT_name("SPIFFTX")
    4851                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_SPIFFTX")
    4852                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4853                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4854              
    4855              $C$DW$462       .dwtag  DW_TAG_member
    4856                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$57)
    4857                      .dwattr $C$DW$462, DW_AT_name("SPIFFRX")
    4858                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_SPIFFRX")
    4859                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4860                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   92

    4861              
    4862              $C$DW$463       .dwtag  DW_TAG_member
    4863                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$57)
    4864                      .dwattr $C$DW$463, DW_AT_name("SPIFFCT")
    4865                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_SPIFFCT")
    4866                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4867                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4868              
    4869              $C$DW$464       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$58)
    4871                      .dwattr $C$DW$464, DW_AT_name("rsvd_3")
    4872                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_rsvd_3")
    4873                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4874                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4875              
    4876              $C$DW$465       .dwtag  DW_TAG_member
    4877                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$57)
    4878                      .dwattr $C$DW$465, DW_AT_name("SPIPRI")
    4879                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_SPIPRI")
    4880                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4881                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4882              
    4883                      .dwendtag $C$DW$T$65
    4884              
    4885              $C$DW$T$127     .dwtag  DW_TAG_typedef
    4886                      .dwattr $C$DW$T$127, DW_AT_name("SPI_Obj")
    4887                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$65)
    4888                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    4889              
    4890              $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    4891                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$65)
    4892                      .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
    4893              
    4894              $C$DW$T$20      .dwtag  DW_TAG_typedef
    4895                      .dwattr $C$DW$T$20, DW_AT_name("SPI_Handle")
    4896                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4897                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4898              
    4899              $C$DW$466       .dwtag  DW_TAG_TI_far_type
    4900                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    4901              
    4902              $C$DW$T$128     .dwtag  DW_TAG_const_type
    4903                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$466)
    4904              
    4905              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4906                      .dwattr $C$DW$T$2, DW_AT_name("void")
    4907              
    4908              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4909                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4910                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    4911              
    4912              $C$DW$467       .dwtag  DW_TAG_TI_far_type
    4913                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$3)
    4914              
    4915              $C$DW$T$130     .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:28:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0379610                          PAGE   93

    4916                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$467)
    4917              
    4918              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4919                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4920                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4921                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4922              
    4923              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4924                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4925                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4926                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4927              
    4928              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4929                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4930                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4931                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4932              
    4933              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4934                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4935                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4936                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4937              
    4938              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4939                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4940                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4941                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4942              
    4943              $C$DW$T$9       .dwtag  DW_TAG_base_type
