TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Jan 31 20:38:29 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SPI_setBaudRate")

   12744                      .dwendtag $C$DW$T$323
   12745              
   12746              $C$DW$T$324     .dwtag  DW_TAG_typedef
   12747                      .dwattr $C$DW$T$324, DW_AT_name("SPI_Mode_e")
   12748                      .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$T$323)
   12749                      .dwattr $C$DW$T$324, DW_AT_language(DW_LANG_C)
   12750              
   12751              $C$DW$1683      .dwtag  DW_TAG_TI_far_type
   12752                      .dwattr $C$DW$1683, DW_AT_type(*$C$DW$T$324)
   12753              
   12754              $C$DW$T$325     .dwtag  DW_TAG_const_type
   12755                      .dwattr $C$DW$T$325, DW_AT_type(*$C$DW$1683)
   12756              
   12757              
   12758              $C$DW$T$326     .dwtag  DW_TAG_enumeration_type
   12759                      .dwattr $C$DW$T$326, DW_AT_byte_size(0x01)
   12760              $C$DW$1684      .dwtag  DW_TAG_enumerator
   12761                      .dwattr $C$DW$1684, DW_AT_name("SPI_TxSuspend_00")
   12762                      .dwattr $C$DW$1684, DW_AT_const_value(0x00)
   12763              
   12764              $C$DW$1685      .dwtag  DW_TAG_enumerator
   12765                      .dwattr $C$DW$1685, DW_AT_name("SPI_TxSuspend_10")
   12766                      .dwattr $C$DW$1685, DW_AT_const_value(0x20)
   12767              
   12768              $C$DW$1686      .dwtag  DW_TAG_enumerator
   12769                      .dwattr $C$DW$1686, DW_AT_name("SPI_TxSuspend_free")
   12770                      .dwattr $C$DW$1686, DW_AT_const_value(0x10)
   12771              
   12772                      .dwendtag $C$DW$T$326
   12773              
   12774              $C$DW$T$327     .dwtag  DW_TAG_typedef
   12775                      .dwattr $C$DW$T$327, DW_AT_name("SPI_EmulationSuspend_e")
   12776                      .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$326)
   12777                      .dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
   12778              
   12779              $C$DW$1687      .dwtag  DW_TAG_TI_far_type
   12780                      .dwattr $C$DW$1687, DW_AT_type(*$C$DW$T$327)
   12781              
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  242

   12782              $C$DW$T$328     .dwtag  DW_TAG_const_type
   12783                      .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$1687)
   12784              
   12785              
   12786              $C$DW$T$329     .dwtag  DW_TAG_enumeration_type
   12787                      .dwattr $C$DW$T$329, DW_AT_byte_size(0x01)
   12788              $C$DW$1688      .dwtag  DW_TAG_enumerator
   12789                      .dwattr $C$DW$1688, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   12790                      .dwattr $C$DW$1688, DW_AT_const_value(0x00)
   12791              
   12792              $C$DW$1689      .dwtag  DW_TAG_enumerator
   12793                      .dwattr $C$DW$1689, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   12794                      .dwattr $C$DW$1689, DW_AT_const_value(0x400)
   12795              
   12796              $C$DW$1690      .dwtag  DW_TAG_enumerator
   12797                      .dwattr $C$DW$1690, DW_AT_name("TIMER_EmulationMode_RunFree")
   12798                      .dwattr $C$DW$1690, DW_AT_const_value(0x800)
   12799              
   12800                      .dwendtag $C$DW$T$329
   12801              
   12802              $C$DW$T$330     .dwtag  DW_TAG_typedef
   12803                      .dwattr $C$DW$T$330, DW_AT_name("TIMER_EmulationMode_e")
   12804                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$329)
   12805                      .dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
   12806              
   12807              $C$DW$1691      .dwtag  DW_TAG_TI_far_type
   12808                      .dwattr $C$DW$1691, DW_AT_type(*$C$DW$T$330)
   12809              
   12810              $C$DW$T$331     .dwtag  DW_TAG_const_type
   12811                      .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$1691)
   12812              
   12813              
   12814              $C$DW$T$332     .dwtag  DW_TAG_enumeration_type
   12815                      .dwattr $C$DW$T$332, DW_AT_byte_size(0x01)
   12816              $C$DW$1692      .dwtag  DW_TAG_enumerator
   12817                      .dwattr $C$DW$1692, DW_AT_name("HAL_SensorType_Current")
   12818                      .dwattr $C$DW$1692, DW_AT_const_value(0x00)
   12819              
   12820              $C$DW$1693      .dwtag  DW_TAG_enumerator
   12821                      .dwattr $C$DW$1693, DW_AT_name("HAL_SensorType_Voltage")
   12822                      .dwattr $C$DW$1693, DW_AT_const_value(0x01)
   12823              
   12824                      .dwendtag $C$DW$T$332
   12825              
   12826              $C$DW$T$333     .dwtag  DW_TAG_typedef
   12827                      .dwattr $C$DW$T$333, DW_AT_name("HAL_SensorType_e")
   12828                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$332)
   12829                      .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
   12830              
   12831              
   12832              $C$DW$T$29      .dwtag  DW_TAG_structure_type
   12833                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
   12834                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
   12835              $C$DW$1694      .dwtag  DW_TAG_member
   12836                      .dwattr $C$DW$1694, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  243

   12837                      .dwattr $C$DW$1694, DW_AT_name("ADCRESULT")
   12838                      .dwattr $C$DW$1694, DW_AT_TI_symbol_name("_ADCRESULT")
   12839                      .dwattr $C$DW$1694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12840                      .dwattr $C$DW$1694, DW_AT_accessibility(DW_ACCESS_public)
   12841              
   12842              $C$DW$1695      .dwtag  DW_TAG_member
   12843                      .dwattr $C$DW$1695, DW_AT_type(*$C$DW$T$24)
   12844                      .dwattr $C$DW$1695, DW_AT_name("resvd_1")
   12845                      .dwattr $C$DW$1695, DW_AT_TI_symbol_name("_resvd_1")
   12846                      .dwattr $C$DW$1695, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12847                      .dwattr $C$DW$1695, DW_AT_accessibility(DW_ACCESS_public)
   12848              
   12849              $C$DW$1696      .dwtag  DW_TAG_member
   12850                      .dwattr $C$DW$1696, DW_AT_type(*$C$DW$T$22)
   12851                      .dwattr $C$DW$1696, DW_AT_name("ADCCTL1")
   12852                      .dwattr $C$DW$1696, DW_AT_TI_symbol_name("_ADCCTL1")
   12853                      .dwattr $C$DW$1696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   12854                      .dwattr $C$DW$1696, DW_AT_accessibility(DW_ACCESS_public)
   12855              
   12856              $C$DW$1697      .dwtag  DW_TAG_member
   12857                      .dwattr $C$DW$1697, DW_AT_type(*$C$DW$T$22)
   12858                      .dwattr $C$DW$1697, DW_AT_name("ADCCTL2")
   12859                      .dwattr $C$DW$1697, DW_AT_TI_symbol_name("_ADCCTL2")
   12860                      .dwattr $C$DW$1697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   12861                      .dwattr $C$DW$1697, DW_AT_accessibility(DW_ACCESS_public)
   12862              
   12863              $C$DW$1698      .dwtag  DW_TAG_member
   12864                      .dwattr $C$DW$1698, DW_AT_type(*$C$DW$T$25)
   12865                      .dwattr $C$DW$1698, DW_AT_name("rsvd_2")
   12866                      .dwattr $C$DW$1698, DW_AT_TI_symbol_name("_rsvd_2")
   12867                      .dwattr $C$DW$1698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   12868                      .dwattr $C$DW$1698, DW_AT_accessibility(DW_ACCESS_public)
   12869              
   12870              $C$DW$1699      .dwtag  DW_TAG_member
   12871                      .dwattr $C$DW$1699, DW_AT_type(*$C$DW$T$22)
   12872                      .dwattr $C$DW$1699, DW_AT_name("ADCINTFLG")
   12873                      .dwattr $C$DW$1699, DW_AT_TI_symbol_name("_ADCINTFLG")
   12874                      .dwattr $C$DW$1699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   12875                      .dwattr $C$DW$1699, DW_AT_accessibility(DW_ACCESS_public)
   12876              
   12877              $C$DW$1700      .dwtag  DW_TAG_member
   12878                      .dwattr $C$DW$1700, DW_AT_type(*$C$DW$T$22)
   12879                      .dwattr $C$DW$1700, DW_AT_name("ADCINTFLGCLR")
   12880                      .dwattr $C$DW$1700, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   12881                      .dwattr $C$DW$1700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   12882                      .dwattr $C$DW$1700, DW_AT_accessibility(DW_ACCESS_public)
   12883              
   12884              $C$DW$1701      .dwtag  DW_TAG_member
   12885                      .dwattr $C$DW$1701, DW_AT_type(*$C$DW$T$22)
   12886                      .dwattr $C$DW$1701, DW_AT_name("ADCINTOVF")
   12887                      .dwattr $C$DW$1701, DW_AT_TI_symbol_name("_ADCINTOVF")
   12888                      .dwattr $C$DW$1701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   12889                      .dwattr $C$DW$1701, DW_AT_accessibility(DW_ACCESS_public)
   12890              
   12891              $C$DW$1702      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  244

   12892                      .dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$22)
   12893                      .dwattr $C$DW$1702, DW_AT_name("ADCINTOVFCLR")
   12894                      .dwattr $C$DW$1702, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   12895                      .dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   12896                      .dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
   12897              
   12898              $C$DW$1703      .dwtag  DW_TAG_member
   12899                      .dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$26)
   12900                      .dwattr $C$DW$1703, DW_AT_name("INTSELxNy")
   12901                      .dwattr $C$DW$1703, DW_AT_TI_symbol_name("_INTSELxNy")
   12902                      .dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   12903                      .dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
   12904              
   12905              $C$DW$1704      .dwtag  DW_TAG_member
   12906                      .dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$27)
   12907                      .dwattr $C$DW$1704, DW_AT_name("rsvd_3")
   12908                      .dwattr $C$DW$1704, DW_AT_TI_symbol_name("_rsvd_3")
   12909                      .dwattr $C$DW$1704, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   12910                      .dwattr $C$DW$1704, DW_AT_accessibility(DW_ACCESS_public)
   12911              
   12912              $C$DW$1705      .dwtag  DW_TAG_member
   12913                      .dwattr $C$DW$1705, DW_AT_type(*$C$DW$T$22)
   12914                      .dwattr $C$DW$1705, DW_AT_name("SOCPRICTRL")
   12915                      .dwattr $C$DW$1705, DW_AT_TI_symbol_name("_SOCPRICTRL")
   12916                      .dwattr $C$DW$1705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   12917                      .dwattr $C$DW$1705, DW_AT_accessibility(DW_ACCESS_public)
   12918              
   12919              $C$DW$1706      .dwtag  DW_TAG_member
   12920                      .dwattr $C$DW$1706, DW_AT_type(*$C$DW$T$22)
   12921                      .dwattr $C$DW$1706, DW_AT_name("rsvd_4")
   12922                      .dwattr $C$DW$1706, DW_AT_TI_symbol_name("_rsvd_4")
   12923                      .dwattr $C$DW$1706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   12924                      .dwattr $C$DW$1706, DW_AT_accessibility(DW_ACCESS_public)
   12925              
   12926              $C$DW$1707      .dwtag  DW_TAG_member
   12927                      .dwattr $C$DW$1707, DW_AT_type(*$C$DW$T$22)
   12928                      .dwattr $C$DW$1707, DW_AT_name("ADCSAMPLEMODE")
   12929                      .dwattr $C$DW$1707, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   12930                      .dwattr $C$DW$1707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   12931                      .dwattr $C$DW$1707, DW_AT_accessibility(DW_ACCESS_public)
   12932              
   12933              $C$DW$1708      .dwtag  DW_TAG_member
   12934                      .dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$22)
   12935                      .dwattr $C$DW$1708, DW_AT_name("rsvd_5")
   12936                      .dwattr $C$DW$1708, DW_AT_TI_symbol_name("_rsvd_5")
   12937                      .dwattr $C$DW$1708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   12938                      .dwattr $C$DW$1708, DW_AT_accessibility(DW_ACCESS_public)
   12939              
   12940              $C$DW$1709      .dwtag  DW_TAG_member
   12941                      .dwattr $C$DW$1709, DW_AT_type(*$C$DW$T$22)
   12942                      .dwattr $C$DW$1709, DW_AT_name("ADCINTSOCSEL1")
   12943                      .dwattr $C$DW$1709, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   12944                      .dwattr $C$DW$1709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   12945                      .dwattr $C$DW$1709, DW_AT_accessibility(DW_ACCESS_public)
   12946              
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  245

   12947              $C$DW$1710      .dwtag  DW_TAG_member
   12948                      .dwattr $C$DW$1710, DW_AT_type(*$C$DW$T$22)
   12949                      .dwattr $C$DW$1710, DW_AT_name("ADCINTSOCSEL2")
   12950                      .dwattr $C$DW$1710, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   12951                      .dwattr $C$DW$1710, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   12952                      .dwattr $C$DW$1710, DW_AT_accessibility(DW_ACCESS_public)
   12953              
   12954              $C$DW$1711      .dwtag  DW_TAG_member
   12955                      .dwattr $C$DW$1711, DW_AT_type(*$C$DW$T$25)
   12956                      .dwattr $C$DW$1711, DW_AT_name("rsvd_6")
   12957                      .dwattr $C$DW$1711, DW_AT_TI_symbol_name("_rsvd_6")
   12958                      .dwattr $C$DW$1711, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   12959                      .dwattr $C$DW$1711, DW_AT_accessibility(DW_ACCESS_public)
   12960              
   12961              $C$DW$1712      .dwtag  DW_TAG_member
   12962                      .dwattr $C$DW$1712, DW_AT_type(*$C$DW$T$22)
   12963                      .dwattr $C$DW$1712, DW_AT_name("ADCSOCFLG1")
   12964                      .dwattr $C$DW$1712, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   12965                      .dwattr $C$DW$1712, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   12966                      .dwattr $C$DW$1712, DW_AT_accessibility(DW_ACCESS_public)
   12967              
   12968              $C$DW$1713      .dwtag  DW_TAG_member
   12969                      .dwattr $C$DW$1713, DW_AT_type(*$C$DW$T$22)
   12970                      .dwattr $C$DW$1713, DW_AT_name("rsvd_7")
   12971                      .dwattr $C$DW$1713, DW_AT_TI_symbol_name("_rsvd_7")
   12972                      .dwattr $C$DW$1713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   12973                      .dwattr $C$DW$1713, DW_AT_accessibility(DW_ACCESS_public)
   12974              
   12975              $C$DW$1714      .dwtag  DW_TAG_member
   12976                      .dwattr $C$DW$1714, DW_AT_type(*$C$DW$T$22)
   12977                      .dwattr $C$DW$1714, DW_AT_name("ADCSOCFRC1")
   12978                      .dwattr $C$DW$1714, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   12979                      .dwattr $C$DW$1714, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   12980                      .dwattr $C$DW$1714, DW_AT_accessibility(DW_ACCESS_public)
   12981              
   12982              $C$DW$1715      .dwtag  DW_TAG_member
   12983                      .dwattr $C$DW$1715, DW_AT_type(*$C$DW$T$22)
   12984                      .dwattr $C$DW$1715, DW_AT_name("rsvd_8")
   12985                      .dwattr $C$DW$1715, DW_AT_TI_symbol_name("_rsvd_8")
   12986                      .dwattr $C$DW$1715, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   12987                      .dwattr $C$DW$1715, DW_AT_accessibility(DW_ACCESS_public)
   12988              
   12989              $C$DW$1716      .dwtag  DW_TAG_member
   12990                      .dwattr $C$DW$1716, DW_AT_type(*$C$DW$T$22)
   12991                      .dwattr $C$DW$1716, DW_AT_name("ADCSOCOVF1")
   12992                      .dwattr $C$DW$1716, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   12993                      .dwattr $C$DW$1716, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   12994                      .dwattr $C$DW$1716, DW_AT_accessibility(DW_ACCESS_public)
   12995              
   12996              $C$DW$1717      .dwtag  DW_TAG_member
   12997                      .dwattr $C$DW$1717, DW_AT_type(*$C$DW$T$22)
   12998                      .dwattr $C$DW$1717, DW_AT_name("rsvd_9")
   12999                      .dwattr $C$DW$1717, DW_AT_TI_symbol_name("_rsvd_9")
   13000                      .dwattr $C$DW$1717, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   13001                      .dwattr $C$DW$1717, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  246

   13002              
   13003              $C$DW$1718      .dwtag  DW_TAG_member
   13004                      .dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$22)
   13005                      .dwattr $C$DW$1718, DW_AT_name("ADCSOCOVFCLR1")
   13006                      .dwattr $C$DW$1718, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   13007                      .dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   13008                      .dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
   13009              
   13010              $C$DW$1719      .dwtag  DW_TAG_member
   13011                      .dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$22)
   13012                      .dwattr $C$DW$1719, DW_AT_name("rsvd_10")
   13013                      .dwattr $C$DW$1719, DW_AT_TI_symbol_name("_rsvd_10")
   13014                      .dwattr $C$DW$1719, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   13015                      .dwattr $C$DW$1719, DW_AT_accessibility(DW_ACCESS_public)
   13016              
   13017              $C$DW$1720      .dwtag  DW_TAG_member
   13018                      .dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$23)
   13019                      .dwattr $C$DW$1720, DW_AT_name("ADCSOCxCTL")
   13020                      .dwattr $C$DW$1720, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   13021                      .dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   13022                      .dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
   13023              
   13024              $C$DW$1721      .dwtag  DW_TAG_member
   13025                      .dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$23)
   13026                      .dwattr $C$DW$1721, DW_AT_name("rsvd_11")
   13027                      .dwattr $C$DW$1721, DW_AT_TI_symbol_name("_rsvd_11")
   13028                      .dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   13029                      .dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
   13030              
   13031              $C$DW$1722      .dwtag  DW_TAG_member
   13032                      .dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$22)
   13033                      .dwattr $C$DW$1722, DW_AT_name("ADCREFTRIM")
   13034                      .dwattr $C$DW$1722, DW_AT_TI_symbol_name("_ADCREFTRIM")
   13035                      .dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   13036                      .dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
   13037              
   13038              $C$DW$1723      .dwtag  DW_TAG_member
   13039                      .dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$22)
   13040                      .dwattr $C$DW$1723, DW_AT_name("ADCOFFTRIM")
   13041                      .dwattr $C$DW$1723, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   13042                      .dwattr $C$DW$1723, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   13043                      .dwattr $C$DW$1723, DW_AT_accessibility(DW_ACCESS_public)
   13044              
   13045              $C$DW$1724      .dwtag  DW_TAG_member
   13046                      .dwattr $C$DW$1724, DW_AT_type(*$C$DW$T$28)
   13047                      .dwattr $C$DW$1724, DW_AT_name("resvd_12")
   13048                      .dwattr $C$DW$1724, DW_AT_TI_symbol_name("_resvd_12")
   13049                      .dwattr $C$DW$1724, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   13050                      .dwattr $C$DW$1724, DW_AT_accessibility(DW_ACCESS_public)
   13051              
   13052              $C$DW$1725      .dwtag  DW_TAG_member
   13053                      .dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$22)
   13054                      .dwattr $C$DW$1725, DW_AT_name("ADCREV")
   13055                      .dwattr $C$DW$1725, DW_AT_TI_symbol_name("_ADCREV")
   13056                      .dwattr $C$DW$1725, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  247

   13057                      .dwattr $C$DW$1725, DW_AT_accessibility(DW_ACCESS_public)
   13058              
   13059                      .dwendtag $C$DW$T$29
   13060              
   13061              $C$DW$T$335     .dwtag  DW_TAG_typedef
   13062                      .dwattr $C$DW$T$335, DW_AT_name("ADC_Obj")
   13063                      .dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$29)
   13064                      .dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
   13065              
   13066              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
   13067                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$29)
   13068                      .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
   13069              
   13070              $C$DW$T$82      .dwtag  DW_TAG_typedef
   13071                      .dwattr $C$DW$T$82, DW_AT_name("ADC_Handle")
   13072                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
   13073                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   13074              
   13075              
   13076              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   13077                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
   13078                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
   13079              $C$DW$1726      .dwtag  DW_TAG_member
   13080                      .dwattr $C$DW$1726, DW_AT_type(*$C$DW$T$22)
   13081                      .dwattr $C$DW$1726, DW_AT_name("XCLK")
   13082                      .dwattr $C$DW$1726, DW_AT_TI_symbol_name("_XCLK")
   13083                      .dwattr $C$DW$1726, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13084                      .dwattr $C$DW$1726, DW_AT_accessibility(DW_ACCESS_public)
   13085              
   13086              $C$DW$1727      .dwtag  DW_TAG_member
   13087                      .dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$22)
   13088                      .dwattr $C$DW$1727, DW_AT_name("rsvd_1")
   13089                      .dwattr $C$DW$1727, DW_AT_TI_symbol_name("_rsvd_1")
   13090                      .dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13091                      .dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
   13092              
   13093              $C$DW$1728      .dwtag  DW_TAG_member
   13094                      .dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$22)
   13095                      .dwattr $C$DW$1728, DW_AT_name("CLKCTL")
   13096                      .dwattr $C$DW$1728, DW_AT_TI_symbol_name("_CLKCTL")
   13097                      .dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13098                      .dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
   13099              
   13100              $C$DW$1729      .dwtag  DW_TAG_member
   13101                      .dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$30)
   13102                      .dwattr $C$DW$1729, DW_AT_name("rsvd_2")
   13103                      .dwattr $C$DW$1729, DW_AT_TI_symbol_name("_rsvd_2")
   13104                      .dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13105                      .dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
   13106              
   13107              $C$DW$1730      .dwtag  DW_TAG_member
   13108                      .dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$22)
   13109                      .dwattr $C$DW$1730, DW_AT_name("LOSPCP")
   13110                      .dwattr $C$DW$1730, DW_AT_TI_symbol_name("_LOSPCP")
   13111                      .dwattr $C$DW$1730, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  248

   13112                      .dwattr $C$DW$1730, DW_AT_accessibility(DW_ACCESS_public)
   13113              
   13114              $C$DW$1731      .dwtag  DW_TAG_member
   13115                      .dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$22)
   13116                      .dwattr $C$DW$1731, DW_AT_name("PCLKCR0")
   13117                      .dwattr $C$DW$1731, DW_AT_TI_symbol_name("_PCLKCR0")
   13118                      .dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13119                      .dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
   13120              
   13121              $C$DW$1732      .dwtag  DW_TAG_member
   13122                      .dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$22)
   13123                      .dwattr $C$DW$1732, DW_AT_name("PCLKCR1")
   13124                      .dwattr $C$DW$1732, DW_AT_TI_symbol_name("_PCLKCR1")
   13125                      .dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13126                      .dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
   13127              
   13128              $C$DW$1733      .dwtag  DW_TAG_member
   13129                      .dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$25)
   13130                      .dwattr $C$DW$1733, DW_AT_name("rsvd_3")
   13131                      .dwattr $C$DW$1733, DW_AT_TI_symbol_name("_rsvd_3")
   13132                      .dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13133                      .dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
   13134              
   13135              $C$DW$1734      .dwtag  DW_TAG_member
   13136                      .dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$22)
   13137                      .dwattr $C$DW$1734, DW_AT_name("PCLKCR3")
   13138                      .dwattr $C$DW$1734, DW_AT_TI_symbol_name("_PCLKCR3")
   13139                      .dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13140                      .dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
   13141              
   13142                      .dwendtag $C$DW$T$31
   13143              
   13144              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
   13145                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$31)
   13146                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
   13147              
   13148              $C$DW$T$84      .dwtag  DW_TAG_typedef
   13149                      .dwattr $C$DW$T$84, DW_AT_name("CLK_Handle")
   13150                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
   13151                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
   13152              
   13153              
   13154              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   13155                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
   13156                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   13157              $C$DW$1735      .dwtag  DW_TAG_member
   13158                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$32)
   13159                      .dwattr $C$DW$1735, DW_AT_name("tmp")
   13160                      .dwattr $C$DW$1735, DW_AT_TI_symbol_name("_tmp")
   13161                      .dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13162                      .dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
   13163              
   13164                      .dwendtag $C$DW$T$33
   13165              
   13166              $C$DW$T$344     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  249

   13167                      .dwattr $C$DW$T$344, DW_AT_name("CPU_Obj")
   13168                      .dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$33)
   13169                      .dwattr $C$DW$T$344, DW_AT_language(DW_LANG_C)
   13170              
   13171              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
   13172                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$33)
   13173                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
   13174              
   13175              $C$DW$T$86      .dwtag  DW_TAG_typedef
   13176                      .dwattr $C$DW$T$86, DW_AT_name("CPU_Handle")
   13177                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
   13178                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
   13179              
   13180              
   13181              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   13182                      .dwattr $C$DW$T$41, DW_AT_name("_DRV8301_Obj_")
   13183                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
   13184              $C$DW$1736      .dwtag  DW_TAG_member
   13185                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$35)
   13186                      .dwattr $C$DW$1736, DW_AT_name("spiHandle")
   13187                      .dwattr $C$DW$1736, DW_AT_TI_symbol_name("_spiHandle")
   13188                      .dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13189                      .dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
   13190              
   13191              $C$DW$1737      .dwtag  DW_TAG_member
   13192                      .dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$37)
   13193                      .dwattr $C$DW$1737, DW_AT_name("gpioHandle")
   13194                      .dwattr $C$DW$1737, DW_AT_TI_symbol_name("_gpioHandle")
   13195                      .dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13196                      .dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
   13197              
   13198              $C$DW$1738      .dwtag  DW_TAG_member
   13199                      .dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$39)
   13200                      .dwattr $C$DW$1738, DW_AT_name("gpioNumber")
   13201                      .dwattr $C$DW$1738, DW_AT_TI_symbol_name("_gpioNumber")
   13202                      .dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13203                      .dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
   13204              
   13205              $C$DW$1739      .dwtag  DW_TAG_member
   13206                      .dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$40)
   13207                      .dwattr $C$DW$1739, DW_AT_name("RxTimeOut")
   13208                      .dwattr $C$DW$1739, DW_AT_TI_symbol_name("_RxTimeOut")
   13209                      .dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13210                      .dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
   13211              
   13212              $C$DW$1740      .dwtag  DW_TAG_member
   13213                      .dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$40)
   13214                      .dwattr $C$DW$1740, DW_AT_name("enableTimeOut")
   13215                      .dwattr $C$DW$1740, DW_AT_TI_symbol_name("_enableTimeOut")
   13216                      .dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13217                      .dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
   13218              
   13219                      .dwendtag $C$DW$T$41
   13220              
   13221              $C$DW$T$114     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  250

   13222                      .dwattr $C$DW$T$114, DW_AT_name("DRV8301_Obj")
   13223                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$41)
   13224                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
   13225              
   13226              $C$DW$T$112     .dwtag  DW_TAG_pointer_type
   13227                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$41)
   13228                      .dwattr $C$DW$T$112, DW_AT_address_class(0x20)
   13229              
   13230              $C$DW$T$113     .dwtag  DW_TAG_typedef
   13231                      .dwattr $C$DW$T$113, DW_AT_name("DRV8301_Handle")
   13232                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
   13233                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
   13234              
   13235              
   13236              $C$DW$T$52      .dwtag  DW_TAG_structure_type
   13237                      .dwattr $C$DW$T$52, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   13238                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
   13239              $C$DW$1741      .dwtag  DW_TAG_member
   13240                      .dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$43)
   13241                      .dwattr $C$DW$1741, DW_AT_name("DRV8301_CURRENT")
   13242                      .dwattr $C$DW$1741, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   13243                      .dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13244                      .dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
   13245              
   13246              $C$DW$1742      .dwtag  DW_TAG_member
   13247                      .dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$45)
   13248                      .dwattr $C$DW$1742, DW_AT_name("DRV8301_RESET")
   13249                      .dwattr $C$DW$1742, DW_AT_TI_symbol_name("_DRV8301_RESET")
   13250                      .dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13251                      .dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
   13252              
   13253              $C$DW$1743      .dwtag  DW_TAG_member
   13254                      .dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$47)
   13255                      .dwattr $C$DW$1743, DW_AT_name("PWM_MODE")
   13256                      .dwattr $C$DW$1743, DW_AT_TI_symbol_name("_PWM_MODE")
   13257                      .dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13258                      .dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
   13259              
   13260              $C$DW$1744      .dwtag  DW_TAG_member
   13261                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$49)
   13262                      .dwattr $C$DW$1744, DW_AT_name("OC_MODE")
   13263                      .dwattr $C$DW$1744, DW_AT_TI_symbol_name("_OC_MODE")
   13264                      .dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13265                      .dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
   13266              
   13267              $C$DW$1745      .dwtag  DW_TAG_member
   13268                      .dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$51)
   13269                      .dwattr $C$DW$1745, DW_AT_name("OC_ADJ_SET")
   13270                      .dwattr $C$DW$1745, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   13271                      .dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13272                      .dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
   13273              
   13274                      .dwendtag $C$DW$T$52
   13275              
   13276              $C$DW$T$66      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  251

   13277                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   13278                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$52)
   13279                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   13280              
   13281              
   13282              $C$DW$T$61      .dwtag  DW_TAG_structure_type
   13283                      .dwattr $C$DW$T$61, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   13284                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
   13285              $C$DW$1746      .dwtag  DW_TAG_member
   13286                      .dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$54)
   13287                      .dwattr $C$DW$1746, DW_AT_name("OCTW_SET")
   13288                      .dwattr $C$DW$1746, DW_AT_TI_symbol_name("_OCTW_SET")
   13289                      .dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13290                      .dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
   13291              
   13292              $C$DW$1747      .dwtag  DW_TAG_member
   13293                      .dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$56)
   13294                      .dwattr $C$DW$1747, DW_AT_name("GAIN")
   13295                      .dwattr $C$DW$1747, DW_AT_TI_symbol_name("_GAIN")
   13296                      .dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13297                      .dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
   13298              
   13299              $C$DW$1748      .dwtag  DW_TAG_member
   13300                      .dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$58)
   13301                      .dwattr $C$DW$1748, DW_AT_name("DC_CAL_CH1p2")
   13302                      .dwattr $C$DW$1748, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   13303                      .dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13304                      .dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
   13305              
   13306              $C$DW$1749      .dwtag  DW_TAG_member
   13307                      .dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$60)
   13308                      .dwattr $C$DW$1749, DW_AT_name("OC_TOFF")
   13309                      .dwattr $C$DW$1749, DW_AT_TI_symbol_name("_OC_TOFF")
   13310                      .dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13311                      .dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
   13312              
   13313                      .dwendtag $C$DW$T$61
   13314              
   13315              $C$DW$T$67      .dwtag  DW_TAG_typedef
   13316                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   13317                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$61)
   13318                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   13319              
   13320              
   13321              $C$DW$T$62      .dwtag  DW_TAG_structure_type
   13322                      .dwattr $C$DW$T$62, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   13323                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x0b)
   13324              $C$DW$1750      .dwtag  DW_TAG_member
   13325                      .dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$40)
   13326                      .dwattr $C$DW$1750, DW_AT_name("FAULT")
   13327                      .dwattr $C$DW$1750, DW_AT_TI_symbol_name("_FAULT")
   13328                      .dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13329                      .dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
   13330              
   13331              $C$DW$1751      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  252

   13332                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$40)
   13333                      .dwattr $C$DW$1751, DW_AT_name("GVDD_UV")
   13334                      .dwattr $C$DW$1751, DW_AT_TI_symbol_name("_GVDD_UV")
   13335                      .dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13336                      .dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
   13337              
   13338              $C$DW$1752      .dwtag  DW_TAG_member
   13339                      .dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$40)
   13340                      .dwattr $C$DW$1752, DW_AT_name("PVDD_UV")
   13341                      .dwattr $C$DW$1752, DW_AT_TI_symbol_name("_PVDD_UV")
   13342                      .dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13343                      .dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
   13344              
   13345              $C$DW$1753      .dwtag  DW_TAG_member
   13346                      .dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$40)
   13347                      .dwattr $C$DW$1753, DW_AT_name("OTSD")
   13348                      .dwattr $C$DW$1753, DW_AT_TI_symbol_name("_OTSD")
   13349                      .dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13350                      .dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
   13351              
   13352              $C$DW$1754      .dwtag  DW_TAG_member
   13353                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$40)
   13354                      .dwattr $C$DW$1754, DW_AT_name("OTW")
   13355                      .dwattr $C$DW$1754, DW_AT_TI_symbol_name("_OTW")
   13356                      .dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13357                      .dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
   13358              
   13359              $C$DW$1755      .dwtag  DW_TAG_member
   13360                      .dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$40)
   13361                      .dwattr $C$DW$1755, DW_AT_name("FETHA_OC")
   13362                      .dwattr $C$DW$1755, DW_AT_TI_symbol_name("_FETHA_OC")
   13363                      .dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13364                      .dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
   13365              
   13366              $C$DW$1756      .dwtag  DW_TAG_member
   13367                      .dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$40)
   13368                      .dwattr $C$DW$1756, DW_AT_name("FETLA_OC")
   13369                      .dwattr $C$DW$1756, DW_AT_TI_symbol_name("_FETLA_OC")
   13370                      .dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13371                      .dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
   13372              
   13373              $C$DW$1757      .dwtag  DW_TAG_member
   13374                      .dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$40)
   13375                      .dwattr $C$DW$1757, DW_AT_name("FETHB_OC")
   13376                      .dwattr $C$DW$1757, DW_AT_TI_symbol_name("_FETHB_OC")
   13377                      .dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13378                      .dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
   13379              
   13380              $C$DW$1758      .dwtag  DW_TAG_member
   13381                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$40)
   13382                      .dwattr $C$DW$1758, DW_AT_name("FETLB_OC")
   13383                      .dwattr $C$DW$1758, DW_AT_TI_symbol_name("_FETLB_OC")
   13384                      .dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13385                      .dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
   13386              
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  253

   13387              $C$DW$1759      .dwtag  DW_TAG_member
   13388                      .dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$40)
   13389                      .dwattr $C$DW$1759, DW_AT_name("FETHC_OC")
   13390                      .dwattr $C$DW$1759, DW_AT_TI_symbol_name("_FETHC_OC")
   13391                      .dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13392                      .dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
   13393              
   13394              $C$DW$1760      .dwtag  DW_TAG_member
   13395                      .dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$40)
   13396                      .dwattr $C$DW$1760, DW_AT_name("FETLC_OC")
   13397                      .dwattr $C$DW$1760, DW_AT_TI_symbol_name("_FETLC_OC")
   13398                      .dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13399                      .dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
   13400              
   13401                      .dwendtag $C$DW$T$62
   13402              
   13403              $C$DW$T$64      .dwtag  DW_TAG_typedef
   13404                      .dwattr $C$DW$T$64, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   13405                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$62)
   13406                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   13407              
   13408              
   13409              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   13410                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   13411                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x02)
   13412              $C$DW$1761      .dwtag  DW_TAG_member
   13413                      .dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$40)
   13414                      .dwattr $C$DW$1761, DW_AT_name("GVDD_OV")
   13415                      .dwattr $C$DW$1761, DW_AT_TI_symbol_name("_GVDD_OV")
   13416                      .dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13417                      .dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
   13418              
   13419              $C$DW$1762      .dwtag  DW_TAG_member
   13420                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$21)
   13421                      .dwattr $C$DW$1762, DW_AT_name("DeviceID")
   13422                      .dwattr $C$DW$1762, DW_AT_TI_symbol_name("_DeviceID")
   13423                      .dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13424                      .dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
   13425              
   13426                      .dwendtag $C$DW$T$63
   13427              
   13428              $C$DW$T$65      .dwtag  DW_TAG_typedef
   13429                      .dwattr $C$DW$T$65, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   13430                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
   13431                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   13432              
   13433              
   13434              $C$DW$T$68      .dwtag  DW_TAG_structure_type
   13435                      .dwattr $C$DW$T$68, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   13436                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x18)
   13437              $C$DW$1763      .dwtag  DW_TAG_member
   13438                      .dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$64)
   13439                      .dwattr $C$DW$1763, DW_AT_name("Stat_Reg_1")
   13440                      .dwattr $C$DW$1763, DW_AT_TI_symbol_name("_Stat_Reg_1")
   13441                      .dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  254

   13442                      .dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
   13443              
   13444              $C$DW$1764      .dwtag  DW_TAG_member
   13445                      .dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$65)
   13446                      .dwattr $C$DW$1764, DW_AT_name("Stat_Reg_2")
   13447                      .dwattr $C$DW$1764, DW_AT_TI_symbol_name("_Stat_Reg_2")
   13448                      .dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13449                      .dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
   13450              
   13451              $C$DW$1765      .dwtag  DW_TAG_member
   13452                      .dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$66)
   13453                      .dwattr $C$DW$1765, DW_AT_name("Ctrl_Reg_1")
   13454                      .dwattr $C$DW$1765, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   13455                      .dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13456                      .dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
   13457              
   13458              $C$DW$1766      .dwtag  DW_TAG_member
   13459                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$67)
   13460                      .dwattr $C$DW$1766, DW_AT_name("Ctrl_Reg_2")
   13461                      .dwattr $C$DW$1766, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   13462                      .dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13463                      .dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
   13464              
   13465              $C$DW$1767      .dwtag  DW_TAG_member
   13466                      .dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$40)
   13467                      .dwattr $C$DW$1767, DW_AT_name("SndCmd")
   13468                      .dwattr $C$DW$1767, DW_AT_TI_symbol_name("_SndCmd")
   13469                      .dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13470                      .dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
   13471              
   13472              $C$DW$1768      .dwtag  DW_TAG_member
   13473                      .dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$40)
   13474                      .dwattr $C$DW$1768, DW_AT_name("RcvCmd")
   13475                      .dwattr $C$DW$1768, DW_AT_TI_symbol_name("_RcvCmd")
   13476                      .dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   13477                      .dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
   13478              
   13479                      .dwendtag $C$DW$T$68
   13480              
   13481              $C$DW$T$351     .dwtag  DW_TAG_typedef
   13482                      .dwattr $C$DW$T$351, DW_AT_name("DRV_SPI_8301_Vars_t")
   13483                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$T$68)
   13484                      .dwattr $C$DW$T$351, DW_AT_language(DW_LANG_C)
   13485              
   13486              $C$DW$T$352     .dwtag  DW_TAG_pointer_type
   13487                      .dwattr $C$DW$T$352, DW_AT_type(*$C$DW$T$351)
   13488                      .dwattr $C$DW$T$352, DW_AT_address_class(0x20)
   13489              
   13490              
   13491              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   13492                      .dwattr $C$DW$T$70, DW_AT_name("_FILTER_FO_")
   13493                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
   13494              $C$DW$1769      .dwtag  DW_TAG_member
   13495                      .dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$69)
   13496                      .dwattr $C$DW$1769, DW_AT_name("a1")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  255

   13497                      .dwattr $C$DW$1769, DW_AT_TI_symbol_name("_a1")
   13498                      .dwattr $C$DW$1769, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13499                      .dwattr $C$DW$1769, DW_AT_accessibility(DW_ACCESS_public)
   13500              
   13501              $C$DW$1770      .dwtag  DW_TAG_member
   13502                      .dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$69)
   13503                      .dwattr $C$DW$1770, DW_AT_name("b0")
   13504                      .dwattr $C$DW$1770, DW_AT_TI_symbol_name("_b0")
   13505                      .dwattr $C$DW$1770, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13506                      .dwattr $C$DW$1770, DW_AT_accessibility(DW_ACCESS_public)
   13507              
   13508              $C$DW$1771      .dwtag  DW_TAG_member
   13509                      .dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$69)
   13510                      .dwattr $C$DW$1771, DW_AT_name("b1")
   13511                      .dwattr $C$DW$1771, DW_AT_TI_symbol_name("_b1")
   13512                      .dwattr $C$DW$1771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13513                      .dwattr $C$DW$1771, DW_AT_accessibility(DW_ACCESS_public)
   13514              
   13515              $C$DW$1772      .dwtag  DW_TAG_member
   13516                      .dwattr $C$DW$1772, DW_AT_type(*$C$DW$T$69)
   13517                      .dwattr $C$DW$1772, DW_AT_name("x1")
   13518                      .dwattr $C$DW$1772, DW_AT_TI_symbol_name("_x1")
   13519                      .dwattr $C$DW$1772, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13520                      .dwattr $C$DW$1772, DW_AT_accessibility(DW_ACCESS_public)
   13521              
   13522              $C$DW$1773      .dwtag  DW_TAG_member
   13523                      .dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$69)
   13524                      .dwattr $C$DW$1773, DW_AT_name("y1")
   13525                      .dwattr $C$DW$1773, DW_AT_TI_symbol_name("_y1")
   13526                      .dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13527                      .dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
   13528              
   13529                      .dwendtag $C$DW$T$70
   13530              
   13531              $C$DW$T$120     .dwtag  DW_TAG_typedef
   13532                      .dwattr $C$DW$T$120, DW_AT_name("FILTER_FO_Obj")
   13533                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$70)
   13534                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
   13535              
   13536              
   13537              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   13538                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   13539                      .dwattr $C$DW$T$19, DW_AT_declaration
   13540                      .dwendtag $C$DW$T$19
   13541              
   13542              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
   13543                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$19)
   13544                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
   13545              
   13546              $C$DW$T$122     .dwtag  DW_TAG_typedef
   13547                      .dwattr $C$DW$T$122, DW_AT_name("FILTER_FO_Handle")
   13548                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
   13549                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
   13550              
   13551              
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  256

   13552              $C$DW$T$71      .dwtag  DW_TAG_structure_type
   13553                      .dwattr $C$DW$T$71, DW_AT_name("_FLASH_Obj_")
   13554                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
   13555              $C$DW$1774      .dwtag  DW_TAG_member
   13556                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$22)
   13557                      .dwattr $C$DW$1774, DW_AT_name("FOPT")
   13558                      .dwattr $C$DW$1774, DW_AT_TI_symbol_name("_FOPT")
   13559                      .dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13560                      .dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
   13561              
   13562              $C$DW$1775      .dwtag  DW_TAG_member
   13563                      .dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$22)
   13564                      .dwattr $C$DW$1775, DW_AT_name("rsvd_1")
   13565                      .dwattr $C$DW$1775, DW_AT_TI_symbol_name("_rsvd_1")
   13566                      .dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13567                      .dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
   13568              
   13569              $C$DW$1776      .dwtag  DW_TAG_member
   13570                      .dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$22)
   13571                      .dwattr $C$DW$1776, DW_AT_name("FPWR")
   13572                      .dwattr $C$DW$1776, DW_AT_TI_symbol_name("_FPWR")
   13573                      .dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13574                      .dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
   13575              
   13576              $C$DW$1777      .dwtag  DW_TAG_member
   13577                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$22)
   13578                      .dwattr $C$DW$1777, DW_AT_name("FSTATUS")
   13579                      .dwattr $C$DW$1777, DW_AT_TI_symbol_name("_FSTATUS")
   13580                      .dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13581                      .dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
   13582              
   13583              $C$DW$1778      .dwtag  DW_TAG_member
   13584                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$22)
   13585                      .dwattr $C$DW$1778, DW_AT_name("FSTDBYWAIT")
   13586                      .dwattr $C$DW$1778, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   13587                      .dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13588                      .dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
   13589              
   13590              $C$DW$1779      .dwtag  DW_TAG_member
   13591                      .dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$22)
   13592                      .dwattr $C$DW$1779, DW_AT_name("FACTIVEWAIT")
   13593                      .dwattr $C$DW$1779, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   13594                      .dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13595                      .dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
   13596              
   13597              $C$DW$1780      .dwtag  DW_TAG_member
   13598                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$22)
   13599                      .dwattr $C$DW$1780, DW_AT_name("FBANKWAIT")
   13600                      .dwattr $C$DW$1780, DW_AT_TI_symbol_name("_FBANKWAIT")
   13601                      .dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13602                      .dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
   13603              
   13604              $C$DW$1781      .dwtag  DW_TAG_member
   13605                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$22)
   13606                      .dwattr $C$DW$1781, DW_AT_name("FOTPWAIT")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  257

   13607                      .dwattr $C$DW$1781, DW_AT_TI_symbol_name("_FOTPWAIT")
   13608                      .dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13609                      .dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
   13610              
   13611                      .dwendtag $C$DW$T$71
   13612              
   13613              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
   13614                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$71)
   13615                      .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
   13616              
   13617              $C$DW$T$88      .dwtag  DW_TAG_typedef
   13618                      .dwattr $C$DW$T$88, DW_AT_name("FLASH_Handle")
   13619                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
   13620                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
   13621              
   13622              
   13623              $C$DW$T$76      .dwtag  DW_TAG_structure_type
   13624                      .dwattr $C$DW$T$76, DW_AT_name("_GPIO_Obj_")
   13625                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x6a)
   13626              $C$DW$1782      .dwtag  DW_TAG_member
   13627                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$73)
   13628                      .dwattr $C$DW$1782, DW_AT_name("GPACTRL")
   13629                      .dwattr $C$DW$1782, DW_AT_TI_symbol_name("_GPACTRL")
   13630                      .dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13631                      .dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
   13632              
   13633              $C$DW$1783      .dwtag  DW_TAG_member
   13634                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$73)
   13635                      .dwattr $C$DW$1783, DW_AT_name("GPAQSEL1")
   13636                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_GPAQSEL1")
   13637                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13638                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
   13639              
   13640              $C$DW$1784      .dwtag  DW_TAG_member
   13641                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$73)
   13642                      .dwattr $C$DW$1784, DW_AT_name("GPAQSEL2")
   13643                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_GPAQSEL2")
   13644                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13645                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
   13646              
   13647              $C$DW$1785      .dwtag  DW_TAG_member
   13648                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$73)
   13649                      .dwattr $C$DW$1785, DW_AT_name("GPAMUX1")
   13650                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_GPAMUX1")
   13651                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13652                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
   13653              
   13654              $C$DW$1786      .dwtag  DW_TAG_member
   13655                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$73)
   13656                      .dwattr $C$DW$1786, DW_AT_name("GPAMUX2")
   13657                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_GPAMUX2")
   13658                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13659                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
   13660              
   13661              $C$DW$1787      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  258

   13662                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$73)
   13663                      .dwattr $C$DW$1787, DW_AT_name("GPADIR")
   13664                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_GPADIR")
   13665                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13666                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
   13667              
   13668              $C$DW$1788      .dwtag  DW_TAG_member
   13669                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$73)
   13670                      .dwattr $C$DW$1788, DW_AT_name("GPAPUD")
   13671                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_GPAPUD")
   13672                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13673                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
   13674              
   13675              $C$DW$1789      .dwtag  DW_TAG_member
   13676                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$25)
   13677                      .dwattr $C$DW$1789, DW_AT_name("rsvd_1")
   13678                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_rsvd_1")
   13679                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13680                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
   13681              
   13682              $C$DW$1790      .dwtag  DW_TAG_member
   13683                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$73)
   13684                      .dwattr $C$DW$1790, DW_AT_name("GPBCTRL")
   13685                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_GPBCTRL")
   13686                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13687                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   13688              
   13689              $C$DW$1791      .dwtag  DW_TAG_member
   13690                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$73)
   13691                      .dwattr $C$DW$1791, DW_AT_name("GPBQSEL1")
   13692                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_GPBQSEL1")
   13693                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13694                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   13695              
   13696              $C$DW$1792      .dwtag  DW_TAG_member
   13697                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$25)
   13698                      .dwattr $C$DW$1792, DW_AT_name("rsvd_2")
   13699                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_rsvd_2")
   13700                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13701                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
   13702              
   13703              $C$DW$1793      .dwtag  DW_TAG_member
   13704                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$73)
   13705                      .dwattr $C$DW$1793, DW_AT_name("GPBMUX1")
   13706                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_GPBMUX1")
   13707                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13708                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   13709              
   13710              $C$DW$1794      .dwtag  DW_TAG_member
   13711                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$25)
   13712                      .dwattr $C$DW$1794, DW_AT_name("rsvd_3")
   13713                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_rsvd_3")
   13714                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   13715                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   13716              
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  259

   13717              $C$DW$1795      .dwtag  DW_TAG_member
   13718                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$73)
   13719                      .dwattr $C$DW$1795, DW_AT_name("GPBDIR")
   13720                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_GPBDIR")
   13721                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13722                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   13723              
   13724              $C$DW$1796      .dwtag  DW_TAG_member
   13725                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$73)
   13726                      .dwattr $C$DW$1796, DW_AT_name("GPBPUD")
   13727                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_GPBPUD")
   13728                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   13729                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
   13730              
   13731              $C$DW$1797      .dwtag  DW_TAG_member
   13732                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$74)
   13733                      .dwattr $C$DW$1797, DW_AT_name("rsvd_4")
   13734                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_rsvd_4")
   13735                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   13736                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   13737              
   13738              $C$DW$1798      .dwtag  DW_TAG_member
   13739                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$73)
   13740                      .dwattr $C$DW$1798, DW_AT_name("AIOMUX1")
   13741                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_AIOMUX1")
   13742                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   13743                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   13744              
   13745              $C$DW$1799      .dwtag  DW_TAG_member
   13746                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$25)
   13747                      .dwattr $C$DW$1799, DW_AT_name("rsvd_5")
   13748                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_rsvd_5")
   13749                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   13750                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   13751              
   13752              $C$DW$1800      .dwtag  DW_TAG_member
   13753                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$73)
   13754                      .dwattr $C$DW$1800, DW_AT_name("AIODIR")
   13755                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_AIODIR")
   13756                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   13757                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   13758              
   13759              $C$DW$1801      .dwtag  DW_TAG_member
   13760                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$75)
   13761                      .dwattr $C$DW$1801, DW_AT_name("rsvd_6")
   13762                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_rsvd_6")
   13763                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   13764                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   13765              
   13766              $C$DW$1802      .dwtag  DW_TAG_member
   13767                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$73)
   13768                      .dwattr $C$DW$1802, DW_AT_name("GPADAT")
   13769                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_GPADAT")
   13770                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   13771                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  260

   13772              
   13773              $C$DW$1803      .dwtag  DW_TAG_member
   13774                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$73)
   13775                      .dwattr $C$DW$1803, DW_AT_name("GPASET")
   13776                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_GPASET")
   13777                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   13778                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
   13779              
   13780              $C$DW$1804      .dwtag  DW_TAG_member
   13781                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$73)
   13782                      .dwattr $C$DW$1804, DW_AT_name("GPACLEAR")
   13783                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_GPACLEAR")
   13784                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   13785                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   13786              
   13787              $C$DW$1805      .dwtag  DW_TAG_member
   13788                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$73)
   13789                      .dwattr $C$DW$1805, DW_AT_name("GPATOGGLE")
   13790                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_GPATOGGLE")
   13791                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   13792                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   13793              
   13794              $C$DW$1806      .dwtag  DW_TAG_member
   13795                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$73)
   13796                      .dwattr $C$DW$1806, DW_AT_name("GPBDAT")
   13797                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_GPBDAT")
   13798                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   13799                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
   13800              
   13801              $C$DW$1807      .dwtag  DW_TAG_member
   13802                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$73)
   13803                      .dwattr $C$DW$1807, DW_AT_name("GPBSET")
   13804                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_GPBSET")
   13805                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   13806                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   13807              
   13808              $C$DW$1808      .dwtag  DW_TAG_member
   13809                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$73)
   13810                      .dwattr $C$DW$1808, DW_AT_name("GPBCLEAR")
   13811                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_GPBCLEAR")
   13812                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   13813                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   13814              
   13815              $C$DW$1809      .dwtag  DW_TAG_member
   13816                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$73)
   13817                      .dwattr $C$DW$1809, DW_AT_name("GPBTOGGLE")
   13818                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_GPBTOGGLE")
   13819                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   13820                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   13821              
   13822              $C$DW$1810      .dwtag  DW_TAG_member
   13823                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$30)
   13824                      .dwattr $C$DW$1810, DW_AT_name("rsvd_7")
   13825                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_rsvd_7")
   13826                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  261

   13827                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   13828              
   13829              $C$DW$1811      .dwtag  DW_TAG_member
   13830                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$73)
   13831                      .dwattr $C$DW$1811, DW_AT_name("AIODAT")
   13832                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_AIODAT")
   13833                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   13834                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   13835              
   13836              $C$DW$1812      .dwtag  DW_TAG_member
   13837                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$73)
   13838                      .dwattr $C$DW$1812, DW_AT_name("AIOSET")
   13839                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_AIOSET")
   13840                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   13841                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   13842              
   13843              $C$DW$1813      .dwtag  DW_TAG_member
   13844                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$73)
   13845                      .dwattr $C$DW$1813, DW_AT_name("AIOCLEAR")
   13846                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_AIOCLEAR")
   13847                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   13848                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   13849              
   13850              $C$DW$1814      .dwtag  DW_TAG_member
   13851                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$73)
   13852                      .dwattr $C$DW$1814, DW_AT_name("AIOTOGGLE")
   13853                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_AIOTOGGLE")
   13854                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   13855                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
   13856              
   13857              $C$DW$1815      .dwtag  DW_TAG_member
   13858                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$27)
   13859                      .dwattr $C$DW$1815, DW_AT_name("GPIOXINTnSEL")
   13860                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   13861                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   13862                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   13863              
   13864              $C$DW$1816      .dwtag  DW_TAG_member
   13865                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$26)
   13866                      .dwattr $C$DW$1816, DW_AT_name("rsvd_8")
   13867                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_rsvd_8")
   13868                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   13869                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   13870              
   13871              $C$DW$1817      .dwtag  DW_TAG_member
   13872                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$73)
   13873                      .dwattr $C$DW$1817, DW_AT_name("GPIOLPMSEL")
   13874                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   13875                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   13876                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   13877              
   13878                      .dwendtag $C$DW$T$76
   13879              
   13880              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
   13881                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$76)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  262

   13882                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
   13883              
   13884              $C$DW$T$37      .dwtag  DW_TAG_typedef
   13885                      .dwattr $C$DW$T$37, DW_AT_name("GPIO_Handle")
   13886                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
   13887                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
   13888              
   13889              
   13890              $C$DW$T$78      .dwtag  DW_TAG_structure_type
   13891                      .dwattr $C$DW$T$78, DW_AT_name("_HAL_AdcData_t_")
   13892                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0e)
   13893              $C$DW$1818      .dwtag  DW_TAG_member
   13894                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$77)
   13895                      .dwattr $C$DW$1818, DW_AT_name("I")
   13896                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_I")
   13897                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13898                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   13899              
   13900              $C$DW$1819      .dwtag  DW_TAG_member
   13901                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$77)
   13902                      .dwattr $C$DW$1819, DW_AT_name("V")
   13903                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_V")
   13904                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13905                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   13906              
   13907              $C$DW$1820      .dwtag  DW_TAG_member
   13908                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$69)
   13909                      .dwattr $C$DW$1820, DW_AT_name("dcBus")
   13910                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_dcBus")
   13911                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13912                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   13913              
   13914                      .dwendtag $C$DW$T$78
   13915              
   13916              $C$DW$T$110     .dwtag  DW_TAG_typedef
   13917                      .dwattr $C$DW$T$110, DW_AT_name("HAL_AdcData_t")
   13918                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$78)
   13919                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
   13920              
   13921              
   13922              $C$DW$T$80      .dwtag  DW_TAG_structure_type
   13923                      .dwattr $C$DW$T$80, DW_AT_name("_HAL_DacData_t_")
   13924                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x1a)
   13925              $C$DW$1821      .dwtag  DW_TAG_member
   13926                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$21)
   13927                      .dwattr $C$DW$1821, DW_AT_name("PeriodMax")
   13928                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_PeriodMax")
   13929                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13930                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   13931              
   13932              $C$DW$1822      .dwtag  DW_TAG_member
   13933                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$79)
   13934                      .dwattr $C$DW$1822, DW_AT_name("value")
   13935                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_value")
   13936                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  263

   13937                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   13938              
   13939              $C$DW$1823      .dwtag  DW_TAG_member
   13940                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$79)
   13941                      .dwattr $C$DW$1823, DW_AT_name("offset")
   13942                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_offset")
   13943                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13944                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   13945              
   13946              $C$DW$1824      .dwtag  DW_TAG_member
   13947                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$79)
   13948                      .dwattr $C$DW$1824, DW_AT_name("gain")
   13949                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_gain")
   13950                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13951                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   13952              
   13953                      .dwendtag $C$DW$T$80
   13954              
   13955              $C$DW$T$362     .dwtag  DW_TAG_typedef
   13956                      .dwattr $C$DW$T$362, DW_AT_name("HAL_DacData_t")
   13957                      .dwattr $C$DW$T$362, DW_AT_type(*$C$DW$T$80)
   13958                      .dwattr $C$DW$T$362, DW_AT_language(DW_LANG_C)
   13959              
   13960              $C$DW$T$363     .dwtag  DW_TAG_pointer_type
   13961                      .dwattr $C$DW$T$363, DW_AT_type(*$C$DW$T$362)
   13962                      .dwattr $C$DW$T$363, DW_AT_address_class(0x20)
   13963              
   13964              $C$DW$1825      .dwtag  DW_TAG_TI_far_type
   13965                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$363)
   13966              
   13967              $C$DW$T$364     .dwtag  DW_TAG_const_type
   13968                      .dwattr $C$DW$T$364, DW_AT_type(*$C$DW$1825)
   13969              
   13970              
   13971              $C$DW$T$117     .dwtag  DW_TAG_structure_type
   13972                      .dwattr $C$DW$T$117, DW_AT_name("_HAL_Obj_")
   13973                      .dwattr $C$DW$T$117, DW_AT_byte_size(0xc4)
   13974              $C$DW$1826      .dwtag  DW_TAG_member
   13975                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$82)
   13976                      .dwattr $C$DW$1826, DW_AT_name("adcHandle")
   13977                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_adcHandle")
   13978                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13979                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   13980              
   13981              $C$DW$1827      .dwtag  DW_TAG_member
   13982                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$84)
   13983                      .dwattr $C$DW$1827, DW_AT_name("clkHandle")
   13984                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_clkHandle")
   13985                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13986                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   13987              
   13988              $C$DW$1828      .dwtag  DW_TAG_member
   13989                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$86)
   13990                      .dwattr $C$DW$1828, DW_AT_name("cpuHandle")
   13991                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_cpuHandle")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  264

   13992                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13993                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   13994              
   13995              $C$DW$1829      .dwtag  DW_TAG_member
   13996                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$88)
   13997                      .dwattr $C$DW$1829, DW_AT_name("flashHandle")
   13998                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_flashHandle")
   13999                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14000                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   14001              
   14002              $C$DW$1830      .dwtag  DW_TAG_member
   14003                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$37)
   14004                      .dwattr $C$DW$1830, DW_AT_name("gpioHandle")
   14005                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_gpioHandle")
   14006                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14007                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   14008              
   14009              $C$DW$1831      .dwtag  DW_TAG_member
   14010                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$91)
   14011                      .dwattr $C$DW$1831, DW_AT_name("offsetHandle_I")
   14012                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_offsetHandle_I")
   14013                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14014                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   14015              
   14016              $C$DW$1832      .dwtag  DW_TAG_member
   14017                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$93)
   14018                      .dwattr $C$DW$1832, DW_AT_name("offset_I")
   14019                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_offset_I")
   14020                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14021                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   14022              
   14023              $C$DW$1833      .dwtag  DW_TAG_member
   14024                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$91)
   14025                      .dwattr $C$DW$1833, DW_AT_name("offsetHandle_V")
   14026                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_offsetHandle_V")
   14027                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14028                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   14029              
   14030              $C$DW$1834      .dwtag  DW_TAG_member
   14031                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$93)
   14032                      .dwattr $C$DW$1834, DW_AT_name("offset_V")
   14033                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_offset_V")
   14034                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14035                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   14036              
   14037              $C$DW$1835      .dwtag  DW_TAG_member
   14038                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$95)
   14039                      .dwattr $C$DW$1835, DW_AT_name("oscHandle")
   14040                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_oscHandle")
   14041                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   14042                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   14043              
   14044              $C$DW$1836      .dwtag  DW_TAG_member
   14045                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$97)
   14046                      .dwattr $C$DW$1836, DW_AT_name("pieHandle")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  265

   14047                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_pieHandle")
   14048                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   14049                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   14050              
   14051              $C$DW$1837      .dwtag  DW_TAG_member
   14052                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$99)
   14053                      .dwattr $C$DW$1837, DW_AT_name("pllHandle")
   14054                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_pllHandle")
   14055                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   14056                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   14057              
   14058              $C$DW$1838      .dwtag  DW_TAG_member
   14059                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$102)
   14060                      .dwattr $C$DW$1838, DW_AT_name("pwmHandle")
   14061                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_pwmHandle")
   14062                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   14063                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   14064              
   14065              $C$DW$1839      .dwtag  DW_TAG_member
   14066                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$102)
   14067                      .dwattr $C$DW$1839, DW_AT_name("pwmDacHandle")
   14068                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_pwmDacHandle")
   14069                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   14070                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   14071              
   14072              $C$DW$1840      .dwtag  DW_TAG_member
   14073                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$104)
   14074                      .dwattr $C$DW$1840, DW_AT_name("pwrHandle")
   14075                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_pwrHandle")
   14076                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   14077                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   14078              
   14079              $C$DW$1841      .dwtag  DW_TAG_member
   14080                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$107)
   14081                      .dwattr $C$DW$1841, DW_AT_name("timerHandle")
   14082                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_timerHandle")
   14083                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   14084                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   14085              
   14086              $C$DW$1842      .dwtag  DW_TAG_member
   14087                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$109)
   14088                      .dwattr $C$DW$1842, DW_AT_name("wdogHandle")
   14089                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_wdogHandle")
   14090                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   14091                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   14092              
   14093              $C$DW$1843      .dwtag  DW_TAG_member
   14094                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$110)
   14095                      .dwattr $C$DW$1843, DW_AT_name("adcBias")
   14096                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_adcBias")
   14097                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   14098                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   14099              
   14100              $C$DW$1844      .dwtag  DW_TAG_member
   14101                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0154010                          PAGE  266

   14102                      .dwattr $C$DW$1844, DW_AT_name("current_sf")
   14103                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_current_sf")
   14104                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
