TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Jan 31 20:38:33 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    5242                      .dwattr $C$DW$582, DW_AT_name("PIE_GroupNumber_3")
    5243                      .dwattr $C$DW$582, DW_AT_const_value(0x02)
    5244              
    5245              $C$DW$583       .dwtag  DW_TAG_enumerator
    5246                      .dwattr $C$DW$583, DW_AT_name("PIE_GroupNumber_4")
    5247                      .dwattr $C$DW$583, DW_AT_const_value(0x03)
    5248              
    5249              $C$DW$584       .dwtag  DW_TAG_enumerator
    5250                      .dwattr $C$DW$584, DW_AT_name("PIE_GroupNumber_5")
    5251                      .dwattr $C$DW$584, DW_AT_const_value(0x04)
    5252              
    5253              $C$DW$585       .dwtag  DW_TAG_enumerator
    5254                      .dwattr $C$DW$585, DW_AT_name("PIE_GroupNumber_6")
    5255                      .dwattr $C$DW$585, DW_AT_const_value(0x05)
    5256              
    5257              $C$DW$586       .dwtag  DW_TAG_enumerator
    5258                      .dwattr $C$DW$586, DW_AT_name("PIE_GroupNumber_7")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  103

    5259                      .dwattr $C$DW$586, DW_AT_const_value(0x06)
    5260              
    5261              $C$DW$587       .dwtag  DW_TAG_enumerator
    5262                      .dwattr $C$DW$587, DW_AT_name("PIE_GroupNumber_8")
    5263                      .dwattr $C$DW$587, DW_AT_const_value(0x07)
    5264              
    5265              $C$DW$588       .dwtag  DW_TAG_enumerator
    5266                      .dwattr $C$DW$588, DW_AT_name("PIE_GroupNumber_9")
    5267                      .dwattr $C$DW$588, DW_AT_const_value(0x08)
    5268              
    5269              $C$DW$589       .dwtag  DW_TAG_enumerator
    5270                      .dwattr $C$DW$589, DW_AT_name("PIE_GroupNumber_10")
    5271                      .dwattr $C$DW$589, DW_AT_const_value(0x09)
    5272              
    5273              $C$DW$590       .dwtag  DW_TAG_enumerator
    5274                      .dwattr $C$DW$590, DW_AT_name("PIE_GroupNumber_11")
    5275                      .dwattr $C$DW$590, DW_AT_const_value(0x0a)
    5276              
    5277              $C$DW$591       .dwtag  DW_TAG_enumerator
    5278                      .dwattr $C$DW$591, DW_AT_name("PIE_GroupNumber_12")
    5279                      .dwattr $C$DW$591, DW_AT_const_value(0x0b)
    5280              
    5281                      .dwendtag $C$DW$T$218
    5282              
    5283              $C$DW$T$219     .dwtag  DW_TAG_typedef
    5284                      .dwattr $C$DW$T$219, DW_AT_name("PIE_GroupNumber_e")
    5285                      .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$218)
    5286                      .dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
    5287              
    5288              
    5289              $C$DW$T$221     .dwtag  DW_TAG_enumeration_type
    5290                      .dwattr $C$DW$T$221, DW_AT_byte_size(0x01)
    5291              $C$DW$592       .dwtag  DW_TAG_enumerator
    5292                      .dwattr $C$DW$592, DW_AT_name("CTRL_Type_PID_spd")
    5293                      .dwattr $C$DW$592, DW_AT_const_value(0x00)
    5294              
    5295              $C$DW$593       .dwtag  DW_TAG_enumerator
    5296                      .dwattr $C$DW$593, DW_AT_name("CTRL_Type_PID_Id")
    5297                      .dwattr $C$DW$593, DW_AT_const_value(0x01)
    5298              
    5299              $C$DW$594       .dwtag  DW_TAG_enumerator
    5300                      .dwattr $C$DW$594, DW_AT_name("CTRL_Type_PID_Iq")
    5301                      .dwattr $C$DW$594, DW_AT_const_value(0x02)
    5302              
    5303                      .dwendtag $C$DW$T$221
    5304              
    5305              $C$DW$T$222     .dwtag  DW_TAG_typedef
    5306                      .dwattr $C$DW$T$222, DW_AT_name("CTRL_Type_e")
    5307                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    5308                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    5309              
    5310              
    5311              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    5312                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    5313              $C$DW$595       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  104

    5314                      .dwattr $C$DW$595, DW_AT_name("HAL_SensorType_Current")
    5315                      .dwattr $C$DW$595, DW_AT_const_value(0x00)
    5316              
    5317              $C$DW$596       .dwtag  DW_TAG_enumerator
    5318                      .dwattr $C$DW$596, DW_AT_name("HAL_SensorType_Voltage")
    5319                      .dwattr $C$DW$596, DW_AT_const_value(0x01)
    5320              
    5321                      .dwendtag $C$DW$T$224
    5322              
    5323              $C$DW$T$225     .dwtag  DW_TAG_typedef
    5324                      .dwattr $C$DW$T$225, DW_AT_name("HAL_SensorType_e")
    5325                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    5326                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    5327              
    5328              
    5329              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5330                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    5331                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    5332              $C$DW$597       .dwtag  DW_TAG_member
    5333                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$24)
    5334                      .dwattr $C$DW$597, DW_AT_name("ADCRESULT")
    5335                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_ADCRESULT")
    5336                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5337                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    5338              
    5339              $C$DW$598       .dwtag  DW_TAG_member
    5340                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$25)
    5341                      .dwattr $C$DW$598, DW_AT_name("resvd_1")
    5342                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_resvd_1")
    5343                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5344                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    5345              
    5346              $C$DW$599       .dwtag  DW_TAG_member
    5347                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$23)
    5348                      .dwattr $C$DW$599, DW_AT_name("ADCCTL1")
    5349                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_ADCCTL1")
    5350                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    5351                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    5352              
    5353              $C$DW$600       .dwtag  DW_TAG_member
    5354                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$23)
    5355                      .dwattr $C$DW$600, DW_AT_name("ADCCTL2")
    5356                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_ADCCTL2")
    5357                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    5358                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    5359              
    5360              $C$DW$601       .dwtag  DW_TAG_member
    5361                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$26)
    5362                      .dwattr $C$DW$601, DW_AT_name("rsvd_2")
    5363                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_rsvd_2")
    5364                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    5365                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    5366              
    5367              $C$DW$602       .dwtag  DW_TAG_member
    5368                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  105

    5369                      .dwattr $C$DW$602, DW_AT_name("ADCINTFLG")
    5370                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_ADCINTFLG")
    5371                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    5372                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    5373              
    5374              $C$DW$603       .dwtag  DW_TAG_member
    5375                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$23)
    5376                      .dwattr $C$DW$603, DW_AT_name("ADCINTFLGCLR")
    5377                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    5378                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    5379                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    5380              
    5381              $C$DW$604       .dwtag  DW_TAG_member
    5382                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$23)
    5383                      .dwattr $C$DW$604, DW_AT_name("ADCINTOVF")
    5384                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_ADCINTOVF")
    5385                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    5386                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    5387              
    5388              $C$DW$605       .dwtag  DW_TAG_member
    5389                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$23)
    5390                      .dwattr $C$DW$605, DW_AT_name("ADCINTOVFCLR")
    5391                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    5392                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    5393                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    5394              
    5395              $C$DW$606       .dwtag  DW_TAG_member
    5396                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$27)
    5397                      .dwattr $C$DW$606, DW_AT_name("INTSELxNy")
    5398                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_INTSELxNy")
    5399                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    5400                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    5401              
    5402              $C$DW$607       .dwtag  DW_TAG_member
    5403                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$28)
    5404                      .dwattr $C$DW$607, DW_AT_name("rsvd_3")
    5405                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_rsvd_3")
    5406                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    5407                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    5408              
    5409              $C$DW$608       .dwtag  DW_TAG_member
    5410                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$23)
    5411                      .dwattr $C$DW$608, DW_AT_name("SOCPRICTRL")
    5412                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_SOCPRICTRL")
    5413                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    5414                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    5415              
    5416              $C$DW$609       .dwtag  DW_TAG_member
    5417                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$23)
    5418                      .dwattr $C$DW$609, DW_AT_name("rsvd_4")
    5419                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_rsvd_4")
    5420                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    5421                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    5422              
    5423              $C$DW$610       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  106

    5424                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$23)
    5425                      .dwattr $C$DW$610, DW_AT_name("ADCSAMPLEMODE")
    5426                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    5427                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    5428                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    5429              
    5430              $C$DW$611       .dwtag  DW_TAG_member
    5431                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$23)
    5432                      .dwattr $C$DW$611, DW_AT_name("rsvd_5")
    5433                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_rsvd_5")
    5434                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    5435                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    5436              
    5437              $C$DW$612       .dwtag  DW_TAG_member
    5438                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$23)
    5439                      .dwattr $C$DW$612, DW_AT_name("ADCINTSOCSEL1")
    5440                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    5441                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    5442                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    5443              
    5444              $C$DW$613       .dwtag  DW_TAG_member
    5445                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$23)
    5446                      .dwattr $C$DW$613, DW_AT_name("ADCINTSOCSEL2")
    5447                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    5448                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    5449                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    5450              
    5451              $C$DW$614       .dwtag  DW_TAG_member
    5452                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$26)
    5453                      .dwattr $C$DW$614, DW_AT_name("rsvd_6")
    5454                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_rsvd_6")
    5455                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    5456                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    5457              
    5458              $C$DW$615       .dwtag  DW_TAG_member
    5459                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$23)
    5460                      .dwattr $C$DW$615, DW_AT_name("ADCSOCFLG1")
    5461                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    5462                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    5463                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    5464              
    5465              $C$DW$616       .dwtag  DW_TAG_member
    5466                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$23)
    5467                      .dwattr $C$DW$616, DW_AT_name("rsvd_7")
    5468                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_rsvd_7")
    5469                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    5470                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    5471              
    5472              $C$DW$617       .dwtag  DW_TAG_member
    5473                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$23)
    5474                      .dwattr $C$DW$617, DW_AT_name("ADCSOCFRC1")
    5475                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    5476                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    5477                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    5478              
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  107

    5479              $C$DW$618       .dwtag  DW_TAG_member
    5480                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$23)
    5481                      .dwattr $C$DW$618, DW_AT_name("rsvd_8")
    5482                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_rsvd_8")
    5483                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    5484                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    5485              
    5486              $C$DW$619       .dwtag  DW_TAG_member
    5487                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$23)
    5488                      .dwattr $C$DW$619, DW_AT_name("ADCSOCOVF1")
    5489                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    5490                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    5491                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    5492              
    5493              $C$DW$620       .dwtag  DW_TAG_member
    5494                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$23)
    5495                      .dwattr $C$DW$620, DW_AT_name("rsvd_9")
    5496                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_rsvd_9")
    5497                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    5498                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    5499              
    5500              $C$DW$621       .dwtag  DW_TAG_member
    5501                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$23)
    5502                      .dwattr $C$DW$621, DW_AT_name("ADCSOCOVFCLR1")
    5503                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5504                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    5505                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    5506              
    5507              $C$DW$622       .dwtag  DW_TAG_member
    5508                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$23)
    5509                      .dwattr $C$DW$622, DW_AT_name("rsvd_10")
    5510                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_rsvd_10")
    5511                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5512                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    5513              
    5514              $C$DW$623       .dwtag  DW_TAG_member
    5515                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$24)
    5516                      .dwattr $C$DW$623, DW_AT_name("ADCSOCxCTL")
    5517                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5518                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    5519                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    5520              
    5521              $C$DW$624       .dwtag  DW_TAG_member
    5522                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$24)
    5523                      .dwattr $C$DW$624, DW_AT_name("rsvd_11")
    5524                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_rsvd_11")
    5525                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    5526                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    5527              
    5528              $C$DW$625       .dwtag  DW_TAG_member
    5529                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$23)
    5530                      .dwattr $C$DW$625, DW_AT_name("ADCREFTRIM")
    5531                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5532                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5533                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  108

    5534              
    5535              $C$DW$626       .dwtag  DW_TAG_member
    5536                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$23)
    5537                      .dwattr $C$DW$626, DW_AT_name("ADCOFFTRIM")
    5538                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5539                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5540                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    5541              
    5542              $C$DW$627       .dwtag  DW_TAG_member
    5543                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$29)
    5544                      .dwattr $C$DW$627, DW_AT_name("resvd_12")
    5545                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_resvd_12")
    5546                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    5547                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    5548              
    5549              $C$DW$628       .dwtag  DW_TAG_member
    5550                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$23)
    5551                      .dwattr $C$DW$628, DW_AT_name("ADCREV")
    5552                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_ADCREV")
    5553                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    5554                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    5555              
    5556                      .dwendtag $C$DW$T$30
    5557              
    5558              $C$DW$T$227     .dwtag  DW_TAG_typedef
    5559                      .dwattr $C$DW$T$227, DW_AT_name("ADC_Obj")
    5560                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$30)
    5561                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    5562              
    5563              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
    5564                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$30)
    5565                      .dwattr $C$DW$T$116, DW_AT_address_class(0x20)
    5566              
    5567              $C$DW$T$117     .dwtag  DW_TAG_typedef
    5568                      .dwattr $C$DW$T$117, DW_AT_name("ADC_Handle")
    5569                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    5570                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    5571              
    5572              
    5573              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5574                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    5575                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    5576              $C$DW$629       .dwtag  DW_TAG_member
    5577                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$31)
    5578                      .dwattr $C$DW$629, DW_AT_name("alpha_sf")
    5579                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_alpha_sf")
    5580                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5581                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    5582              
    5583              $C$DW$630       .dwtag  DW_TAG_member
    5584                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$31)
    5585                      .dwattr $C$DW$630, DW_AT_name("beta_sf")
    5586                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_beta_sf")
    5587                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5588                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  109

    5589              
    5590              $C$DW$631       .dwtag  DW_TAG_member
    5591                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$32)
    5592                      .dwattr $C$DW$631, DW_AT_name("numSensors")
    5593                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_numSensors")
    5594                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5595                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    5596              
    5597                      .dwendtag $C$DW$T$33
    5598              
    5599              $C$DW$T$44      .dwtag  DW_TAG_typedef
    5600                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    5601                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    5602                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5603              
    5604              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    5605                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    5606                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    5607              
    5608              $C$DW$T$43      .dwtag  DW_TAG_typedef
    5609                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    5610                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5611                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5612              
    5613              
    5614              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5615                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    5616                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    5617              $C$DW$632       .dwtag  DW_TAG_member
    5618                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$23)
    5619                      .dwattr $C$DW$632, DW_AT_name("XCLK")
    5620                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_XCLK")
    5621                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5622                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    5623              
    5624              $C$DW$633       .dwtag  DW_TAG_member
    5625                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$23)
    5626                      .dwattr $C$DW$633, DW_AT_name("rsvd_1")
    5627                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_rsvd_1")
    5628                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5629                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    5630              
    5631              $C$DW$634       .dwtag  DW_TAG_member
    5632                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$23)
    5633                      .dwattr $C$DW$634, DW_AT_name("CLKCTL")
    5634                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_CLKCTL")
    5635                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5636                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    5637              
    5638              $C$DW$635       .dwtag  DW_TAG_member
    5639                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$34)
    5640                      .dwattr $C$DW$635, DW_AT_name("rsvd_2")
    5641                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_rsvd_2")
    5642                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5643                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  110

    5644              
    5645              $C$DW$636       .dwtag  DW_TAG_member
    5646                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$23)
    5647                      .dwattr $C$DW$636, DW_AT_name("LOSPCP")
    5648                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_LOSPCP")
    5649                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5650                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    5651              
    5652              $C$DW$637       .dwtag  DW_TAG_member
    5653                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$23)
    5654                      .dwattr $C$DW$637, DW_AT_name("PCLKCR0")
    5655                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_PCLKCR0")
    5656                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5657                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    5658              
    5659              $C$DW$638       .dwtag  DW_TAG_member
    5660                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$23)
    5661                      .dwattr $C$DW$638, DW_AT_name("PCLKCR1")
    5662                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_PCLKCR1")
    5663                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5664                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    5665              
    5666              $C$DW$639       .dwtag  DW_TAG_member
    5667                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$26)
    5668                      .dwattr $C$DW$639, DW_AT_name("rsvd_3")
    5669                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_rsvd_3")
    5670                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5671                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    5672              
    5673              $C$DW$640       .dwtag  DW_TAG_member
    5674                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$23)
    5675                      .dwattr $C$DW$640, DW_AT_name("PCLKCR3")
    5676                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_PCLKCR3")
    5677                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5678                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    5679              
    5680                      .dwendtag $C$DW$T$35
    5681              
    5682              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    5683                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$35)
    5684                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
    5685              
    5686              $C$DW$T$119     .dwtag  DW_TAG_typedef
    5687                      .dwattr $C$DW$T$119, DW_AT_name("CLK_Handle")
    5688                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    5689                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    5690              
    5691              
    5692              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5693                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    5694                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    5695              $C$DW$641       .dwtag  DW_TAG_member
    5696                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$32)
    5697                      .dwattr $C$DW$641, DW_AT_name("tmp")
    5698                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_tmp")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  111

    5699                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5700                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    5701              
    5702                      .dwendtag $C$DW$T$36
    5703              
    5704              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    5705                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$36)
    5706                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    5707              
    5708              $C$DW$T$121     .dwtag  DW_TAG_typedef
    5709                      .dwattr $C$DW$T$121, DW_AT_name("CPU_Handle")
    5710                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    5711                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    5712              
    5713              
    5714              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    5715                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    5716                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    5717              $C$DW$642       .dwtag  DW_TAG_member
    5718                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$37)
    5719                      .dwattr $C$DW$642, DW_AT_name("version")
    5720                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_version")
    5721                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5722                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    5723              
    5724              $C$DW$643       .dwtag  DW_TAG_member
    5725                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$39)
    5726                      .dwattr $C$DW$643, DW_AT_name("state")
    5727                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_state")
    5728                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5729                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    5730              
    5731              $C$DW$644       .dwtag  DW_TAG_member
    5732                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$39)
    5733                      .dwattr $C$DW$644, DW_AT_name("prevState")
    5734                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_prevState")
    5735                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5736                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    5737              
    5738              $C$DW$645       .dwtag  DW_TAG_member
    5739                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$41)
    5740                      .dwattr $C$DW$645, DW_AT_name("errorCode")
    5741                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_errorCode")
    5742                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5743                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    5744              
    5745              $C$DW$646       .dwtag  DW_TAG_member
    5746                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$43)
    5747                      .dwattr $C$DW$646, DW_AT_name("clarkeHandle_I")
    5748                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_clarkeHandle_I")
    5749                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5750                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    5751              
    5752              $C$DW$647       .dwtag  DW_TAG_member
    5753                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$44)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  112

    5754                      .dwattr $C$DW$647, DW_AT_name("clarke_I")
    5755                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_clarke_I")
    5756                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5757                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    5758              
    5759              $C$DW$648       .dwtag  DW_TAG_member
    5760                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$43)
    5761                      .dwattr $C$DW$648, DW_AT_name("clarkeHandle_V")
    5762                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_clarkeHandle_V")
    5763                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5764                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    5765              
    5766              $C$DW$649       .dwtag  DW_TAG_member
    5767                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$44)
    5768                      .dwattr $C$DW$649, DW_AT_name("clarke_V")
    5769                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_clarke_V")
    5770                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5771                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    5772              
    5773              $C$DW$650       .dwtag  DW_TAG_member
    5774                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$46)
    5775                      .dwattr $C$DW$650, DW_AT_name("estHandle")
    5776                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_estHandle")
    5777                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5778                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    5779              
    5780              $C$DW$651       .dwtag  DW_TAG_member
    5781                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$48)
    5782                      .dwattr $C$DW$651, DW_AT_name("parkHandle")
    5783                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_parkHandle")
    5784                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5785                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    5786              
    5787              $C$DW$652       .dwtag  DW_TAG_member
    5788                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$49)
    5789                      .dwattr $C$DW$652, DW_AT_name("park")
    5790                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_park")
    5791                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5792                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    5793              
    5794              $C$DW$653       .dwtag  DW_TAG_member
    5795                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$51)
    5796                      .dwattr $C$DW$653, DW_AT_name("pidHandle_Id")
    5797                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_pidHandle_Id")
    5798                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5799                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    5800              
    5801              $C$DW$654       .dwtag  DW_TAG_member
    5802                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$52)
    5803                      .dwattr $C$DW$654, DW_AT_name("pid_Id")
    5804                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_pid_Id")
    5805                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5806                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    5807              
    5808              $C$DW$655       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  113

    5809                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$51)
    5810                      .dwattr $C$DW$655, DW_AT_name("pidHandle_Iq")
    5811                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_pidHandle_Iq")
    5812                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5813                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    5814              
    5815              $C$DW$656       .dwtag  DW_TAG_member
    5816                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$52)
    5817                      .dwattr $C$DW$656, DW_AT_name("pid_Iq")
    5818                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_pid_Iq")
    5819                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5820                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    5821              
    5822              $C$DW$657       .dwtag  DW_TAG_member
    5823                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$51)
    5824                      .dwattr $C$DW$657, DW_AT_name("pidHandle_spd")
    5825                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_pidHandle_spd")
    5826                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5827                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    5828              
    5829              $C$DW$658       .dwtag  DW_TAG_member
    5830                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$52)
    5831                      .dwattr $C$DW$658, DW_AT_name("pid_spd")
    5832                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_pid_spd")
    5833                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5834                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5835              
    5836              $C$DW$659       .dwtag  DW_TAG_member
    5837                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$54)
    5838                      .dwattr $C$DW$659, DW_AT_name("iparkHandle")
    5839                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_iparkHandle")
    5840                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    5841                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5842              
    5843              $C$DW$660       .dwtag  DW_TAG_member
    5844                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$55)
    5845                      .dwattr $C$DW$660, DW_AT_name("ipark")
    5846                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_ipark")
    5847                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5848                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5849              
    5850              $C$DW$661       .dwtag  DW_TAG_member
    5851                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$57)
    5852                      .dwattr $C$DW$661, DW_AT_name("svgenHandle")
    5853                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_svgenHandle")
    5854                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5855                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5856              
    5857              $C$DW$662       .dwtag  DW_TAG_member
    5858                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$58)
    5859                      .dwattr $C$DW$662, DW_AT_name("svgen")
    5860                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_svgen")
    5861                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5862                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    5863              
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  114

    5864              $C$DW$663       .dwtag  DW_TAG_member
    5865                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$60)
    5866                      .dwattr $C$DW$663, DW_AT_name("trajHandle_Id")
    5867                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_trajHandle_Id")
    5868                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5869                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    5870              
    5871              $C$DW$664       .dwtag  DW_TAG_member
    5872                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$61)
    5873                      .dwattr $C$DW$664, DW_AT_name("traj_Id")
    5874                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_traj_Id")
    5875                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    5876                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5877              
    5878              $C$DW$665       .dwtag  DW_TAG_member
    5879                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$60)
    5880                      .dwattr $C$DW$665, DW_AT_name("trajHandle_spd")
    5881                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_trajHandle_spd")
    5882                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    5883                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5884              
    5885              $C$DW$666       .dwtag  DW_TAG_member
    5886                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$61)
    5887                      .dwattr $C$DW$666, DW_AT_name("traj_spd")
    5888                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_traj_spd")
    5889                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    5890                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5891              
    5892              $C$DW$667       .dwtag  DW_TAG_member
    5893                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$60)
    5894                      .dwattr $C$DW$667, DW_AT_name("trajHandle_spdMax")
    5895                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    5896                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5897                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5898              
    5899              $C$DW$668       .dwtag  DW_TAG_member
    5900                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$61)
    5901                      .dwattr $C$DW$668, DW_AT_name("traj_spdMax")
    5902                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_traj_spdMax")
    5903                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5904                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5905              
    5906              $C$DW$669       .dwtag  DW_TAG_member
    5907                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$62)
    5908                      .dwattr $C$DW$669, DW_AT_name("motorParams")
    5909                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_motorParams")
    5910                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    5911                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5912              
    5913              $C$DW$670       .dwtag  DW_TAG_member
    5914                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$65)
    5915                      .dwattr $C$DW$670, DW_AT_name("waitTimes")
    5916                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_waitTimes")
    5917                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5918                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  115

    5919              
    5920              $C$DW$671       .dwtag  DW_TAG_member
    5921                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$64)
    5922                      .dwattr $C$DW$671, DW_AT_name("counter_state")
    5923                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_counter_state")
    5924                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    5925                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    5926              
    5927              $C$DW$672       .dwtag  DW_TAG_member
    5928                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$66)
    5929                      .dwattr $C$DW$672, DW_AT_name("numIsrTicksPerCtrlTick")
    5930                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    5931                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    5932                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5933              
    5934              $C$DW$673       .dwtag  DW_TAG_member
    5935                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$66)
    5936                      .dwattr $C$DW$673, DW_AT_name("numCtrlTicksPerCurrentTick")
    5937                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    5938                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    5939                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5940              
    5941              $C$DW$674       .dwtag  DW_TAG_member
    5942                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$66)
    5943                      .dwattr $C$DW$674, DW_AT_name("numCtrlTicksPerSpeedTick")
    5944                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    5945                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    5946                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5947              
    5948              $C$DW$675       .dwtag  DW_TAG_member
    5949                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$66)
    5950                      .dwattr $C$DW$675, DW_AT_name("numCtrlTicksPerTrajTick")
    5951                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    5952                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    5953                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5954              
    5955              $C$DW$676       .dwtag  DW_TAG_member
    5956                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$64)
    5957                      .dwattr $C$DW$676, DW_AT_name("ctrlFreq_Hz")
    5958                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    5959                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5960                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5961              
    5962              $C$DW$677       .dwtag  DW_TAG_member
    5963                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$64)
    5964                      .dwattr $C$DW$677, DW_AT_name("trajFreq_Hz")
    5965                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_trajFreq_Hz")
    5966                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    5967                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5968              
    5969              $C$DW$678       .dwtag  DW_TAG_member
    5970                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$31)
    5971                      .dwattr $C$DW$678, DW_AT_name("trajPeriod_sec")
    5972                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_trajPeriod_sec")
    5973                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  116

    5974                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5975              
    5976              $C$DW$679       .dwtag  DW_TAG_member
    5977                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$67)
    5978                      .dwattr $C$DW$679, DW_AT_name("ctrlPeriod_sec")
    5979                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    5980                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    5981                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5982              
    5983              $C$DW$680       .dwtag  DW_TAG_member
    5984                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$31)
    5985                      .dwattr $C$DW$680, DW_AT_name("maxVsMag_pu")
    5986                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_maxVsMag_pu")
    5987                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    5988                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5989              
    5990              $C$DW$681       .dwtag  DW_TAG_member
    5991                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$68)
    5992                      .dwattr $C$DW$681, DW_AT_name("Iab_in")
    5993                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_Iab_in")
    5994                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    5995                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5996              
    5997              $C$DW$682       .dwtag  DW_TAG_member
    5998                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$68)
    5999                      .dwattr $C$DW$682, DW_AT_name("Iab_filt")
    6000                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_Iab_filt")
    6001                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6002                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6003              
    6004              $C$DW$683       .dwtag  DW_TAG_member
    6005                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$68)
    6006                      .dwattr $C$DW$683, DW_AT_name("Idq_in")
    6007                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_Idq_in")
    6008                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6009                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6010              
    6011              $C$DW$684       .dwtag  DW_TAG_member
    6012                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$68)
    6013                      .dwattr $C$DW$684, DW_AT_name("Vab_in")
    6014                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_Vab_in")
    6015                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6016                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6017              
    6018              $C$DW$685       .dwtag  DW_TAG_member
    6019                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$31)
    6020                      .dwattr $C$DW$685, DW_AT_name("spd_out")
    6021                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_spd_out")
    6022                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6023                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6024              
    6025              $C$DW$686       .dwtag  DW_TAG_member
    6026                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$68)
    6027                      .dwattr $C$DW$686, DW_AT_name("Vab_out")
    6028                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_Vab_out")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  117

    6029                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6030                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6031              
    6032              $C$DW$687       .dwtag  DW_TAG_member
    6033                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$68)
    6034                      .dwattr $C$DW$687, DW_AT_name("Vdq_out")
    6035                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_Vdq_out")
    6036                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6037                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6038              
    6039              $C$DW$688       .dwtag  DW_TAG_member
    6040                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$67)
    6041                      .dwattr $C$DW$688, DW_AT_name("Rhf")
    6042                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_Rhf")
    6043                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6044                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6045              
    6046              $C$DW$689       .dwtag  DW_TAG_member
    6047                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$67)
    6048                      .dwattr $C$DW$689, DW_AT_name("Lhf")
    6049                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_Lhf")
    6050                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6051                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6052              
    6053              $C$DW$690       .dwtag  DW_TAG_member
    6054                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$67)
    6055                      .dwattr $C$DW$690, DW_AT_name("RoverL")
    6056                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_RoverL")
    6057                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6058                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6059              
    6060              $C$DW$691       .dwtag  DW_TAG_member
    6061                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$31)
    6062                      .dwattr $C$DW$691, DW_AT_name("Kp_Id")
    6063                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_Kp_Id")
    6064                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6065                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6066              
    6067              $C$DW$692       .dwtag  DW_TAG_member
    6068                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$31)
    6069                      .dwattr $C$DW$692, DW_AT_name("Kp_Iq")
    6070                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Kp_Iq")
    6071                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6072                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6073              
    6074              $C$DW$693       .dwtag  DW_TAG_member
    6075                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$31)
    6076                      .dwattr $C$DW$693, DW_AT_name("Kp_spd")
    6077                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_Kp_spd")
    6078                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6079                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6080              
    6081              $C$DW$694       .dwtag  DW_TAG_member
    6082                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$31)
    6083                      .dwattr $C$DW$694, DW_AT_name("Ki_Id")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  118

    6084                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_Ki_Id")
    6085                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6086                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6087              
    6088              $C$DW$695       .dwtag  DW_TAG_member
    6089                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$31)
    6090                      .dwattr $C$DW$695, DW_AT_name("Ki_Iq")
    6091                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_Ki_Iq")
    6092                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6093                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6094              
    6095              $C$DW$696       .dwtag  DW_TAG_member
    6096                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$31)
    6097                      .dwattr $C$DW$696, DW_AT_name("Ki_spd")
    6098                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_Ki_spd")
    6099                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6100                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6101              
    6102              $C$DW$697       .dwtag  DW_TAG_member
    6103                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$31)
    6104                      .dwattr $C$DW$697, DW_AT_name("Kd_Id")
    6105                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Kd_Id")
    6106                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6107                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6108              
    6109              $C$DW$698       .dwtag  DW_TAG_member
    6110                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$31)
    6111                      .dwattr $C$DW$698, DW_AT_name("Kd_Iq")
    6112                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_Kd_Iq")
    6113                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6114                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6115              
    6116              $C$DW$699       .dwtag  DW_TAG_member
    6117                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$31)
    6118                      .dwattr $C$DW$699, DW_AT_name("Kd_spd")
    6119                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_Kd_spd")
    6120                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6121                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6122              
    6123              $C$DW$700       .dwtag  DW_TAG_member
    6124                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$31)
    6125                      .dwattr $C$DW$700, DW_AT_name("Ui_Id")
    6126                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_Ui_Id")
    6127                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6128                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6129              
    6130              $C$DW$701       .dwtag  DW_TAG_member
    6131                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$31)
    6132                      .dwattr $C$DW$701, DW_AT_name("Ui_Iq")
    6133                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_Ui_Iq")
    6134                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6135                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6136              
    6137              $C$DW$702       .dwtag  DW_TAG_member
    6138                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  119

    6139                      .dwattr $C$DW$702, DW_AT_name("Ui_spd")
    6140                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_Ui_spd")
    6141                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6142                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6143              
    6144              $C$DW$703       .dwtag  DW_TAG_member
    6145                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$68)
    6146                      .dwattr $C$DW$703, DW_AT_name("Idq_ref")
    6147                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_Idq_ref")
    6148                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6149                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6150              
    6151              $C$DW$704       .dwtag  DW_TAG_member
    6152                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$31)
    6153                      .dwattr $C$DW$704, DW_AT_name("IdRated")
    6154                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_IdRated")
    6155                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6156                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6157              
    6158              $C$DW$705       .dwtag  DW_TAG_member
    6159                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$31)
    6160                      .dwattr $C$DW$705, DW_AT_name("spd_ref")
    6161                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_spd_ref")
    6162                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6163                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6164              
    6165              $C$DW$706       .dwtag  DW_TAG_member
    6166                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$31)
    6167                      .dwattr $C$DW$706, DW_AT_name("spd_max")
    6168                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_spd_max")
    6169                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6170                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6171              
    6172              $C$DW$707       .dwtag  DW_TAG_member
    6173                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$66)
    6174                      .dwattr $C$DW$707, DW_AT_name("counter_current")
    6175                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_counter_current")
    6176                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6177                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6178              
    6179              $C$DW$708       .dwtag  DW_TAG_member
    6180                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$66)
    6181                      .dwattr $C$DW$708, DW_AT_name("counter_isr")
    6182                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_counter_isr")
    6183                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6184                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6185              
    6186              $C$DW$709       .dwtag  DW_TAG_member
    6187                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$66)
    6188                      .dwattr $C$DW$709, DW_AT_name("counter_speed")
    6189                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_counter_speed")
    6190                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6191                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6192              
    6193              $C$DW$710       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  120

    6194                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$66)
    6195                      .dwattr $C$DW$710, DW_AT_name("counter_traj")
    6196                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_counter_traj")
    6197                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6198                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6199              
    6200              $C$DW$711       .dwtag  DW_TAG_member
    6201                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$69)
    6202                      .dwattr $C$DW$711, DW_AT_name("flag_enableCtrl")
    6203                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6204                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6205                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6206              
    6207              $C$DW$712       .dwtag  DW_TAG_member
    6208                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$69)
    6209                      .dwattr $C$DW$712, DW_AT_name("flag_enableDcBusComp")
    6210                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6211                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6212                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6213              
    6214              $C$DW$713       .dwtag  DW_TAG_member
    6215                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$69)
    6216                      .dwattr $C$DW$713, DW_AT_name("flag_enablePowerWarp")
    6217                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6218                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6219                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6220              
    6221              $C$DW$714       .dwtag  DW_TAG_member
    6222                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$69)
    6223                      .dwattr $C$DW$714, DW_AT_name("flag_enableOffset")
    6224                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_flag_enableOffset")
    6225                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6226                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6227              
    6228              $C$DW$715       .dwtag  DW_TAG_member
    6229                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$69)
    6230                      .dwattr $C$DW$715, DW_AT_name("flag_enableSpeedCtrl")
    6231                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6232                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6233                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6234              
    6235              $C$DW$716       .dwtag  DW_TAG_member
    6236                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$69)
    6237                      .dwattr $C$DW$716, DW_AT_name("flag_enableUserMotorParams")
    6238                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6239                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6240                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6241              
    6242              $C$DW$717       .dwtag  DW_TAG_member
    6243                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$68)
    6244                      .dwattr $C$DW$717, DW_AT_name("Idq_offset_pu")
    6245                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_Idq_offset_pu")
    6246                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6247                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6248              
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  121

    6249              $C$DW$718       .dwtag  DW_TAG_member
    6250                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$68)
    6251                      .dwattr $C$DW$718, DW_AT_name("Vdq_offset_pu")
    6252                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    6253                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6254                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6255              
    6256              $C$DW$719       .dwtag  DW_TAG_member
    6257                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$31)
    6258                      .dwattr $C$DW$719, DW_AT_name("angle_pu")
    6259                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_angle_pu")
    6260                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6261                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6262              
    6263              $C$DW$720       .dwtag  DW_TAG_member
    6264                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$31)
    6265                      .dwattr $C$DW$720, DW_AT_name("speed_ref_pu")
    6266                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_speed_ref_pu")
    6267                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6268                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6269              
    6270              $C$DW$721       .dwtag  DW_TAG_member
    6271                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$31)
    6272                      .dwattr $C$DW$721, DW_AT_name("speed_fb_pu")
    6273                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_speed_fb_pu")
    6274                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    6275                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6276              
    6277              $C$DW$722       .dwtag  DW_TAG_member
    6278                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$31)
    6279                      .dwattr $C$DW$722, DW_AT_name("speed_outMax_pu")
    6280                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_speed_outMax_pu")
    6281                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6282                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6283              
    6284              $C$DW$723       .dwtag  DW_TAG_member
    6285                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$69)
    6286                      .dwattr $C$DW$723, DW_AT_name("flag_enableCurrentCtrl")
    6287                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    6288                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    6289                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6290              
    6291                      .dwendtag $C$DW$T$70
    6292              
    6293              $C$DW$T$228     .dwtag  DW_TAG_typedef
    6294                      .dwattr $C$DW$T$228, DW_AT_name("CTRL_Obj")
    6295                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$70)
    6296                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    6297              
    6298              $C$DW$T$229     .dwtag  DW_TAG_pointer_type
    6299                      .dwattr $C$DW$T$229, DW_AT_type(*$C$DW$T$228)
    6300                      .dwattr $C$DW$T$229, DW_AT_address_class(0x20)
    6301              
    6302              $C$DW$T$199     .dwtag  DW_TAG_pointer_type
    6303                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  122

    6304                      .dwattr $C$DW$T$199, DW_AT_address_class(0x20)
    6305              
    6306              $C$DW$T$200     .dwtag  DW_TAG_typedef
    6307                      .dwattr $C$DW$T$200, DW_AT_name("CTRL_Handle")
    6308                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
    6309                      .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    6310              
    6311              $C$DW$724       .dwtag  DW_TAG_TI_far_type
    6312                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$200)
    6313              
    6314              $C$DW$T$230     .dwtag  DW_TAG_const_type
    6315                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$724)
    6316              
    6317              
    6318              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    6319                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    6320                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    6321              $C$DW$725       .dwtag  DW_TAG_member
    6322                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$22)
    6323                      .dwattr $C$DW$725, DW_AT_name("rsvd")
    6324                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_rsvd")
    6325                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6326                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6327              
    6328              $C$DW$726       .dwtag  DW_TAG_member
    6329                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$72)
    6330                      .dwattr $C$DW$726, DW_AT_name("targetProc")
    6331                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_targetProc")
    6332                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6333                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6334              
    6335              $C$DW$727       .dwtag  DW_TAG_member
    6336                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$22)
    6337                      .dwattr $C$DW$727, DW_AT_name("major")
    6338                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_major")
    6339                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6340                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6341              
    6342              $C$DW$728       .dwtag  DW_TAG_member
    6343                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$22)
    6344                      .dwattr $C$DW$728, DW_AT_name("minor")
    6345                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_minor")
    6346                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6347                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6348              
    6349                      .dwendtag $C$DW$T$73
    6350              
    6351              $C$DW$T$37      .dwtag  DW_TAG_typedef
    6352                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
    6353                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    6354                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    6355              
    6356              $C$DW$T$238     .dwtag  DW_TAG_pointer_type
    6357                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$37)
    6358                      .dwattr $C$DW$T$238, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  123

    6359              
    6360              
    6361              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    6362                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8301_Obj_")
    6363                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    6364              $C$DW$729       .dwtag  DW_TAG_member
    6365                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$75)
    6366                      .dwattr $C$DW$729, DW_AT_name("spiHandle")
    6367                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_spiHandle")
    6368                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6369                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6370              
    6371              $C$DW$730       .dwtag  DW_TAG_member
    6372                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$77)
    6373                      .dwattr $C$DW$730, DW_AT_name("gpioHandle")
    6374                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_gpioHandle")
    6375                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6376                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6377              
    6378              $C$DW$731       .dwtag  DW_TAG_member
    6379                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$79)
    6380                      .dwattr $C$DW$731, DW_AT_name("gpioNumber")
    6381                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_gpioNumber")
    6382                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6383                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6384              
    6385              $C$DW$732       .dwtag  DW_TAG_member
    6386                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$69)
    6387                      .dwattr $C$DW$732, DW_AT_name("RxTimeOut")
    6388                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_RxTimeOut")
    6389                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6390                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6391              
    6392              $C$DW$733       .dwtag  DW_TAG_member
    6393                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$69)
    6394                      .dwattr $C$DW$733, DW_AT_name("enableTimeOut")
    6395                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_enableTimeOut")
    6396                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6397                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6398              
    6399                      .dwendtag $C$DW$T$80
    6400              
    6401              $C$DW$T$149     .dwtag  DW_TAG_typedef
    6402                      .dwattr $C$DW$T$149, DW_AT_name("DRV8301_Obj")
    6403                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$80)
    6404                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    6405              
    6406              $C$DW$T$147     .dwtag  DW_TAG_pointer_type
    6407                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$80)
    6408                      .dwattr $C$DW$T$147, DW_AT_address_class(0x20)
    6409              
    6410              $C$DW$T$148     .dwtag  DW_TAG_typedef
    6411                      .dwattr $C$DW$T$148, DW_AT_name("DRV8301_Handle")
    6412                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
    6413                      .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  124

    6414              
    6415              
    6416              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    6417                      .dwattr $C$DW$T$91, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    6418                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x05)
    6419              $C$DW$734       .dwtag  DW_TAG_member
    6420                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$82)
    6421                      .dwattr $C$DW$734, DW_AT_name("DRV8301_CURRENT")
    6422                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    6423                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6424                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6425              
    6426              $C$DW$735       .dwtag  DW_TAG_member
    6427                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$84)
    6428                      .dwattr $C$DW$735, DW_AT_name("DRV8301_RESET")
    6429                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_DRV8301_RESET")
    6430                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6431                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6432              
    6433              $C$DW$736       .dwtag  DW_TAG_member
    6434                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$86)
    6435                      .dwattr $C$DW$736, DW_AT_name("PWM_MODE")
    6436                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_PWM_MODE")
    6437                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6438                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6439              
    6440              $C$DW$737       .dwtag  DW_TAG_member
    6441                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$88)
    6442                      .dwattr $C$DW$737, DW_AT_name("OC_MODE")
    6443                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_OC_MODE")
    6444                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6445                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6446              
    6447              $C$DW$738       .dwtag  DW_TAG_member
    6448                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$90)
    6449                      .dwattr $C$DW$738, DW_AT_name("OC_ADJ_SET")
    6450                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    6451                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6452                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6453              
    6454                      .dwendtag $C$DW$T$91
    6455              
    6456              $C$DW$T$105     .dwtag  DW_TAG_typedef
    6457                      .dwattr $C$DW$T$105, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    6458                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$91)
    6459                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    6460              
    6461              
    6462              $C$DW$T$100     .dwtag  DW_TAG_structure_type
    6463                      .dwattr $C$DW$T$100, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    6464                      .dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
    6465              $C$DW$739       .dwtag  DW_TAG_member
    6466                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$93)
    6467                      .dwattr $C$DW$739, DW_AT_name("OCTW_SET")
    6468                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_OCTW_SET")
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  125

    6469                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6470                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6471              
    6472              $C$DW$740       .dwtag  DW_TAG_member
    6473                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$95)
    6474                      .dwattr $C$DW$740, DW_AT_name("GAIN")
    6475                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_GAIN")
    6476                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6477                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6478              
    6479              $C$DW$741       .dwtag  DW_TAG_member
    6480                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$97)
    6481                      .dwattr $C$DW$741, DW_AT_name("DC_CAL_CH1p2")
    6482                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    6483                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6484                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    6485              
    6486              $C$DW$742       .dwtag  DW_TAG_member
    6487                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$99)
    6488                      .dwattr $C$DW$742, DW_AT_name("OC_TOFF")
    6489                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_OC_TOFF")
    6490                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6491                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6492              
    6493                      .dwendtag $C$DW$T$100
    6494              
    6495              $C$DW$T$106     .dwtag  DW_TAG_typedef
    6496                      .dwattr $C$DW$T$106, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    6497                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$100)
    6498                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    6499              
    6500              
    6501              $C$DW$T$101     .dwtag  DW_TAG_structure_type
    6502                      .dwattr $C$DW$T$101, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    6503                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x0b)
    6504              $C$DW$743       .dwtag  DW_TAG_member
    6505                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$69)
    6506                      .dwattr $C$DW$743, DW_AT_name("FAULT")
    6507                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_FAULT")
    6508                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6509                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6510              
    6511              $C$DW$744       .dwtag  DW_TAG_member
    6512                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$69)
    6513                      .dwattr $C$DW$744, DW_AT_name("GVDD_UV")
    6514                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_GVDD_UV")
    6515                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6516                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6517              
    6518              $C$DW$745       .dwtag  DW_TAG_member
    6519                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$69)
    6520                      .dwattr $C$DW$745, DW_AT_name("PVDD_UV")
    6521                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_PVDD_UV")
    6522                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6523                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  126

    6524              
    6525              $C$DW$746       .dwtag  DW_TAG_member
    6526                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$69)
    6527                      .dwattr $C$DW$746, DW_AT_name("OTSD")
    6528                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_OTSD")
    6529                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6530                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    6531              
    6532              $C$DW$747       .dwtag  DW_TAG_member
    6533                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$69)
    6534                      .dwattr $C$DW$747, DW_AT_name("OTW")
    6535                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_OTW")
    6536                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6537                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    6538              
    6539              $C$DW$748       .dwtag  DW_TAG_member
    6540                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$69)
    6541                      .dwattr $C$DW$748, DW_AT_name("FETHA_OC")
    6542                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_FETHA_OC")
    6543                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6544                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    6545              
    6546              $C$DW$749       .dwtag  DW_TAG_member
    6547                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$69)
    6548                      .dwattr $C$DW$749, DW_AT_name("FETLA_OC")
    6549                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_FETLA_OC")
    6550                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6551                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    6552              
    6553              $C$DW$750       .dwtag  DW_TAG_member
    6554                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$69)
    6555                      .dwattr $C$DW$750, DW_AT_name("FETHB_OC")
    6556                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_FETHB_OC")
    6557                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6558                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    6559              
    6560              $C$DW$751       .dwtag  DW_TAG_member
    6561                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$69)
    6562                      .dwattr $C$DW$751, DW_AT_name("FETLB_OC")
    6563                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_FETLB_OC")
    6564                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6565                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    6566              
    6567              $C$DW$752       .dwtag  DW_TAG_member
    6568                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$69)
    6569                      .dwattr $C$DW$752, DW_AT_name("FETHC_OC")
    6570                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_FETHC_OC")
    6571                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6572                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    6573              
    6574              $C$DW$753       .dwtag  DW_TAG_member
    6575                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$69)
    6576                      .dwattr $C$DW$753, DW_AT_name("FETLC_OC")
    6577                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_FETLC_OC")
    6578                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v15.12.3 Tue Jan 31 20:38:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0183610                          PAGE  127

    6579                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    6580              
    6581                      .dwendtag $C$DW$T$101
    6582              
    6583              $C$DW$T$103     .dwtag  DW_TAG_typedef
    6584                      .dwattr $C$DW$T$103, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    6585                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$101)
    6586                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    6587              
    6588              
    6589              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    6590                      .dwattr $C$DW$T$102, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    6591                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x02)
    6592              $C$DW$754       .dwtag  DW_TAG_member
    6593                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$69)
    6594                      .dwattr $C$DW$754, DW_AT_name("GVDD_OV")
