TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Fri Mar 17 14:36:28 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DRV8301_setGpioHandle")

   13859                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$1840)
   13860              
   13861              
   13862              $C$DW$T$349     .dwtag  DW_TAG_enumeration_type
   13863                      .dwattr $C$DW$T$349, DW_AT_byte_size(0x01)
   13864              $C$DW$1841      .dwtag  DW_TAG_enumerator
   13865                      .dwattr $C$DW$1841, DW_AT_name("SCI_Mode_IdleLine")
   13866                      .dwattr $C$DW$1841, DW_AT_const_value(0x00)
   13867              
   13868              $C$DW$1842      .dwtag  DW_TAG_enumerator
   13869                      .dwattr $C$DW$1842, DW_AT_name("SCI_Mode_AddressBit")
   13870                      .dwattr $C$DW$1842, DW_AT_const_value(0x08)
   13871              
   13872                      .dwendtag $C$DW$T$349
   13873              
   13874              $C$DW$T$350     .dwtag  DW_TAG_typedef
   13875                      .dwattr $C$DW$T$350, DW_AT_name("SCI_Mode_e")
   13876                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$349)
   13877                      .dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
   13878              
   13879              $C$DW$1843      .dwtag  DW_TAG_TI_far_type
   13880                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$350)
   13881              
   13882              $C$DW$T$351     .dwtag  DW_TAG_const_type
   13883                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$1843)
   13884              
   13885              
   13886              $C$DW$T$352     .dwtag  DW_TAG_enumeration_type
   13887                      .dwattr $C$DW$T$352, DW_AT_byte_size(0x01)
   13888              $C$DW$1844      .dwtag  DW_TAG_enumerator
   13889                      .dwattr $C$DW$1844, DW_AT_name("SCI_NumStopBits_One")
   13890                      .dwattr $C$DW$1844, DW_AT_const_value(0x00)
   13891              
   13892              $C$DW$1845      .dwtag  DW_TAG_enumerator
   13893                      .dwattr $C$DW$1845, DW_AT_name("SCI_NumStopBits_Two")
   13894                      .dwattr $C$DW$1845, DW_AT_const_value(0x80)
   13895              
   13896                      .dwendtag $C$DW$T$352
   13897              
   13898              $C$DW$T$353     .dwtag  DW_TAG_typedef
   13899                      .dwattr $C$DW$T$353, DW_AT_name("SCI_NumStopBits_e")
   13900                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$352)
   13901                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   13902              
   13903              $C$DW$1846      .dwtag  DW_TAG_TI_far_type
   13904                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$353)
   13905              
   13906              $C$DW$T$354     .dwtag  DW_TAG_const_type
   13907                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$1846)
   13908              
   13909              
   13910              $C$DW$T$355     .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  263

   13911                      .dwattr $C$DW$T$355, DW_AT_byte_size(0x01)
   13912              $C$DW$1847      .dwtag  DW_TAG_enumerator
   13913                      .dwattr $C$DW$1847, DW_AT_name("SCI_Parity_Odd")
   13914                      .dwattr $C$DW$1847, DW_AT_const_value(0x00)
   13915              
   13916              $C$DW$1848      .dwtag  DW_TAG_enumerator
   13917                      .dwattr $C$DW$1848, DW_AT_name("SCI_Parity_Even")
   13918                      .dwattr $C$DW$1848, DW_AT_const_value(0x40)
   13919              
   13920                      .dwendtag $C$DW$T$355
   13921              
   13922              $C$DW$T$356     .dwtag  DW_TAG_typedef
   13923                      .dwattr $C$DW$T$356, DW_AT_name("SCI_Parity_e")
   13924                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
   13925                      .dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
   13926              
   13927              $C$DW$1849      .dwtag  DW_TAG_TI_far_type
   13928                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$356)
   13929              
   13930              $C$DW$T$357     .dwtag  DW_TAG_const_type
   13931                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$1849)
   13932              
   13933              
   13934              $C$DW$T$358     .dwtag  DW_TAG_enumeration_type
   13935                      .dwattr $C$DW$T$358, DW_AT_byte_size(0x01)
   13936              $C$DW$1850      .dwtag  DW_TAG_enumerator
   13937                      .dwattr $C$DW$1850, DW_AT_name("HAL_SensorType_Current")
   13938                      .dwattr $C$DW$1850, DW_AT_const_value(0x00)
   13939              
   13940              $C$DW$1851      .dwtag  DW_TAG_enumerator
   13941                      .dwattr $C$DW$1851, DW_AT_name("HAL_SensorType_Voltage")
   13942                      .dwattr $C$DW$1851, DW_AT_const_value(0x01)
   13943              
   13944                      .dwendtag $C$DW$T$358
   13945              
   13946              $C$DW$T$359     .dwtag  DW_TAG_typedef
   13947                      .dwattr $C$DW$T$359, DW_AT_name("HAL_SensorType_e")
   13948                      .dwattr $C$DW$T$359, DW_AT_type(*$C$DW$T$358)
   13949                      .dwattr $C$DW$T$359, DW_AT_language(DW_LANG_C)
   13950              
   13951              
   13952              $C$DW$T$29      .dwtag  DW_TAG_structure_type
   13953                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
   13954                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
   13955              $C$DW$1852      .dwtag  DW_TAG_member
   13956                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$23)
   13957                      .dwattr $C$DW$1852, DW_AT_name("ADCRESULT")
   13958                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_ADCRESULT")
   13959                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13960                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   13961              
   13962              $C$DW$1853      .dwtag  DW_TAG_member
   13963                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$24)
   13964                      .dwattr $C$DW$1853, DW_AT_name("resvd_1")
   13965                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_resvd_1")
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  264

   13966                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13967                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   13968              
   13969              $C$DW$1854      .dwtag  DW_TAG_member
   13970                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$22)
   13971                      .dwattr $C$DW$1854, DW_AT_name("ADCCTL1")
   13972                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_ADCCTL1")
   13973                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   13974                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   13975              
   13976              $C$DW$1855      .dwtag  DW_TAG_member
   13977                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$22)
   13978                      .dwattr $C$DW$1855, DW_AT_name("ADCCTL2")
   13979                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_ADCCTL2")
   13980                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   13981                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   13982              
   13983              $C$DW$1856      .dwtag  DW_TAG_member
   13984                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$25)
   13985                      .dwattr $C$DW$1856, DW_AT_name("rsvd_2")
   13986                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_rsvd_2")
   13987                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   13988                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   13989              
   13990              $C$DW$1857      .dwtag  DW_TAG_member
   13991                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$22)
   13992                      .dwattr $C$DW$1857, DW_AT_name("ADCINTFLG")
   13993                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_ADCINTFLG")
   13994                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   13995                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   13996              
   13997              $C$DW$1858      .dwtag  DW_TAG_member
   13998                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$22)
   13999                      .dwattr $C$DW$1858, DW_AT_name("ADCINTFLGCLR")
   14000                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   14001                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   14002                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   14003              
   14004              $C$DW$1859      .dwtag  DW_TAG_member
   14005                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$22)
   14006                      .dwattr $C$DW$1859, DW_AT_name("ADCINTOVF")
   14007                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_ADCINTOVF")
   14008                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   14009                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   14010              
   14011              $C$DW$1860      .dwtag  DW_TAG_member
   14012                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$22)
   14013                      .dwattr $C$DW$1860, DW_AT_name("ADCINTOVFCLR")
   14014                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   14015                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   14016                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   14017              
   14018              $C$DW$1861      .dwtag  DW_TAG_member
   14019                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$26)
   14020                      .dwattr $C$DW$1861, DW_AT_name("INTSELxNy")
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  265

   14021                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_INTSELxNy")
   14022                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   14023                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   14024              
   14025              $C$DW$1862      .dwtag  DW_TAG_member
   14026                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$27)
   14027                      .dwattr $C$DW$1862, DW_AT_name("rsvd_3")
   14028                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_rsvd_3")
   14029                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   14030                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   14031              
   14032              $C$DW$1863      .dwtag  DW_TAG_member
   14033                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$22)
   14034                      .dwattr $C$DW$1863, DW_AT_name("SOCPRICTRL")
   14035                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_SOCPRICTRL")
   14036                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   14037                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   14038              
   14039              $C$DW$1864      .dwtag  DW_TAG_member
   14040                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$22)
   14041                      .dwattr $C$DW$1864, DW_AT_name("rsvd_4")
   14042                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_rsvd_4")
   14043                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   14044                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   14045              
   14046              $C$DW$1865      .dwtag  DW_TAG_member
   14047                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$22)
   14048                      .dwattr $C$DW$1865, DW_AT_name("ADCSAMPLEMODE")
   14049                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   14050                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   14051                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   14052              
   14053              $C$DW$1866      .dwtag  DW_TAG_member
   14054                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$22)
   14055                      .dwattr $C$DW$1866, DW_AT_name("rsvd_5")
   14056                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_rsvd_5")
   14057                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   14058                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   14059              
   14060              $C$DW$1867      .dwtag  DW_TAG_member
   14061                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$22)
   14062                      .dwattr $C$DW$1867, DW_AT_name("ADCINTSOCSEL1")
   14063                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   14064                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   14065                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   14066              
   14067              $C$DW$1868      .dwtag  DW_TAG_member
   14068                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$22)
   14069                      .dwattr $C$DW$1868, DW_AT_name("ADCINTSOCSEL2")
   14070                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   14071                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   14072                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   14073              
   14074              $C$DW$1869      .dwtag  DW_TAG_member
   14075                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  266

   14076                      .dwattr $C$DW$1869, DW_AT_name("rsvd_6")
   14077                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_rsvd_6")
   14078                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   14079                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   14080              
   14081              $C$DW$1870      .dwtag  DW_TAG_member
   14082                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$22)
   14083                      .dwattr $C$DW$1870, DW_AT_name("ADCSOCFLG1")
   14084                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   14085                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   14086                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   14087              
   14088              $C$DW$1871      .dwtag  DW_TAG_member
   14089                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$22)
   14090                      .dwattr $C$DW$1871, DW_AT_name("rsvd_7")
   14091                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_rsvd_7")
   14092                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   14093                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   14094              
   14095              $C$DW$1872      .dwtag  DW_TAG_member
   14096                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$22)
   14097                      .dwattr $C$DW$1872, DW_AT_name("ADCSOCFRC1")
   14098                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   14099                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   14100                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   14101              
   14102              $C$DW$1873      .dwtag  DW_TAG_member
   14103                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$22)
   14104                      .dwattr $C$DW$1873, DW_AT_name("rsvd_8")
   14105                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_rsvd_8")
   14106                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   14107                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   14108              
   14109              $C$DW$1874      .dwtag  DW_TAG_member
   14110                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$22)
   14111                      .dwattr $C$DW$1874, DW_AT_name("ADCSOCOVF1")
   14112                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   14113                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   14114                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   14115              
   14116              $C$DW$1875      .dwtag  DW_TAG_member
   14117                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$22)
   14118                      .dwattr $C$DW$1875, DW_AT_name("rsvd_9")
   14119                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_rsvd_9")
   14120                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   14121                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   14122              
   14123              $C$DW$1876      .dwtag  DW_TAG_member
   14124                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$22)
   14125                      .dwattr $C$DW$1876, DW_AT_name("ADCSOCOVFCLR1")
   14126                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   14127                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   14128                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   14129              
   14130              $C$DW$1877      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  267

   14131                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$22)
   14132                      .dwattr $C$DW$1877, DW_AT_name("rsvd_10")
   14133                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_rsvd_10")
   14134                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   14135                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   14136              
   14137              $C$DW$1878      .dwtag  DW_TAG_member
   14138                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$23)
   14139                      .dwattr $C$DW$1878, DW_AT_name("ADCSOCxCTL")
   14140                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   14141                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   14142                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   14143              
   14144              $C$DW$1879      .dwtag  DW_TAG_member
   14145                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$23)
   14146                      .dwattr $C$DW$1879, DW_AT_name("rsvd_11")
   14147                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_rsvd_11")
   14148                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   14149                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   14150              
   14151              $C$DW$1880      .dwtag  DW_TAG_member
   14152                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$22)
   14153                      .dwattr $C$DW$1880, DW_AT_name("ADCREFTRIM")
   14154                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_ADCREFTRIM")
   14155                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   14156                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   14157              
   14158              $C$DW$1881      .dwtag  DW_TAG_member
   14159                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$22)
   14160                      .dwattr $C$DW$1881, DW_AT_name("ADCOFFTRIM")
   14161                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   14162                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   14163                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   14164              
   14165              $C$DW$1882      .dwtag  DW_TAG_member
   14166                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$28)
   14167                      .dwattr $C$DW$1882, DW_AT_name("resvd_12")
   14168                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_resvd_12")
   14169                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   14170                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   14171              
   14172              $C$DW$1883      .dwtag  DW_TAG_member
   14173                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$22)
   14174                      .dwattr $C$DW$1883, DW_AT_name("ADCREV")
   14175                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_ADCREV")
   14176                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   14177                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   14178              
   14179                      .dwendtag $C$DW$T$29
   14180              
   14181              $C$DW$T$361     .dwtag  DW_TAG_typedef
   14182                      .dwattr $C$DW$T$361, DW_AT_name("ADC_Obj")
   14183                      .dwattr $C$DW$T$361, DW_AT_type(*$C$DW$T$29)
   14184                      .dwattr $C$DW$T$361, DW_AT_language(DW_LANG_C)
   14185              
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  268

   14186              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
   14187                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$29)
   14188                      .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
   14189              
   14190              $C$DW$T$82      .dwtag  DW_TAG_typedef
   14191                      .dwattr $C$DW$T$82, DW_AT_name("ADC_Handle")
   14192                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
   14193                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   14194              
   14195              
   14196              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   14197                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
   14198                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
   14199              $C$DW$1884      .dwtag  DW_TAG_member
   14200                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$22)
   14201                      .dwattr $C$DW$1884, DW_AT_name("XCLK")
   14202                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_XCLK")
   14203                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14204                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   14205              
   14206              $C$DW$1885      .dwtag  DW_TAG_member
   14207                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$22)
   14208                      .dwattr $C$DW$1885, DW_AT_name("rsvd_1")
   14209                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_rsvd_1")
   14210                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14211                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   14212              
   14213              $C$DW$1886      .dwtag  DW_TAG_member
   14214                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$22)
   14215                      .dwattr $C$DW$1886, DW_AT_name("CLKCTL")
   14216                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_CLKCTL")
   14217                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14218                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   14219              
   14220              $C$DW$1887      .dwtag  DW_TAG_member
   14221                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$30)
   14222                      .dwattr $C$DW$1887, DW_AT_name("rsvd_2")
   14223                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_rsvd_2")
   14224                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14225                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   14226              
   14227              $C$DW$1888      .dwtag  DW_TAG_member
   14228                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$22)
   14229                      .dwattr $C$DW$1888, DW_AT_name("LOSPCP")
   14230                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_LOSPCP")
   14231                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   14232                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   14233              
   14234              $C$DW$1889      .dwtag  DW_TAG_member
   14235                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$22)
   14236                      .dwattr $C$DW$1889, DW_AT_name("PCLKCR0")
   14237                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_PCLKCR0")
   14238                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14239                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   14240              
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  269

   14241              $C$DW$1890      .dwtag  DW_TAG_member
   14242                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$22)
   14243                      .dwattr $C$DW$1890, DW_AT_name("PCLKCR1")
   14244                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_PCLKCR1")
   14245                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   14246                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   14247              
   14248              $C$DW$1891      .dwtag  DW_TAG_member
   14249                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$25)
   14250                      .dwattr $C$DW$1891, DW_AT_name("rsvd_3")
   14251                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_rsvd_3")
   14252                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14253                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   14254              
   14255              $C$DW$1892      .dwtag  DW_TAG_member
   14256                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$22)
   14257                      .dwattr $C$DW$1892, DW_AT_name("PCLKCR3")
   14258                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_PCLKCR3")
   14259                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14260                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   14261              
   14262                      .dwendtag $C$DW$T$31
   14263              
   14264              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
   14265                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$31)
   14266                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
   14267              
   14268              $C$DW$T$84      .dwtag  DW_TAG_typedef
   14269                      .dwattr $C$DW$T$84, DW_AT_name("CLK_Handle")
   14270                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
   14271                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
   14272              
   14273              
   14274              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   14275                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
   14276                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   14277              $C$DW$1893      .dwtag  DW_TAG_member
   14278                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$32)
   14279                      .dwattr $C$DW$1893, DW_AT_name("tmp")
   14280                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_tmp")
   14281                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14282                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   14283              
   14284                      .dwendtag $C$DW$T$33
   14285              
   14286              $C$DW$T$370     .dwtag  DW_TAG_typedef
   14287                      .dwattr $C$DW$T$370, DW_AT_name("CPU_Obj")
   14288                      .dwattr $C$DW$T$370, DW_AT_type(*$C$DW$T$33)
   14289                      .dwattr $C$DW$T$370, DW_AT_language(DW_LANG_C)
   14290              
   14291              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
   14292                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$33)
   14293                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
   14294              
   14295              $C$DW$T$86      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  270

   14296                      .dwattr $C$DW$T$86, DW_AT_name("CPU_Handle")
   14297                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
   14298                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
   14299              
   14300              
   14301              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   14302                      .dwattr $C$DW$T$41, DW_AT_name("_DRV8301_Obj_")
   14303                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
   14304              $C$DW$1894      .dwtag  DW_TAG_member
   14305                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$35)
   14306                      .dwattr $C$DW$1894, DW_AT_name("spiHandle")
   14307                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_spiHandle")
   14308                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14309                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   14310              
   14311              $C$DW$1895      .dwtag  DW_TAG_member
   14312                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$37)
   14313                      .dwattr $C$DW$1895, DW_AT_name("gpioHandle")
   14314                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_gpioHandle")
   14315                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14316                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   14317              
   14318              $C$DW$1896      .dwtag  DW_TAG_member
   14319                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$39)
   14320                      .dwattr $C$DW$1896, DW_AT_name("gpioNumber")
   14321                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_gpioNumber")
   14322                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14323                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   14324              
   14325              $C$DW$1897      .dwtag  DW_TAG_member
   14326                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$40)
   14327                      .dwattr $C$DW$1897, DW_AT_name("RxTimeOut")
   14328                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_RxTimeOut")
   14329                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14330                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   14331              
   14332              $C$DW$1898      .dwtag  DW_TAG_member
   14333                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$40)
   14334                      .dwattr $C$DW$1898, DW_AT_name("enableTimeOut")
   14335                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_enableTimeOut")
   14336                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14337                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   14338              
   14339                      .dwendtag $C$DW$T$41
   14340              
   14341              $C$DW$T$114     .dwtag  DW_TAG_typedef
   14342                      .dwattr $C$DW$T$114, DW_AT_name("DRV8301_Obj")
   14343                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$41)
   14344                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
   14345              
   14346              $C$DW$T$112     .dwtag  DW_TAG_pointer_type
   14347                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$41)
   14348                      .dwattr $C$DW$T$112, DW_AT_address_class(0x20)
   14349              
   14350              $C$DW$T$113     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  271

   14351                      .dwattr $C$DW$T$113, DW_AT_name("DRV8301_Handle")
   14352                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
   14353                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
   14354              
   14355              
   14356              $C$DW$T$52      .dwtag  DW_TAG_structure_type
   14357                      .dwattr $C$DW$T$52, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   14358                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
   14359              $C$DW$1899      .dwtag  DW_TAG_member
   14360                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$43)
   14361                      .dwattr $C$DW$1899, DW_AT_name("DRV8301_CURRENT")
   14362                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   14363                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14364                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   14365              
   14366              $C$DW$1900      .dwtag  DW_TAG_member
   14367                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$45)
   14368                      .dwattr $C$DW$1900, DW_AT_name("DRV8301_RESET")
   14369                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_DRV8301_RESET")
   14370                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14371                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   14372              
   14373              $C$DW$1901      .dwtag  DW_TAG_member
   14374                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$47)
   14375                      .dwattr $C$DW$1901, DW_AT_name("PWM_MODE")
   14376                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_PWM_MODE")
   14377                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14378                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   14379              
   14380              $C$DW$1902      .dwtag  DW_TAG_member
   14381                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$49)
   14382                      .dwattr $C$DW$1902, DW_AT_name("OC_MODE")
   14383                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_OC_MODE")
   14384                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14385                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   14386              
   14387              $C$DW$1903      .dwtag  DW_TAG_member
   14388                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$51)
   14389                      .dwattr $C$DW$1903, DW_AT_name("OC_ADJ_SET")
   14390                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   14391                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14392                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   14393              
   14394                      .dwendtag $C$DW$T$52
   14395              
   14396              $C$DW$T$66      .dwtag  DW_TAG_typedef
   14397                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   14398                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$52)
   14399                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   14400              
   14401              
   14402              $C$DW$T$61      .dwtag  DW_TAG_structure_type
   14403                      .dwattr $C$DW$T$61, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   14404                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
   14405              $C$DW$1904      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  272

   14406                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$54)
   14407                      .dwattr $C$DW$1904, DW_AT_name("OCTW_SET")
   14408                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_OCTW_SET")
   14409                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14410                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   14411              
   14412              $C$DW$1905      .dwtag  DW_TAG_member
   14413                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$56)
   14414                      .dwattr $C$DW$1905, DW_AT_name("GAIN")
   14415                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_GAIN")
   14416                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14417                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   14418              
   14419              $C$DW$1906      .dwtag  DW_TAG_member
   14420                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$58)
   14421                      .dwattr $C$DW$1906, DW_AT_name("DC_CAL_CH1p2")
   14422                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   14423                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14424                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   14425              
   14426              $C$DW$1907      .dwtag  DW_TAG_member
   14427                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$60)
   14428                      .dwattr $C$DW$1907, DW_AT_name("OC_TOFF")
   14429                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_OC_TOFF")
   14430                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14431                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   14432              
   14433                      .dwendtag $C$DW$T$61
   14434              
   14435              $C$DW$T$67      .dwtag  DW_TAG_typedef
   14436                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   14437                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$61)
   14438                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   14439              
   14440              
   14441              $C$DW$T$62      .dwtag  DW_TAG_structure_type
   14442                      .dwattr $C$DW$T$62, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   14443                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x0b)
   14444              $C$DW$1908      .dwtag  DW_TAG_member
   14445                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$40)
   14446                      .dwattr $C$DW$1908, DW_AT_name("FAULT")
   14447                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_FAULT")
   14448                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14449                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   14450              
   14451              $C$DW$1909      .dwtag  DW_TAG_member
   14452                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$40)
   14453                      .dwattr $C$DW$1909, DW_AT_name("GVDD_UV")
   14454                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_GVDD_UV")
   14455                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14456                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   14457              
   14458              $C$DW$1910      .dwtag  DW_TAG_member
   14459                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$40)
   14460                      .dwattr $C$DW$1910, DW_AT_name("PVDD_UV")
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  273

   14461                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_PVDD_UV")
   14462                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14463                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   14464              
   14465              $C$DW$1911      .dwtag  DW_TAG_member
   14466                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$40)
   14467                      .dwattr $C$DW$1911, DW_AT_name("OTSD")
   14468                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_OTSD")
   14469                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14470                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   14471              
   14472              $C$DW$1912      .dwtag  DW_TAG_member
   14473                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$40)
   14474                      .dwattr $C$DW$1912, DW_AT_name("OTW")
   14475                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_OTW")
   14476                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14477                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   14478              
   14479              $C$DW$1913      .dwtag  DW_TAG_member
   14480                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$40)
   14481                      .dwattr $C$DW$1913, DW_AT_name("FETHA_OC")
   14482                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_FETHA_OC")
   14483                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14484                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   14485              
   14486              $C$DW$1914      .dwtag  DW_TAG_member
   14487                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$40)
   14488                      .dwattr $C$DW$1914, DW_AT_name("FETLA_OC")
   14489                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_FETLA_OC")
   14490                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14491                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   14492              
   14493              $C$DW$1915      .dwtag  DW_TAG_member
   14494                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$40)
   14495                      .dwattr $C$DW$1915, DW_AT_name("FETHB_OC")
   14496                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_FETHB_OC")
   14497                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14498                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   14499              
   14500              $C$DW$1916      .dwtag  DW_TAG_member
   14501                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$40)
   14502                      .dwattr $C$DW$1916, DW_AT_name("FETLB_OC")
   14503                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_FETLB_OC")
   14504                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14505                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   14506              
   14507              $C$DW$1917      .dwtag  DW_TAG_member
   14508                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$40)
   14509                      .dwattr $C$DW$1917, DW_AT_name("FETHC_OC")
   14510                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_FETHC_OC")
   14511                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14512                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   14513              
   14514              $C$DW$1918      .dwtag  DW_TAG_member
   14515                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  274

   14516                      .dwattr $C$DW$1918, DW_AT_name("FETLC_OC")
   14517                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_FETLC_OC")
   14518                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14519                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   14520              
   14521                      .dwendtag $C$DW$T$62
   14522              
   14523              $C$DW$T$64      .dwtag  DW_TAG_typedef
   14524                      .dwattr $C$DW$T$64, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   14525                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$62)
   14526                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   14527              
   14528              
   14529              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   14530                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   14531                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x02)
   14532              $C$DW$1919      .dwtag  DW_TAG_member
   14533                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$40)
   14534                      .dwattr $C$DW$1919, DW_AT_name("GVDD_OV")
   14535                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_GVDD_OV")
   14536                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14537                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   14538              
   14539              $C$DW$1920      .dwtag  DW_TAG_member
   14540                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$21)
   14541                      .dwattr $C$DW$1920, DW_AT_name("DeviceID")
   14542                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_DeviceID")
   14543                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14544                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   14545              
   14546                      .dwendtag $C$DW$T$63
   14547              
   14548              $C$DW$T$65      .dwtag  DW_TAG_typedef
   14549                      .dwattr $C$DW$T$65, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   14550                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
   14551                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   14552              
   14553              
   14554              $C$DW$T$68      .dwtag  DW_TAG_structure_type
   14555                      .dwattr $C$DW$T$68, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   14556                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x18)
   14557              $C$DW$1921      .dwtag  DW_TAG_member
   14558                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$64)
   14559                      .dwattr $C$DW$1921, DW_AT_name("Stat_Reg_1")
   14560                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_Stat_Reg_1")
   14561                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14562                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   14563              
   14564              $C$DW$1922      .dwtag  DW_TAG_member
   14565                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$65)
   14566                      .dwattr $C$DW$1922, DW_AT_name("Stat_Reg_2")
   14567                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_Stat_Reg_2")
   14568                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   14569                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   14570              
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  275

   14571              $C$DW$1923      .dwtag  DW_TAG_member
   14572                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$66)
   14573                      .dwattr $C$DW$1923, DW_AT_name("Ctrl_Reg_1")
   14574                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   14575                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   14576                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   14577              
   14578              $C$DW$1924      .dwtag  DW_TAG_member
   14579                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$67)
   14580                      .dwattr $C$DW$1924, DW_AT_name("Ctrl_Reg_2")
   14581                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   14582                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14583                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   14584              
   14585              $C$DW$1925      .dwtag  DW_TAG_member
   14586                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$40)
   14587                      .dwattr $C$DW$1925, DW_AT_name("SndCmd")
   14588                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_SndCmd")
   14589                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   14590                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   14591              
   14592              $C$DW$1926      .dwtag  DW_TAG_member
   14593                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$40)
   14594                      .dwattr $C$DW$1926, DW_AT_name("RcvCmd")
   14595                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_RcvCmd")
   14596                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   14597                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   14598              
   14599                      .dwendtag $C$DW$T$68
   14600              
   14601              $C$DW$T$377     .dwtag  DW_TAG_typedef
   14602                      .dwattr $C$DW$T$377, DW_AT_name("DRV_SPI_8301_Vars_t")
   14603                      .dwattr $C$DW$T$377, DW_AT_type(*$C$DW$T$68)
   14604                      .dwattr $C$DW$T$377, DW_AT_language(DW_LANG_C)
   14605              
   14606              $C$DW$T$378     .dwtag  DW_TAG_pointer_type
   14607                      .dwattr $C$DW$T$378, DW_AT_type(*$C$DW$T$377)
   14608                      .dwattr $C$DW$T$378, DW_AT_address_class(0x20)
   14609              
   14610              
   14611              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   14612                      .dwattr $C$DW$T$70, DW_AT_name("_FILTER_FO_")
   14613                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
   14614              $C$DW$1927      .dwtag  DW_TAG_member
   14615                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$69)
   14616                      .dwattr $C$DW$1927, DW_AT_name("a1")
   14617                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_a1")
   14618                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14619                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   14620              
   14621              $C$DW$1928      .dwtag  DW_TAG_member
   14622                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$69)
   14623                      .dwattr $C$DW$1928, DW_AT_name("b0")
   14624                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_b0")
   14625                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  276

   14626                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   14627              
   14628              $C$DW$1929      .dwtag  DW_TAG_member
   14629                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$69)
   14630                      .dwattr $C$DW$1929, DW_AT_name("b1")
   14631                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_b1")
   14632                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14633                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   14634              
   14635              $C$DW$1930      .dwtag  DW_TAG_member
   14636                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$69)
   14637                      .dwattr $C$DW$1930, DW_AT_name("x1")
   14638                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_x1")
   14639                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14640                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   14641              
   14642              $C$DW$1931      .dwtag  DW_TAG_member
   14643                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$69)
   14644                      .dwattr $C$DW$1931, DW_AT_name("y1")
   14645                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_y1")
   14646                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14647                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   14648              
   14649                      .dwendtag $C$DW$T$70
   14650              
   14651              $C$DW$T$120     .dwtag  DW_TAG_typedef
   14652                      .dwattr $C$DW$T$120, DW_AT_name("FILTER_FO_Obj")
   14653                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$70)
   14654                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
   14655              
   14656              
   14657              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   14658                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   14659                      .dwattr $C$DW$T$19, DW_AT_declaration
   14660                      .dwendtag $C$DW$T$19
   14661              
   14662              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
   14663                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$19)
   14664                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
   14665              
   14666              $C$DW$T$122     .dwtag  DW_TAG_typedef
   14667                      .dwattr $C$DW$T$122, DW_AT_name("FILTER_FO_Handle")
   14668                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
   14669                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
   14670              
   14671              
   14672              $C$DW$T$71      .dwtag  DW_TAG_structure_type
   14673                      .dwattr $C$DW$T$71, DW_AT_name("_FLASH_Obj_")
   14674                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
   14675              $C$DW$1932      .dwtag  DW_TAG_member
   14676                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$22)
   14677                      .dwattr $C$DW$1932, DW_AT_name("FOPT")
   14678                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_FOPT")
   14679                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14680                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  277

   14681              
   14682              $C$DW$1933      .dwtag  DW_TAG_member
   14683                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$22)
   14684                      .dwattr $C$DW$1933, DW_AT_name("rsvd_1")
   14685                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_rsvd_1")
   14686                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14687                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   14688              
   14689              $C$DW$1934      .dwtag  DW_TAG_member
   14690                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$22)
   14691                      .dwattr $C$DW$1934, DW_AT_name("FPWR")
   14692                      .dwattr $C$DW$1934, DW_AT_TI_symbol_name("_FPWR")
   14693                      .dwattr $C$DW$1934, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14694                      .dwattr $C$DW$1934, DW_AT_accessibility(DW_ACCESS_public)
   14695              
   14696              $C$DW$1935      .dwtag  DW_TAG_member
   14697                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$22)
   14698                      .dwattr $C$DW$1935, DW_AT_name("FSTATUS")
   14699                      .dwattr $C$DW$1935, DW_AT_TI_symbol_name("_FSTATUS")
   14700                      .dwattr $C$DW$1935, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14701                      .dwattr $C$DW$1935, DW_AT_accessibility(DW_ACCESS_public)
   14702              
   14703              $C$DW$1936      .dwtag  DW_TAG_member
   14704                      .dwattr $C$DW$1936, DW_AT_type(*$C$DW$T$22)
   14705                      .dwattr $C$DW$1936, DW_AT_name("FSTDBYWAIT")
   14706                      .dwattr $C$DW$1936, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   14707                      .dwattr $C$DW$1936, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14708                      .dwattr $C$DW$1936, DW_AT_accessibility(DW_ACCESS_public)
   14709              
   14710              $C$DW$1937      .dwtag  DW_TAG_member
   14711                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$22)
   14712                      .dwattr $C$DW$1937, DW_AT_name("FACTIVEWAIT")
   14713                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   14714                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14715                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   14716              
   14717              $C$DW$1938      .dwtag  DW_TAG_member
   14718                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$22)
   14719                      .dwattr $C$DW$1938, DW_AT_name("FBANKWAIT")
   14720                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_FBANKWAIT")
   14721                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14722                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   14723              
   14724              $C$DW$1939      .dwtag  DW_TAG_member
   14725                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$22)
   14726                      .dwattr $C$DW$1939, DW_AT_name("FOTPWAIT")
   14727                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_FOTPWAIT")
   14728                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14729                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   14730              
   14731                      .dwendtag $C$DW$T$71
   14732              
   14733              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
   14734                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$71)
   14735                      .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  278

   14736              
   14737              $C$DW$T$88      .dwtag  DW_TAG_typedef
   14738                      .dwattr $C$DW$T$88, DW_AT_name("FLASH_Handle")
   14739                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
   14740                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
   14741              
   14742              
   14743              $C$DW$T$76      .dwtag  DW_TAG_structure_type
   14744                      .dwattr $C$DW$T$76, DW_AT_name("_GPIO_Obj_")
   14745                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x6a)
   14746              $C$DW$1940      .dwtag  DW_TAG_member
   14747                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$73)
   14748                      .dwattr $C$DW$1940, DW_AT_name("GPACTRL")
   14749                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_GPACTRL")
   14750                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14751                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   14752              
   14753              $C$DW$1941      .dwtag  DW_TAG_member
   14754                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$73)
   14755                      .dwattr $C$DW$1941, DW_AT_name("GPAQSEL1")
   14756                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_GPAQSEL1")
   14757                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14758                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   14759              
   14760              $C$DW$1942      .dwtag  DW_TAG_member
   14761                      .dwattr $C$DW$1942, DW_AT_type(*$C$DW$T$73)
   14762                      .dwattr $C$DW$1942, DW_AT_name("GPAQSEL2")
   14763                      .dwattr $C$DW$1942, DW_AT_TI_symbol_name("_GPAQSEL2")
   14764                      .dwattr $C$DW$1942, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14765                      .dwattr $C$DW$1942, DW_AT_accessibility(DW_ACCESS_public)
   14766              
   14767              $C$DW$1943      .dwtag  DW_TAG_member
   14768                      .dwattr $C$DW$1943, DW_AT_type(*$C$DW$T$73)
   14769                      .dwattr $C$DW$1943, DW_AT_name("GPAMUX1")
   14770                      .dwattr $C$DW$1943, DW_AT_TI_symbol_name("_GPAMUX1")
   14771                      .dwattr $C$DW$1943, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14772                      .dwattr $C$DW$1943, DW_AT_accessibility(DW_ACCESS_public)
   14773              
   14774              $C$DW$1944      .dwtag  DW_TAG_member
   14775                      .dwattr $C$DW$1944, DW_AT_type(*$C$DW$T$73)
   14776                      .dwattr $C$DW$1944, DW_AT_name("GPAMUX2")
   14777                      .dwattr $C$DW$1944, DW_AT_TI_symbol_name("_GPAMUX2")
   14778                      .dwattr $C$DW$1944, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14779                      .dwattr $C$DW$1944, DW_AT_accessibility(DW_ACCESS_public)
   14780              
   14781              $C$DW$1945      .dwtag  DW_TAG_member
   14782                      .dwattr $C$DW$1945, DW_AT_type(*$C$DW$T$73)
   14783                      .dwattr $C$DW$1945, DW_AT_name("GPADIR")
   14784                      .dwattr $C$DW$1945, DW_AT_TI_symbol_name("_GPADIR")
   14785                      .dwattr $C$DW$1945, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14786                      .dwattr $C$DW$1945, DW_AT_accessibility(DW_ACCESS_public)
   14787              
   14788              $C$DW$1946      .dwtag  DW_TAG_member
   14789                      .dwattr $C$DW$1946, DW_AT_type(*$C$DW$T$73)
   14790                      .dwattr $C$DW$1946, DW_AT_name("GPAPUD")
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  279

   14791                      .dwattr $C$DW$1946, DW_AT_TI_symbol_name("_GPAPUD")
   14792                      .dwattr $C$DW$1946, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14793                      .dwattr $C$DW$1946, DW_AT_accessibility(DW_ACCESS_public)
   14794              
   14795              $C$DW$1947      .dwtag  DW_TAG_member
   14796                      .dwattr $C$DW$1947, DW_AT_type(*$C$DW$T$25)
   14797                      .dwattr $C$DW$1947, DW_AT_name("rsvd_1")
   14798                      .dwattr $C$DW$1947, DW_AT_TI_symbol_name("_rsvd_1")
   14799                      .dwattr $C$DW$1947, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14800                      .dwattr $C$DW$1947, DW_AT_accessibility(DW_ACCESS_public)
   14801              
   14802              $C$DW$1948      .dwtag  DW_TAG_member
   14803                      .dwattr $C$DW$1948, DW_AT_type(*$C$DW$T$73)
   14804                      .dwattr $C$DW$1948, DW_AT_name("GPBCTRL")
   14805                      .dwattr $C$DW$1948, DW_AT_TI_symbol_name("_GPBCTRL")
   14806                      .dwattr $C$DW$1948, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14807                      .dwattr $C$DW$1948, DW_AT_accessibility(DW_ACCESS_public)
   14808              
   14809              $C$DW$1949      .dwtag  DW_TAG_member
   14810                      .dwattr $C$DW$1949, DW_AT_type(*$C$DW$T$73)
   14811                      .dwattr $C$DW$1949, DW_AT_name("GPBQSEL1")
   14812                      .dwattr $C$DW$1949, DW_AT_TI_symbol_name("_GPBQSEL1")
   14813                      .dwattr $C$DW$1949, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14814                      .dwattr $C$DW$1949, DW_AT_accessibility(DW_ACCESS_public)
   14815              
   14816              $C$DW$1950      .dwtag  DW_TAG_member
   14817                      .dwattr $C$DW$1950, DW_AT_type(*$C$DW$T$25)
   14818                      .dwattr $C$DW$1950, DW_AT_name("rsvd_2")
   14819                      .dwattr $C$DW$1950, DW_AT_TI_symbol_name("_rsvd_2")
   14820                      .dwattr $C$DW$1950, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   14821                      .dwattr $C$DW$1950, DW_AT_accessibility(DW_ACCESS_public)
   14822              
   14823              $C$DW$1951      .dwtag  DW_TAG_member
   14824                      .dwattr $C$DW$1951, DW_AT_type(*$C$DW$T$73)
   14825                      .dwattr $C$DW$1951, DW_AT_name("GPBMUX1")
   14826                      .dwattr $C$DW$1951, DW_AT_TI_symbol_name("_GPBMUX1")
   14827                      .dwattr $C$DW$1951, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   14828                      .dwattr $C$DW$1951, DW_AT_accessibility(DW_ACCESS_public)
   14829              
   14830              $C$DW$1952      .dwtag  DW_TAG_member
   14831                      .dwattr $C$DW$1952, DW_AT_type(*$C$DW$T$25)
   14832                      .dwattr $C$DW$1952, DW_AT_name("rsvd_3")
   14833                      .dwattr $C$DW$1952, DW_AT_TI_symbol_name("_rsvd_3")
   14834                      .dwattr $C$DW$1952, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   14835                      .dwattr $C$DW$1952, DW_AT_accessibility(DW_ACCESS_public)
   14836              
   14837              $C$DW$1953      .dwtag  DW_TAG_member
   14838                      .dwattr $C$DW$1953, DW_AT_type(*$C$DW$T$73)
   14839                      .dwattr $C$DW$1953, DW_AT_name("GPBDIR")
   14840                      .dwattr $C$DW$1953, DW_AT_TI_symbol_name("_GPBDIR")
   14841                      .dwattr $C$DW$1953, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   14842                      .dwattr $C$DW$1953, DW_AT_accessibility(DW_ACCESS_public)
   14843              
   14844              $C$DW$1954      .dwtag  DW_TAG_member
   14845                      .dwattr $C$DW$1954, DW_AT_type(*$C$DW$T$73)
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  280

   14846                      .dwattr $C$DW$1954, DW_AT_name("GPBPUD")
   14847                      .dwattr $C$DW$1954, DW_AT_TI_symbol_name("_GPBPUD")
   14848                      .dwattr $C$DW$1954, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   14849                      .dwattr $C$DW$1954, DW_AT_accessibility(DW_ACCESS_public)
   14850              
   14851              $C$DW$1955      .dwtag  DW_TAG_member
   14852                      .dwattr $C$DW$1955, DW_AT_type(*$C$DW$T$74)
   14853                      .dwattr $C$DW$1955, DW_AT_name("rsvd_4")
   14854                      .dwattr $C$DW$1955, DW_AT_TI_symbol_name("_rsvd_4")
   14855                      .dwattr $C$DW$1955, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   14856                      .dwattr $C$DW$1955, DW_AT_accessibility(DW_ACCESS_public)
   14857              
   14858              $C$DW$1956      .dwtag  DW_TAG_member
   14859                      .dwattr $C$DW$1956, DW_AT_type(*$C$DW$T$73)
   14860                      .dwattr $C$DW$1956, DW_AT_name("AIOMUX1")
   14861                      .dwattr $C$DW$1956, DW_AT_TI_symbol_name("_AIOMUX1")
   14862                      .dwattr $C$DW$1956, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   14863                      .dwattr $C$DW$1956, DW_AT_accessibility(DW_ACCESS_public)
   14864              
   14865              $C$DW$1957      .dwtag  DW_TAG_member
   14866                      .dwattr $C$DW$1957, DW_AT_type(*$C$DW$T$25)
   14867                      .dwattr $C$DW$1957, DW_AT_name("rsvd_5")
   14868                      .dwattr $C$DW$1957, DW_AT_TI_symbol_name("_rsvd_5")
   14869                      .dwattr $C$DW$1957, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   14870                      .dwattr $C$DW$1957, DW_AT_accessibility(DW_ACCESS_public)
   14871              
   14872              $C$DW$1958      .dwtag  DW_TAG_member
   14873                      .dwattr $C$DW$1958, DW_AT_type(*$C$DW$T$73)
   14874                      .dwattr $C$DW$1958, DW_AT_name("AIODIR")
   14875                      .dwattr $C$DW$1958, DW_AT_TI_symbol_name("_AIODIR")
   14876                      .dwattr $C$DW$1958, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   14877                      .dwattr $C$DW$1958, DW_AT_accessibility(DW_ACCESS_public)
   14878              
   14879              $C$DW$1959      .dwtag  DW_TAG_member
   14880                      .dwattr $C$DW$1959, DW_AT_type(*$C$DW$T$75)
   14881                      .dwattr $C$DW$1959, DW_AT_name("rsvd_6")
   14882                      .dwattr $C$DW$1959, DW_AT_TI_symbol_name("_rsvd_6")
   14883                      .dwattr $C$DW$1959, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   14884                      .dwattr $C$DW$1959, DW_AT_accessibility(DW_ACCESS_public)
   14885              
   14886              $C$DW$1960      .dwtag  DW_TAG_member
   14887                      .dwattr $C$DW$1960, DW_AT_type(*$C$DW$T$73)
   14888                      .dwattr $C$DW$1960, DW_AT_name("GPADAT")
   14889                      .dwattr $C$DW$1960, DW_AT_TI_symbol_name("_GPADAT")
   14890                      .dwattr $C$DW$1960, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14891                      .dwattr $C$DW$1960, DW_AT_accessibility(DW_ACCESS_public)
   14892              
   14893              $C$DW$1961      .dwtag  DW_TAG_member
   14894                      .dwattr $C$DW$1961, DW_AT_type(*$C$DW$T$73)
   14895                      .dwattr $C$DW$1961, DW_AT_name("GPASET")
   14896                      .dwattr $C$DW$1961, DW_AT_TI_symbol_name("_GPASET")
   14897                      .dwattr $C$DW$1961, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   14898                      .dwattr $C$DW$1961, DW_AT_accessibility(DW_ACCESS_public)
   14899              
   14900              $C$DW$1962      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  281

   14901                      .dwattr $C$DW$1962, DW_AT_type(*$C$DW$T$73)
   14902                      .dwattr $C$DW$1962, DW_AT_name("GPACLEAR")
   14903                      .dwattr $C$DW$1962, DW_AT_TI_symbol_name("_GPACLEAR")
   14904                      .dwattr $C$DW$1962, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   14905                      .dwattr $C$DW$1962, DW_AT_accessibility(DW_ACCESS_public)
   14906              
   14907              $C$DW$1963      .dwtag  DW_TAG_member
   14908                      .dwattr $C$DW$1963, DW_AT_type(*$C$DW$T$73)
   14909                      .dwattr $C$DW$1963, DW_AT_name("GPATOGGLE")
   14910                      .dwattr $C$DW$1963, DW_AT_TI_symbol_name("_GPATOGGLE")
   14911                      .dwattr $C$DW$1963, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14912                      .dwattr $C$DW$1963, DW_AT_accessibility(DW_ACCESS_public)
   14913              
   14914              $C$DW$1964      .dwtag  DW_TAG_member
   14915                      .dwattr $C$DW$1964, DW_AT_type(*$C$DW$T$73)
   14916                      .dwattr $C$DW$1964, DW_AT_name("GPBDAT")
   14917                      .dwattr $C$DW$1964, DW_AT_TI_symbol_name("_GPBDAT")
   14918                      .dwattr $C$DW$1964, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   14919                      .dwattr $C$DW$1964, DW_AT_accessibility(DW_ACCESS_public)
   14920              
   14921              $C$DW$1965      .dwtag  DW_TAG_member
   14922                      .dwattr $C$DW$1965, DW_AT_type(*$C$DW$T$73)
   14923                      .dwattr $C$DW$1965, DW_AT_name("GPBSET")
   14924                      .dwattr $C$DW$1965, DW_AT_TI_symbol_name("_GPBSET")
   14925                      .dwattr $C$DW$1965, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   14926                      .dwattr $C$DW$1965, DW_AT_accessibility(DW_ACCESS_public)
   14927              
   14928              $C$DW$1966      .dwtag  DW_TAG_member
   14929                      .dwattr $C$DW$1966, DW_AT_type(*$C$DW$T$73)
   14930                      .dwattr $C$DW$1966, DW_AT_name("GPBCLEAR")
   14931                      .dwattr $C$DW$1966, DW_AT_TI_symbol_name("_GPBCLEAR")
   14932                      .dwattr $C$DW$1966, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   14933                      .dwattr $C$DW$1966, DW_AT_accessibility(DW_ACCESS_public)
   14934              
   14935              $C$DW$1967      .dwtag  DW_TAG_member
   14936                      .dwattr $C$DW$1967, DW_AT_type(*$C$DW$T$73)
   14937                      .dwattr $C$DW$1967, DW_AT_name("GPBTOGGLE")
   14938                      .dwattr $C$DW$1967, DW_AT_TI_symbol_name("_GPBTOGGLE")
   14939                      .dwattr $C$DW$1967, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   14940                      .dwattr $C$DW$1967, DW_AT_accessibility(DW_ACCESS_public)
   14941              
   14942              $C$DW$1968      .dwtag  DW_TAG_member
   14943                      .dwattr $C$DW$1968, DW_AT_type(*$C$DW$T$30)
   14944                      .dwattr $C$DW$1968, DW_AT_name("rsvd_7")
   14945                      .dwattr $C$DW$1968, DW_AT_TI_symbol_name("_rsvd_7")
   14946                      .dwattr $C$DW$1968, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   14947                      .dwattr $C$DW$1968, DW_AT_accessibility(DW_ACCESS_public)
   14948              
   14949              $C$DW$1969      .dwtag  DW_TAG_member
   14950                      .dwattr $C$DW$1969, DW_AT_type(*$C$DW$T$73)
   14951                      .dwattr $C$DW$1969, DW_AT_name("AIODAT")
   14952                      .dwattr $C$DW$1969, DW_AT_TI_symbol_name("_AIODAT")
   14953                      .dwattr $C$DW$1969, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   14954                      .dwattr $C$DW$1969, DW_AT_accessibility(DW_ACCESS_public)
   14955              
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  282

   14956              $C$DW$1970      .dwtag  DW_TAG_member
   14957                      .dwattr $C$DW$1970, DW_AT_type(*$C$DW$T$73)
   14958                      .dwattr $C$DW$1970, DW_AT_name("AIOSET")
   14959                      .dwattr $C$DW$1970, DW_AT_TI_symbol_name("_AIOSET")
   14960                      .dwattr $C$DW$1970, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   14961                      .dwattr $C$DW$1970, DW_AT_accessibility(DW_ACCESS_public)
   14962              
   14963              $C$DW$1971      .dwtag  DW_TAG_member
   14964                      .dwattr $C$DW$1971, DW_AT_type(*$C$DW$T$73)
   14965                      .dwattr $C$DW$1971, DW_AT_name("AIOCLEAR")
   14966                      .dwattr $C$DW$1971, DW_AT_TI_symbol_name("_AIOCLEAR")
   14967                      .dwattr $C$DW$1971, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   14968                      .dwattr $C$DW$1971, DW_AT_accessibility(DW_ACCESS_public)
   14969              
   14970              $C$DW$1972      .dwtag  DW_TAG_member
   14971                      .dwattr $C$DW$1972, DW_AT_type(*$C$DW$T$73)
   14972                      .dwattr $C$DW$1972, DW_AT_name("AIOTOGGLE")
   14973                      .dwattr $C$DW$1972, DW_AT_TI_symbol_name("_AIOTOGGLE")
   14974                      .dwattr $C$DW$1972, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   14975                      .dwattr $C$DW$1972, DW_AT_accessibility(DW_ACCESS_public)
   14976              
   14977              $C$DW$1973      .dwtag  DW_TAG_member
   14978                      .dwattr $C$DW$1973, DW_AT_type(*$C$DW$T$27)
   14979                      .dwattr $C$DW$1973, DW_AT_name("GPIOXINTnSEL")
   14980                      .dwattr $C$DW$1973, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   14981                      .dwattr $C$DW$1973, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   14982                      .dwattr $C$DW$1973, DW_AT_accessibility(DW_ACCESS_public)
   14983              
   14984              $C$DW$1974      .dwtag  DW_TAG_member
   14985                      .dwattr $C$DW$1974, DW_AT_type(*$C$DW$T$26)
   14986                      .dwattr $C$DW$1974, DW_AT_name("rsvd_8")
   14987                      .dwattr $C$DW$1974, DW_AT_TI_symbol_name("_rsvd_8")
   14988                      .dwattr $C$DW$1974, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   14989                      .dwattr $C$DW$1974, DW_AT_accessibility(DW_ACCESS_public)
   14990              
   14991              $C$DW$1975      .dwtag  DW_TAG_member
   14992                      .dwattr $C$DW$1975, DW_AT_type(*$C$DW$T$73)
   14993                      .dwattr $C$DW$1975, DW_AT_name("GPIOLPMSEL")
   14994                      .dwattr $C$DW$1975, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   14995                      .dwattr $C$DW$1975, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   14996                      .dwattr $C$DW$1975, DW_AT_accessibility(DW_ACCESS_public)
   14997              
   14998                      .dwendtag $C$DW$T$76
   14999              
   15000              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
   15001                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$76)
   15002                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
   15003              
   15004              $C$DW$T$37      .dwtag  DW_TAG_typedef
   15005                      .dwattr $C$DW$T$37, DW_AT_name("GPIO_Handle")
   15006                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
   15007                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
   15008              
   15009              
   15010              $C$DW$T$78      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  283

   15011                      .dwattr $C$DW$T$78, DW_AT_name("_HAL_AdcData_t_")
   15012                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0e)
   15013              $C$DW$1976      .dwtag  DW_TAG_member
   15014                      .dwattr $C$DW$1976, DW_AT_type(*$C$DW$T$77)
   15015                      .dwattr $C$DW$1976, DW_AT_name("I")
   15016                      .dwattr $C$DW$1976, DW_AT_TI_symbol_name("_I")
   15017                      .dwattr $C$DW$1976, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15018                      .dwattr $C$DW$1976, DW_AT_accessibility(DW_ACCESS_public)
   15019              
   15020              $C$DW$1977      .dwtag  DW_TAG_member
   15021                      .dwattr $C$DW$1977, DW_AT_type(*$C$DW$T$77)
   15022                      .dwattr $C$DW$1977, DW_AT_name("V")
   15023                      .dwattr $C$DW$1977, DW_AT_TI_symbol_name("_V")
   15024                      .dwattr $C$DW$1977, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15025                      .dwattr $C$DW$1977, DW_AT_accessibility(DW_ACCESS_public)
   15026              
   15027              $C$DW$1978      .dwtag  DW_TAG_member
   15028                      .dwattr $C$DW$1978, DW_AT_type(*$C$DW$T$69)
   15029                      .dwattr $C$DW$1978, DW_AT_name("dcBus")
   15030                      .dwattr $C$DW$1978, DW_AT_TI_symbol_name("_dcBus")
   15031                      .dwattr $C$DW$1978, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15032                      .dwattr $C$DW$1978, DW_AT_accessibility(DW_ACCESS_public)
   15033              
   15034                      .dwendtag $C$DW$T$78
   15035              
   15036              $C$DW$T$110     .dwtag  DW_TAG_typedef
   15037                      .dwattr $C$DW$T$110, DW_AT_name("HAL_AdcData_t")
   15038                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$78)
   15039                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
   15040              
   15041              
   15042              $C$DW$T$80      .dwtag  DW_TAG_structure_type
   15043                      .dwattr $C$DW$T$80, DW_AT_name("_HAL_DacData_t_")
   15044                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x1a)
   15045              $C$DW$1979      .dwtag  DW_TAG_member
   15046                      .dwattr $C$DW$1979, DW_AT_type(*$C$DW$T$21)
   15047                      .dwattr $C$DW$1979, DW_AT_name("PeriodMax")
   15048                      .dwattr $C$DW$1979, DW_AT_TI_symbol_name("_PeriodMax")
   15049                      .dwattr $C$DW$1979, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15050                      .dwattr $C$DW$1979, DW_AT_accessibility(DW_ACCESS_public)
   15051              
   15052              $C$DW$1980      .dwtag  DW_TAG_member
   15053                      .dwattr $C$DW$1980, DW_AT_type(*$C$DW$T$79)
   15054                      .dwattr $C$DW$1980, DW_AT_name("value")
   15055                      .dwattr $C$DW$1980, DW_AT_TI_symbol_name("_value")
   15056                      .dwattr $C$DW$1980, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15057                      .dwattr $C$DW$1980, DW_AT_accessibility(DW_ACCESS_public)
   15058              
   15059              $C$DW$1981      .dwtag  DW_TAG_member
   15060                      .dwattr $C$DW$1981, DW_AT_type(*$C$DW$T$79)
   15061                      .dwattr $C$DW$1981, DW_AT_name("offset")
   15062                      .dwattr $C$DW$1981, DW_AT_TI_symbol_name("_offset")
   15063                      .dwattr $C$DW$1981, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15064                      .dwattr $C$DW$1981, DW_AT_accessibility(DW_ACCESS_public)
   15065              
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  284

   15066              $C$DW$1982      .dwtag  DW_TAG_member
   15067                      .dwattr $C$DW$1982, DW_AT_type(*$C$DW$T$79)
   15068                      .dwattr $C$DW$1982, DW_AT_name("gain")
   15069                      .dwattr $C$DW$1982, DW_AT_TI_symbol_name("_gain")
   15070                      .dwattr $C$DW$1982, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15071                      .dwattr $C$DW$1982, DW_AT_accessibility(DW_ACCESS_public)
   15072              
   15073                      .dwendtag $C$DW$T$80
   15074              
   15075              $C$DW$T$388     .dwtag  DW_TAG_typedef
   15076                      .dwattr $C$DW$T$388, DW_AT_name("HAL_DacData_t")
   15077                      .dwattr $C$DW$T$388, DW_AT_type(*$C$DW$T$80)
   15078                      .dwattr $C$DW$T$388, DW_AT_language(DW_LANG_C)
   15079              
   15080              $C$DW$T$389     .dwtag  DW_TAG_pointer_type
   15081                      .dwattr $C$DW$T$389, DW_AT_type(*$C$DW$T$388)
   15082                      .dwattr $C$DW$T$389, DW_AT_address_class(0x20)
   15083              
   15084              $C$DW$1983      .dwtag  DW_TAG_TI_far_type
   15085                      .dwattr $C$DW$1983, DW_AT_type(*$C$DW$T$389)
   15086              
   15087              $C$DW$T$390     .dwtag  DW_TAG_const_type
   15088                      .dwattr $C$DW$T$390, DW_AT_type(*$C$DW$1983)
   15089              
   15090              
   15091              $C$DW$T$117     .dwtag  DW_TAG_structure_type
   15092                      .dwattr $C$DW$T$117, DW_AT_name("_HAL_Obj_")
   15093                      .dwattr $C$DW$T$117, DW_AT_byte_size(0xc4)
   15094              $C$DW$1984      .dwtag  DW_TAG_member
   15095                      .dwattr $C$DW$1984, DW_AT_type(*$C$DW$T$82)
   15096                      .dwattr $C$DW$1984, DW_AT_name("adcHandle")
   15097                      .dwattr $C$DW$1984, DW_AT_TI_symbol_name("_adcHandle")
   15098                      .dwattr $C$DW$1984, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15099                      .dwattr $C$DW$1984, DW_AT_accessibility(DW_ACCESS_public)
   15100              
   15101              $C$DW$1985      .dwtag  DW_TAG_member
   15102                      .dwattr $C$DW$1985, DW_AT_type(*$C$DW$T$84)
   15103                      .dwattr $C$DW$1985, DW_AT_name("clkHandle")
   15104                      .dwattr $C$DW$1985, DW_AT_TI_symbol_name("_clkHandle")
   15105                      .dwattr $C$DW$1985, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15106                      .dwattr $C$DW$1985, DW_AT_accessibility(DW_ACCESS_public)
   15107              
   15108              $C$DW$1986      .dwtag  DW_TAG_member
   15109                      .dwattr $C$DW$1986, DW_AT_type(*$C$DW$T$86)
   15110                      .dwattr $C$DW$1986, DW_AT_name("cpuHandle")
   15111                      .dwattr $C$DW$1986, DW_AT_TI_symbol_name("_cpuHandle")
   15112                      .dwattr $C$DW$1986, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15113                      .dwattr $C$DW$1986, DW_AT_accessibility(DW_ACCESS_public)
   15114              
   15115              $C$DW$1987      .dwtag  DW_TAG_member
   15116                      .dwattr $C$DW$1987, DW_AT_type(*$C$DW$T$88)
   15117                      .dwattr $C$DW$1987, DW_AT_name("flashHandle")
   15118                      .dwattr $C$DW$1987, DW_AT_TI_symbol_name("_flashHandle")
   15119                      .dwattr $C$DW$1987, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15120                      .dwattr $C$DW$1987, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  285

   15121              
   15122              $C$DW$1988      .dwtag  DW_TAG_member
   15123                      .dwattr $C$DW$1988, DW_AT_type(*$C$DW$T$37)
   15124                      .dwattr $C$DW$1988, DW_AT_name("gpioHandle")
   15125                      .dwattr $C$DW$1988, DW_AT_TI_symbol_name("_gpioHandle")
   15126                      .dwattr $C$DW$1988, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15127                      .dwattr $C$DW$1988, DW_AT_accessibility(DW_ACCESS_public)
   15128              
   15129              $C$DW$1989      .dwtag  DW_TAG_member
   15130                      .dwattr $C$DW$1989, DW_AT_type(*$C$DW$T$91)
   15131                      .dwattr $C$DW$1989, DW_AT_name("offsetHandle_I")
   15132                      .dwattr $C$DW$1989, DW_AT_TI_symbol_name("_offsetHandle_I")
   15133                      .dwattr $C$DW$1989, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15134                      .dwattr $C$DW$1989, DW_AT_accessibility(DW_ACCESS_public)
   15135              
   15136              $C$DW$1990      .dwtag  DW_TAG_member
   15137                      .dwattr $C$DW$1990, DW_AT_type(*$C$DW$T$93)
   15138                      .dwattr $C$DW$1990, DW_AT_name("offset_I")
   15139                      .dwattr $C$DW$1990, DW_AT_TI_symbol_name("_offset_I")
   15140                      .dwattr $C$DW$1990, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15141                      .dwattr $C$DW$1990, DW_AT_accessibility(DW_ACCESS_public)
   15142              
   15143              $C$DW$1991      .dwtag  DW_TAG_member
   15144                      .dwattr $C$DW$1991, DW_AT_type(*$C$DW$T$91)
   15145                      .dwattr $C$DW$1991, DW_AT_name("offsetHandle_V")
   15146                      .dwattr $C$DW$1991, DW_AT_TI_symbol_name("_offsetHandle_V")
   15147                      .dwattr $C$DW$1991, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   15148                      .dwattr $C$DW$1991, DW_AT_accessibility(DW_ACCESS_public)
   15149              
   15150              $C$DW$1992      .dwtag  DW_TAG_member
   15151                      .dwattr $C$DW$1992, DW_AT_type(*$C$DW$T$93)
   15152                      .dwattr $C$DW$1992, DW_AT_name("offset_V")
   15153                      .dwattr $C$DW$1992, DW_AT_TI_symbol_name("_offset_V")
   15154                      .dwattr $C$DW$1992, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   15155                      .dwattr $C$DW$1992, DW_AT_accessibility(DW_ACCESS_public)
   15156              
   15157              $C$DW$1993      .dwtag  DW_TAG_member
   15158                      .dwattr $C$DW$1993, DW_AT_type(*$C$DW$T$95)
   15159                      .dwattr $C$DW$1993, DW_AT_name("oscHandle")
   15160                      .dwattr $C$DW$1993, DW_AT_TI_symbol_name("_oscHandle")
   15161                      .dwattr $C$DW$1993, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   15162                      .dwattr $C$DW$1993, DW_AT_accessibility(DW_ACCESS_public)
   15163              
   15164              $C$DW$1994      .dwtag  DW_TAG_member
   15165                      .dwattr $C$DW$1994, DW_AT_type(*$C$DW$T$97)
   15166                      .dwattr $C$DW$1994, DW_AT_name("pieHandle")
   15167                      .dwattr $C$DW$1994, DW_AT_TI_symbol_name("_pieHandle")
   15168                      .dwattr $C$DW$1994, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   15169                      .dwattr $C$DW$1994, DW_AT_accessibility(DW_ACCESS_public)
   15170              
   15171              $C$DW$1995      .dwtag  DW_TAG_member
   15172                      .dwattr $C$DW$1995, DW_AT_type(*$C$DW$T$99)
   15173                      .dwattr $C$DW$1995, DW_AT_name("pllHandle")
   15174                      .dwattr $C$DW$1995, DW_AT_TI_symbol_name("_pllHandle")
   15175                      .dwattr $C$DW$1995, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
TMS320C2000 Assembler PC v15.12.3 Fri Mar 17 14:36:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0696810                          PAGE  286

   15176                      .dwattr $C$DW$1995, DW_AT_accessibility(DW_ACCESS_public)
   15177              
   15178              $C$DW$1996      .dwtag  DW_TAG_member
   15179                      .dwattr $C$DW$1996, DW_AT_type(*$C$DW$T$102)
   15180                      .dwattr $C$DW$1996, DW_AT_name("pwmHandle")
   15181                      .dwattr $C$DW$1996, DW_AT_TI_symbol_name("_pwmHandle")
   15182                      .dwattr $C$DW$1996, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   15183                      .dwattr $C$DW$1996, DW_AT_accessibility(DW_ACCESS_public)
   15184              
   15185              $C$DW$1997      .dwtag  DW_TAG_member
   15186                      .dwattr $C$DW$1997, DW_AT_type(*$C$DW$T$102)
   15187                      .dwattr $C$DW$1997, DW_AT_name("pwmDacHandle")
   15188                      .dwattr $C$DW$1997, DW_AT_TI_symbol_name("_pwmDacHandle")
   15189                      .dwattr $C$DW$1997, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   15190                      .dwattr $C$DW$1997, DW_AT_accessibility(DW_ACCESS_public)
   15191              
   15192              $C$DW$1998      .dwtag  DW_TAG_member
   15193                      .dwattr $C$DW$1998, DW_AT_type(*$C$DW$T$104)
   15194                      .dwattr $C$DW$1998, DW_AT_name("pwrHandle")
   15195                      .dwattr $C$DW$1998, DW_AT_TI_symbol_name("_pwrHandle")
   15196                      .dwattr $C$DW$1998, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   15197                      .dwattr $C$DW$1998, DW_AT_accessibility(DW_ACCESS_public)
   15198              
   15199              $C$DW$1999      .dwtag  DW_TAG_member
   15200                      .dwattr $C$DW$1999, DW_AT_type(*$C$DW$T$107)
   15201                      .dwattr $C$DW$1999, DW_AT_name("timerHandle")
   15202                      .dwattr $C$DW$1999, DW_AT_TI_symbol_name("_timerHandle")
   15203                      .dwattr $C$DW$1999, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   15204                      .dwattr $C$DW$1999, DW_AT_accessibility(DW_ACCESS_public)
   15205              
   15206              $C$DW$2000      .dwtag  DW_TAG_member
   15207                      .dwattr $C$DW$2000, DW_AT_type(*$C$DW$T$109)
   15208                      .dwattr $C$DW$2000, DW_AT_name("wdogHandle")
   15209                      .dwattr $C$DW$2000, DW_AT_TI_symbol_name("_wdogHandle")
   15210                      .dwattr $C$DW$2000, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   15211                      .dwattr $C$DW$2000, DW_AT_accessibility(DW_ACCESS_public)
   15212              
   15213              $C$DW$2001      .dwtag  DW_TAG_member
   15214                      .dwattr $C$DW$2001, DW_AT_type(*$C$DW$T$110)
   15215                      .dwattr $C$DW$2001, DW_AT_name("adcBias")
   15216                      .dwattr $C$DW$2001, DW_AT_TI_symbol_name("_adcBias")
   15217                      .dwattr $C$DW$2001, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   15218                      .dwattr $C$DW$2001, DW_AT_accessibility(DW_ACCESS_public)
   15219              
   15220              $C$DW$2002      .dwtag  DW_TAG_member
   15221                      .dwattr $C$DW$2002, DW_AT_type(*$C$DW$T$69)
   15222                      .dwattr $C$DW$2002, DW_AT_name("current_sf")
   15223                      .dwattr $C$DW$2002, DW_AT_TI_symbol_name("_current_sf")
   15224                      .dwattr $C$DW$2002, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
