TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Mon Mar 20 21:32:54 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4483              
    4484              $C$DW$523       .dwtag  DW_TAG_enumerator
    4485                      .dwattr $C$DW$523, DW_AT_name("PIE_GroupNumber_11")
    4486                      .dwattr $C$DW$523, DW_AT_const_value(0x0a)
    4487              
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE   88

    4488              $C$DW$524       .dwtag  DW_TAG_enumerator
    4489                      .dwattr $C$DW$524, DW_AT_name("PIE_GroupNumber_12")
    4490                      .dwattr $C$DW$524, DW_AT_const_value(0x0b)
    4491              
    4492                      .dwendtag $C$DW$T$217
    4493              
    4494              $C$DW$T$218     .dwtag  DW_TAG_typedef
    4495                      .dwattr $C$DW$T$218, DW_AT_name("PIE_GroupNumber_e")
    4496                      .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$217)
    4497                      .dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
    4498              
    4499              
    4500              $C$DW$T$220     .dwtag  DW_TAG_enumeration_type
    4501                      .dwattr $C$DW$T$220, DW_AT_byte_size(0x01)
    4502              $C$DW$525       .dwtag  DW_TAG_enumerator
    4503                      .dwattr $C$DW$525, DW_AT_name("SCI_FifoStatus_Empty")
    4504                      .dwattr $C$DW$525, DW_AT_const_value(0x00)
    4505              
    4506              $C$DW$526       .dwtag  DW_TAG_enumerator
    4507                      .dwattr $C$DW$526, DW_AT_name("SCI_FifoStatus_1_Word")
    4508                      .dwattr $C$DW$526, DW_AT_const_value(0x100)
    4509              
    4510              $C$DW$527       .dwtag  DW_TAG_enumerator
    4511                      .dwattr $C$DW$527, DW_AT_name("SCI_FifoStatus_2_Words")
    4512                      .dwattr $C$DW$527, DW_AT_const_value(0x200)
    4513              
    4514              $C$DW$528       .dwtag  DW_TAG_enumerator
    4515                      .dwattr $C$DW$528, DW_AT_name("SCI_FifoStatus_3_Words")
    4516                      .dwattr $C$DW$528, DW_AT_const_value(0x300)
    4517              
    4518              $C$DW$529       .dwtag  DW_TAG_enumerator
    4519                      .dwattr $C$DW$529, DW_AT_name("SCI_FifoStatus_4_Words")
    4520                      .dwattr $C$DW$529, DW_AT_const_value(0x400)
    4521              
    4522                      .dwendtag $C$DW$T$220
    4523              
    4524              $C$DW$T$221     .dwtag  DW_TAG_typedef
    4525                      .dwattr $C$DW$T$221, DW_AT_name("SCI_FifoStatus_e")
    4526                      .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$220)
    4527                      .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    4528              
    4529              
    4530              $C$DW$T$225     .dwtag  DW_TAG_enumeration_type
    4531                      .dwattr $C$DW$T$225, DW_AT_byte_size(0x01)
    4532              $C$DW$530       .dwtag  DW_TAG_enumerator
    4533                      .dwattr $C$DW$530, DW_AT_name("CTRL_Type_PID_spd")
    4534                      .dwattr $C$DW$530, DW_AT_const_value(0x00)
    4535              
    4536              $C$DW$531       .dwtag  DW_TAG_enumerator
    4537                      .dwattr $C$DW$531, DW_AT_name("CTRL_Type_PID_Id")
    4538                      .dwattr $C$DW$531, DW_AT_const_value(0x01)
    4539              
    4540              $C$DW$532       .dwtag  DW_TAG_enumerator
    4541                      .dwattr $C$DW$532, DW_AT_name("CTRL_Type_PID_Iq")
    4542                      .dwattr $C$DW$532, DW_AT_const_value(0x02)
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE   89

    4543              
    4544                      .dwendtag $C$DW$T$225
    4545              
    4546              $C$DW$T$226     .dwtag  DW_TAG_typedef
    4547                      .dwattr $C$DW$T$226, DW_AT_name("CTRL_Type_e")
    4548                      .dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$225)
    4549                      .dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C)
    4550              
    4551              
    4552              $C$DW$T$228     .dwtag  DW_TAG_enumeration_type
    4553                      .dwattr $C$DW$T$228, DW_AT_byte_size(0x01)
    4554              $C$DW$533       .dwtag  DW_TAG_enumerator
    4555                      .dwattr $C$DW$533, DW_AT_name("HAL_SensorType_Current")
    4556                      .dwattr $C$DW$533, DW_AT_const_value(0x00)
    4557              
    4558              $C$DW$534       .dwtag  DW_TAG_enumerator
    4559                      .dwattr $C$DW$534, DW_AT_name("HAL_SensorType_Voltage")
    4560                      .dwattr $C$DW$534, DW_AT_const_value(0x01)
    4561              
    4562                      .dwendtag $C$DW$T$228
    4563              
    4564              $C$DW$T$229     .dwtag  DW_TAG_typedef
    4565                      .dwattr $C$DW$T$229, DW_AT_name("HAL_SensorType_e")
    4566                      .dwattr $C$DW$T$229, DW_AT_type(*$C$DW$T$228)
    4567                      .dwattr $C$DW$T$229, DW_AT_language(DW_LANG_C)
    4568              
    4569              
    4570              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4571                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    4572                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    4573              $C$DW$535       .dwtag  DW_TAG_member
    4574                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$24)
    4575                      .dwattr $C$DW$535, DW_AT_name("ADCRESULT")
    4576                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_ADCRESULT")
    4577                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4578                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    4579              
    4580              $C$DW$536       .dwtag  DW_TAG_member
    4581                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$25)
    4582                      .dwattr $C$DW$536, DW_AT_name("resvd_1")
    4583                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_resvd_1")
    4584                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4585                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    4586              
    4587              $C$DW$537       .dwtag  DW_TAG_member
    4588                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$23)
    4589                      .dwattr $C$DW$537, DW_AT_name("ADCCTL1")
    4590                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_ADCCTL1")
    4591                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4592                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    4593              
    4594              $C$DW$538       .dwtag  DW_TAG_member
    4595                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$23)
    4596                      .dwattr $C$DW$538, DW_AT_name("ADCCTL2")
    4597                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_ADCCTL2")
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE   90

    4598                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4599                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    4600              
    4601              $C$DW$539       .dwtag  DW_TAG_member
    4602                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$26)
    4603                      .dwattr $C$DW$539, DW_AT_name("rsvd_2")
    4604                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_rsvd_2")
    4605                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4606                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    4607              
    4608              $C$DW$540       .dwtag  DW_TAG_member
    4609                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$23)
    4610                      .dwattr $C$DW$540, DW_AT_name("ADCINTFLG")
    4611                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_ADCINTFLG")
    4612                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4613                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    4614              
    4615              $C$DW$541       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$23)
    4617                      .dwattr $C$DW$541, DW_AT_name("ADCINTFLGCLR")
    4618                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4619                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4620                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    4621              
    4622              $C$DW$542       .dwtag  DW_TAG_member
    4623                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$23)
    4624                      .dwattr $C$DW$542, DW_AT_name("ADCINTOVF")
    4625                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_ADCINTOVF")
    4626                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4627                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    4628              
    4629              $C$DW$543       .dwtag  DW_TAG_member
    4630                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$23)
    4631                      .dwattr $C$DW$543, DW_AT_name("ADCINTOVFCLR")
    4632                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4633                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4634                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    4635              
    4636              $C$DW$544       .dwtag  DW_TAG_member
    4637                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$27)
    4638                      .dwattr $C$DW$544, DW_AT_name("INTSELxNy")
    4639                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_INTSELxNy")
    4640                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4641                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    4642              
    4643              $C$DW$545       .dwtag  DW_TAG_member
    4644                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$28)
    4645                      .dwattr $C$DW$545, DW_AT_name("rsvd_3")
    4646                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_rsvd_3")
    4647                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4648                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    4649              
    4650              $C$DW$546       .dwtag  DW_TAG_member
    4651                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$23)
    4652                      .dwattr $C$DW$546, DW_AT_name("SOCPRICTRL")
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE   91

    4653                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4654                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4655                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    4656              
    4657              $C$DW$547       .dwtag  DW_TAG_member
    4658                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$23)
    4659                      .dwattr $C$DW$547, DW_AT_name("rsvd_4")
    4660                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_rsvd_4")
    4661                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4662                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    4663              
    4664              $C$DW$548       .dwtag  DW_TAG_member
    4665                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$23)
    4666                      .dwattr $C$DW$548, DW_AT_name("ADCSAMPLEMODE")
    4667                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4668                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4669                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    4670              
    4671              $C$DW$549       .dwtag  DW_TAG_member
    4672                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$23)
    4673                      .dwattr $C$DW$549, DW_AT_name("rsvd_5")
    4674                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_rsvd_5")
    4675                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4676                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    4677              
    4678              $C$DW$550       .dwtag  DW_TAG_member
    4679                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$23)
    4680                      .dwattr $C$DW$550, DW_AT_name("ADCINTSOCSEL1")
    4681                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4682                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4683                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    4684              
    4685              $C$DW$551       .dwtag  DW_TAG_member
    4686                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$23)
    4687                      .dwattr $C$DW$551, DW_AT_name("ADCINTSOCSEL2")
    4688                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4689                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4690                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    4691              
    4692              $C$DW$552       .dwtag  DW_TAG_member
    4693                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$26)
    4694                      .dwattr $C$DW$552, DW_AT_name("rsvd_6")
    4695                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_rsvd_6")
    4696                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4697                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    4698              
    4699              $C$DW$553       .dwtag  DW_TAG_member
    4700                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$23)
    4701                      .dwattr $C$DW$553, DW_AT_name("ADCSOCFLG1")
    4702                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4703                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4704                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    4705              
    4706              $C$DW$554       .dwtag  DW_TAG_member
    4707                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE   92

    4708                      .dwattr $C$DW$554, DW_AT_name("rsvd_7")
    4709                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_rsvd_7")
    4710                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4711                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    4712              
    4713              $C$DW$555       .dwtag  DW_TAG_member
    4714                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$23)
    4715                      .dwattr $C$DW$555, DW_AT_name("ADCSOCFRC1")
    4716                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4717                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4718                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    4719              
    4720              $C$DW$556       .dwtag  DW_TAG_member
    4721                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$23)
    4722                      .dwattr $C$DW$556, DW_AT_name("rsvd_8")
    4723                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_rsvd_8")
    4724                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4725                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    4726              
    4727              $C$DW$557       .dwtag  DW_TAG_member
    4728                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$23)
    4729                      .dwattr $C$DW$557, DW_AT_name("ADCSOCOVF1")
    4730                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4731                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4732                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    4733              
    4734              $C$DW$558       .dwtag  DW_TAG_member
    4735                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$23)
    4736                      .dwattr $C$DW$558, DW_AT_name("rsvd_9")
    4737                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_rsvd_9")
    4738                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4739                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    4740              
    4741              $C$DW$559       .dwtag  DW_TAG_member
    4742                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$23)
    4743                      .dwattr $C$DW$559, DW_AT_name("ADCSOCOVFCLR1")
    4744                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4745                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4746                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    4747              
    4748              $C$DW$560       .dwtag  DW_TAG_member
    4749                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$23)
    4750                      .dwattr $C$DW$560, DW_AT_name("rsvd_10")
    4751                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_rsvd_10")
    4752                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4753                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    4754              
    4755              $C$DW$561       .dwtag  DW_TAG_member
    4756                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$24)
    4757                      .dwattr $C$DW$561, DW_AT_name("ADCSOCxCTL")
    4758                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4759                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4760                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    4761              
    4762              $C$DW$562       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE   93

    4763                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$24)
    4764                      .dwattr $C$DW$562, DW_AT_name("rsvd_11")
    4765                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_rsvd_11")
    4766                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4767                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    4768              
    4769              $C$DW$563       .dwtag  DW_TAG_member
    4770                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$23)
    4771                      .dwattr $C$DW$563, DW_AT_name("ADCREFTRIM")
    4772                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4773                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4774                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    4775              
    4776              $C$DW$564       .dwtag  DW_TAG_member
    4777                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$23)
    4778                      .dwattr $C$DW$564, DW_AT_name("ADCOFFTRIM")
    4779                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4780                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4781                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    4782              
    4783              $C$DW$565       .dwtag  DW_TAG_member
    4784                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$29)
    4785                      .dwattr $C$DW$565, DW_AT_name("resvd_12")
    4786                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_resvd_12")
    4787                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4788                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    4789              
    4790              $C$DW$566       .dwtag  DW_TAG_member
    4791                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$23)
    4792                      .dwattr $C$DW$566, DW_AT_name("ADCREV")
    4793                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_ADCREV")
    4794                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4795                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    4796              
    4797                      .dwendtag $C$DW$T$30
    4798              
    4799              $C$DW$T$231     .dwtag  DW_TAG_typedef
    4800                      .dwattr $C$DW$T$231, DW_AT_name("ADC_Obj")
    4801                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$30)
    4802                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    4803              
    4804              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
    4805                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$30)
    4806                      .dwattr $C$DW$T$116, DW_AT_address_class(0x20)
    4807              
    4808              $C$DW$T$117     .dwtag  DW_TAG_typedef
    4809                      .dwattr $C$DW$T$117, DW_AT_name("ADC_Handle")
    4810                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    4811                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    4812              
    4813              
    4814              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4815                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    4816                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    4817              $C$DW$567       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE   94

    4818                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$31)
    4819                      .dwattr $C$DW$567, DW_AT_name("alpha_sf")
    4820                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_alpha_sf")
    4821                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4822                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    4823              
    4824              $C$DW$568       .dwtag  DW_TAG_member
    4825                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$31)
    4826                      .dwattr $C$DW$568, DW_AT_name("beta_sf")
    4827                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_beta_sf")
    4828                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4829                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    4830              
    4831              $C$DW$569       .dwtag  DW_TAG_member
    4832                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$32)
    4833                      .dwattr $C$DW$569, DW_AT_name("numSensors")
    4834                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_numSensors")
    4835                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4836                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    4837              
    4838                      .dwendtag $C$DW$T$33
    4839              
    4840              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4841                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    4842                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    4843                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4844              
    4845              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    4846                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    4847                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    4848              
    4849              $C$DW$T$43      .dwtag  DW_TAG_typedef
    4850                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    4851                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4852                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4853              
    4854              
    4855              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4856                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    4857                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    4858              $C$DW$570       .dwtag  DW_TAG_member
    4859                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$23)
    4860                      .dwattr $C$DW$570, DW_AT_name("XCLK")
    4861                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_XCLK")
    4862                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4863                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    4864              
    4865              $C$DW$571       .dwtag  DW_TAG_member
    4866                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$23)
    4867                      .dwattr $C$DW$571, DW_AT_name("rsvd_1")
    4868                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_rsvd_1")
    4869                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4870                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    4871              
    4872              $C$DW$572       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE   95

    4873                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$23)
    4874                      .dwattr $C$DW$572, DW_AT_name("CLKCTL")
    4875                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_CLKCTL")
    4876                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4877                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    4878              
    4879              $C$DW$573       .dwtag  DW_TAG_member
    4880                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$34)
    4881                      .dwattr $C$DW$573, DW_AT_name("rsvd_2")
    4882                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_rsvd_2")
    4883                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4884                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    4885              
    4886              $C$DW$574       .dwtag  DW_TAG_member
    4887                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$23)
    4888                      .dwattr $C$DW$574, DW_AT_name("LOSPCP")
    4889                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_LOSPCP")
    4890                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4891                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    4892              
    4893              $C$DW$575       .dwtag  DW_TAG_member
    4894                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$23)
    4895                      .dwattr $C$DW$575, DW_AT_name("PCLKCR0")
    4896                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_PCLKCR0")
    4897                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4898                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    4899              
    4900              $C$DW$576       .dwtag  DW_TAG_member
    4901                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$23)
    4902                      .dwattr $C$DW$576, DW_AT_name("PCLKCR1")
    4903                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_PCLKCR1")
    4904                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4905                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    4906              
    4907              $C$DW$577       .dwtag  DW_TAG_member
    4908                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$26)
    4909                      .dwattr $C$DW$577, DW_AT_name("rsvd_3")
    4910                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_rsvd_3")
    4911                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4912                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    4913              
    4914              $C$DW$578       .dwtag  DW_TAG_member
    4915                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$23)
    4916                      .dwattr $C$DW$578, DW_AT_name("PCLKCR3")
    4917                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_PCLKCR3")
    4918                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4919                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    4920              
    4921                      .dwendtag $C$DW$T$35
    4922              
    4923              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    4924                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$35)
    4925                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
    4926              
    4927              $C$DW$T$119     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE   96

    4928                      .dwattr $C$DW$T$119, DW_AT_name("CLK_Handle")
    4929                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    4930                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    4931              
    4932              
    4933              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4934                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    4935                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    4936              $C$DW$579       .dwtag  DW_TAG_member
    4937                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$32)
    4938                      .dwattr $C$DW$579, DW_AT_name("tmp")
    4939                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_tmp")
    4940                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4941                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    4942              
    4943                      .dwendtag $C$DW$T$36
    4944              
    4945              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    4946                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$36)
    4947                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    4948              
    4949              $C$DW$T$121     .dwtag  DW_TAG_typedef
    4950                      .dwattr $C$DW$T$121, DW_AT_name("CPU_Handle")
    4951                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    4952                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    4953              
    4954              
    4955              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4956                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    4957                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    4958              $C$DW$580       .dwtag  DW_TAG_member
    4959                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$37)
    4960                      .dwattr $C$DW$580, DW_AT_name("version")
    4961                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_version")
    4962                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4963                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    4964              
    4965              $C$DW$581       .dwtag  DW_TAG_member
    4966                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$39)
    4967                      .dwattr $C$DW$581, DW_AT_name("state")
    4968                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_state")
    4969                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4970                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    4971              
    4972              $C$DW$582       .dwtag  DW_TAG_member
    4973                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$39)
    4974                      .dwattr $C$DW$582, DW_AT_name("prevState")
    4975                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_prevState")
    4976                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4977                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    4978              
    4979              $C$DW$583       .dwtag  DW_TAG_member
    4980                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$41)
    4981                      .dwattr $C$DW$583, DW_AT_name("errorCode")
    4982                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_errorCode")
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE   97

    4983                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4984                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    4985              
    4986              $C$DW$584       .dwtag  DW_TAG_member
    4987                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$43)
    4988                      .dwattr $C$DW$584, DW_AT_name("clarkeHandle_I")
    4989                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4990                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4991                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    4992              
    4993              $C$DW$585       .dwtag  DW_TAG_member
    4994                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$44)
    4995                      .dwattr $C$DW$585, DW_AT_name("clarke_I")
    4996                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_clarke_I")
    4997                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4998                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    4999              
    5000              $C$DW$586       .dwtag  DW_TAG_member
    5001                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$43)
    5002                      .dwattr $C$DW$586, DW_AT_name("clarkeHandle_V")
    5003                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_clarkeHandle_V")
    5004                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5005                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    5006              
    5007              $C$DW$587       .dwtag  DW_TAG_member
    5008                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$44)
    5009                      .dwattr $C$DW$587, DW_AT_name("clarke_V")
    5010                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_clarke_V")
    5011                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5012                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    5013              
    5014              $C$DW$588       .dwtag  DW_TAG_member
    5015                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$46)
    5016                      .dwattr $C$DW$588, DW_AT_name("estHandle")
    5017                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_estHandle")
    5018                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5019                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    5020              
    5021              $C$DW$589       .dwtag  DW_TAG_member
    5022                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$48)
    5023                      .dwattr $C$DW$589, DW_AT_name("parkHandle")
    5024                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_parkHandle")
    5025                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5026                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    5027              
    5028              $C$DW$590       .dwtag  DW_TAG_member
    5029                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$49)
    5030                      .dwattr $C$DW$590, DW_AT_name("park")
    5031                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_park")
    5032                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5033                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    5034              
    5035              $C$DW$591       .dwtag  DW_TAG_member
    5036                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$51)
    5037                      .dwattr $C$DW$591, DW_AT_name("pidHandle_Id")
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE   98

    5038                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_pidHandle_Id")
    5039                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5040                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    5041              
    5042              $C$DW$592       .dwtag  DW_TAG_member
    5043                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$52)
    5044                      .dwattr $C$DW$592, DW_AT_name("pid_Id")
    5045                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_pid_Id")
    5046                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5047                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    5048              
    5049              $C$DW$593       .dwtag  DW_TAG_member
    5050                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$51)
    5051                      .dwattr $C$DW$593, DW_AT_name("pidHandle_Iq")
    5052                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_pidHandle_Iq")
    5053                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5054                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    5055              
    5056              $C$DW$594       .dwtag  DW_TAG_member
    5057                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$52)
    5058                      .dwattr $C$DW$594, DW_AT_name("pid_Iq")
    5059                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_pid_Iq")
    5060                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5061                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    5062              
    5063              $C$DW$595       .dwtag  DW_TAG_member
    5064                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$51)
    5065                      .dwattr $C$DW$595, DW_AT_name("pidHandle_spd")
    5066                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_pidHandle_spd")
    5067                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5068                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    5069              
    5070              $C$DW$596       .dwtag  DW_TAG_member
    5071                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$52)
    5072                      .dwattr $C$DW$596, DW_AT_name("pid_spd")
    5073                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_pid_spd")
    5074                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5075                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    5076              
    5077              $C$DW$597       .dwtag  DW_TAG_member
    5078                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$54)
    5079                      .dwattr $C$DW$597, DW_AT_name("iparkHandle")
    5080                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_iparkHandle")
    5081                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    5082                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    5083              
    5084              $C$DW$598       .dwtag  DW_TAG_member
    5085                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$55)
    5086                      .dwattr $C$DW$598, DW_AT_name("ipark")
    5087                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_ipark")
    5088                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5089                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    5090              
    5091              $C$DW$599       .dwtag  DW_TAG_member
    5092                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$57)
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE   99

    5093                      .dwattr $C$DW$599, DW_AT_name("svgenHandle")
    5094                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_svgenHandle")
    5095                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5096                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    5097              
    5098              $C$DW$600       .dwtag  DW_TAG_member
    5099                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$58)
    5100                      .dwattr $C$DW$600, DW_AT_name("svgen")
    5101                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_svgen")
    5102                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5103                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    5104              
    5105              $C$DW$601       .dwtag  DW_TAG_member
    5106                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$60)
    5107                      .dwattr $C$DW$601, DW_AT_name("trajHandle_Id")
    5108                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_trajHandle_Id")
    5109                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5110                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    5111              
    5112              $C$DW$602       .dwtag  DW_TAG_member
    5113                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$61)
    5114                      .dwattr $C$DW$602, DW_AT_name("traj_Id")
    5115                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_traj_Id")
    5116                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    5117                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    5118              
    5119              $C$DW$603       .dwtag  DW_TAG_member
    5120                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$60)
    5121                      .dwattr $C$DW$603, DW_AT_name("trajHandle_spd")
    5122                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_trajHandle_spd")
    5123                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    5124                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    5125              
    5126              $C$DW$604       .dwtag  DW_TAG_member
    5127                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$61)
    5128                      .dwattr $C$DW$604, DW_AT_name("traj_spd")
    5129                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_traj_spd")
    5130                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    5131                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    5132              
    5133              $C$DW$605       .dwtag  DW_TAG_member
    5134                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$60)
    5135                      .dwattr $C$DW$605, DW_AT_name("trajHandle_spdMax")
    5136                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    5137                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5138                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    5139              
    5140              $C$DW$606       .dwtag  DW_TAG_member
    5141                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$61)
    5142                      .dwattr $C$DW$606, DW_AT_name("traj_spdMax")
    5143                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_traj_spdMax")
    5144                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5145                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    5146              
    5147              $C$DW$607       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  100

    5148                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$62)
    5149                      .dwattr $C$DW$607, DW_AT_name("motorParams")
    5150                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_motorParams")
    5151                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    5152                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    5153              
    5154              $C$DW$608       .dwtag  DW_TAG_member
    5155                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$65)
    5156                      .dwattr $C$DW$608, DW_AT_name("waitTimes")
    5157                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_waitTimes")
    5158                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5159                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    5160              
    5161              $C$DW$609       .dwtag  DW_TAG_member
    5162                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$64)
    5163                      .dwattr $C$DW$609, DW_AT_name("counter_state")
    5164                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_counter_state")
    5165                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    5166                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    5167              
    5168              $C$DW$610       .dwtag  DW_TAG_member
    5169                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$66)
    5170                      .dwattr $C$DW$610, DW_AT_name("numIsrTicksPerCtrlTick")
    5171                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    5172                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    5173                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    5174              
    5175              $C$DW$611       .dwtag  DW_TAG_member
    5176                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$66)
    5177                      .dwattr $C$DW$611, DW_AT_name("numCtrlTicksPerCurrentTick")
    5178                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    5179                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    5180                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    5181              
    5182              $C$DW$612       .dwtag  DW_TAG_member
    5183                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$66)
    5184                      .dwattr $C$DW$612, DW_AT_name("numCtrlTicksPerSpeedTick")
    5185                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    5186                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    5187                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    5188              
    5189              $C$DW$613       .dwtag  DW_TAG_member
    5190                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$66)
    5191                      .dwattr $C$DW$613, DW_AT_name("numCtrlTicksPerTrajTick")
    5192                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    5193                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    5194                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    5195              
    5196              $C$DW$614       .dwtag  DW_TAG_member
    5197                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$64)
    5198                      .dwattr $C$DW$614, DW_AT_name("ctrlFreq_Hz")
    5199                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    5200                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5201                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    5202              
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  101

    5203              $C$DW$615       .dwtag  DW_TAG_member
    5204                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$64)
    5205                      .dwattr $C$DW$615, DW_AT_name("trajFreq_Hz")
    5206                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_trajFreq_Hz")
    5207                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    5208                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    5209              
    5210              $C$DW$616       .dwtag  DW_TAG_member
    5211                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$31)
    5212                      .dwattr $C$DW$616, DW_AT_name("trajPeriod_sec")
    5213                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_trajPeriod_sec")
    5214                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    5215                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    5216              
    5217              $C$DW$617       .dwtag  DW_TAG_member
    5218                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$67)
    5219                      .dwattr $C$DW$617, DW_AT_name("ctrlPeriod_sec")
    5220                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    5221                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    5222                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    5223              
    5224              $C$DW$618       .dwtag  DW_TAG_member
    5225                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$31)
    5226                      .dwattr $C$DW$618, DW_AT_name("maxVsMag_pu")
    5227                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_maxVsMag_pu")
    5228                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    5229                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    5230              
    5231              $C$DW$619       .dwtag  DW_TAG_member
    5232                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$68)
    5233                      .dwattr $C$DW$619, DW_AT_name("Iab_in")
    5234                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_Iab_in")
    5235                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    5236                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    5237              
    5238              $C$DW$620       .dwtag  DW_TAG_member
    5239                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$68)
    5240                      .dwattr $C$DW$620, DW_AT_name("Iab_filt")
    5241                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_Iab_filt")
    5242                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    5243                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    5244              
    5245              $C$DW$621       .dwtag  DW_TAG_member
    5246                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$68)
    5247                      .dwattr $C$DW$621, DW_AT_name("Idq_in")
    5248                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_Idq_in")
    5249                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    5250                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    5251              
    5252              $C$DW$622       .dwtag  DW_TAG_member
    5253                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$68)
    5254                      .dwattr $C$DW$622, DW_AT_name("Vab_in")
    5255                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_Vab_in")
    5256                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    5257                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  102

    5258              
    5259              $C$DW$623       .dwtag  DW_TAG_member
    5260                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$31)
    5261                      .dwattr $C$DW$623, DW_AT_name("spd_out")
    5262                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_spd_out")
    5263                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    5264                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    5265              
    5266              $C$DW$624       .dwtag  DW_TAG_member
    5267                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$68)
    5268                      .dwattr $C$DW$624, DW_AT_name("Vab_out")
    5269                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_Vab_out")
    5270                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    5271                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    5272              
    5273              $C$DW$625       .dwtag  DW_TAG_member
    5274                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$68)
    5275                      .dwattr $C$DW$625, DW_AT_name("Vdq_out")
    5276                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_Vdq_out")
    5277                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    5278                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    5279              
    5280              $C$DW$626       .dwtag  DW_TAG_member
    5281                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$67)
    5282                      .dwattr $C$DW$626, DW_AT_name("Rhf")
    5283                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_Rhf")
    5284                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    5285                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    5286              
    5287              $C$DW$627       .dwtag  DW_TAG_member
    5288                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$67)
    5289                      .dwattr $C$DW$627, DW_AT_name("Lhf")
    5290                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_Lhf")
    5291                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    5292                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    5293              
    5294              $C$DW$628       .dwtag  DW_TAG_member
    5295                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$67)
    5296                      .dwattr $C$DW$628, DW_AT_name("RoverL")
    5297                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_RoverL")
    5298                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    5299                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    5300              
    5301              $C$DW$629       .dwtag  DW_TAG_member
    5302                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$31)
    5303                      .dwattr $C$DW$629, DW_AT_name("Kp_Id")
    5304                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_Kp_Id")
    5305                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    5306                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    5307              
    5308              $C$DW$630       .dwtag  DW_TAG_member
    5309                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$31)
    5310                      .dwattr $C$DW$630, DW_AT_name("Kp_Iq")
    5311                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_Kp_Iq")
    5312                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  103

    5313                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    5314              
    5315              $C$DW$631       .dwtag  DW_TAG_member
    5316                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$31)
    5317                      .dwattr $C$DW$631, DW_AT_name("Kp_spd")
    5318                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_Kp_spd")
    5319                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    5320                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    5321              
    5322              $C$DW$632       .dwtag  DW_TAG_member
    5323                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$31)
    5324                      .dwattr $C$DW$632, DW_AT_name("Ki_Id")
    5325                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_Ki_Id")
    5326                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    5327                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    5328              
    5329              $C$DW$633       .dwtag  DW_TAG_member
    5330                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$31)
    5331                      .dwattr $C$DW$633, DW_AT_name("Ki_Iq")
    5332                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_Ki_Iq")
    5333                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    5334                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    5335              
    5336              $C$DW$634       .dwtag  DW_TAG_member
    5337                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$31)
    5338                      .dwattr $C$DW$634, DW_AT_name("Ki_spd")
    5339                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_Ki_spd")
    5340                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    5341                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    5342              
    5343              $C$DW$635       .dwtag  DW_TAG_member
    5344                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$31)
    5345                      .dwattr $C$DW$635, DW_AT_name("Kd_Id")
    5346                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_Kd_Id")
    5347                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    5348                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    5349              
    5350              $C$DW$636       .dwtag  DW_TAG_member
    5351                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$31)
    5352                      .dwattr $C$DW$636, DW_AT_name("Kd_Iq")
    5353                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_Kd_Iq")
    5354                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    5355                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    5356              
    5357              $C$DW$637       .dwtag  DW_TAG_member
    5358                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$31)
    5359                      .dwattr $C$DW$637, DW_AT_name("Kd_spd")
    5360                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_Kd_spd")
    5361                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    5362                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    5363              
    5364              $C$DW$638       .dwtag  DW_TAG_member
    5365                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$31)
    5366                      .dwattr $C$DW$638, DW_AT_name("Ui_Id")
    5367                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_Ui_Id")
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  104

    5368                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    5369                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    5370              
    5371              $C$DW$639       .dwtag  DW_TAG_member
    5372                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$31)
    5373                      .dwattr $C$DW$639, DW_AT_name("Ui_Iq")
    5374                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_Ui_Iq")
    5375                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    5376                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    5377              
    5378              $C$DW$640       .dwtag  DW_TAG_member
    5379                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$31)
    5380                      .dwattr $C$DW$640, DW_AT_name("Ui_spd")
    5381                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_Ui_spd")
    5382                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    5383                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    5384              
    5385              $C$DW$641       .dwtag  DW_TAG_member
    5386                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$68)
    5387                      .dwattr $C$DW$641, DW_AT_name("Idq_ref")
    5388                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_Idq_ref")
    5389                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    5390                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    5391              
    5392              $C$DW$642       .dwtag  DW_TAG_member
    5393                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$31)
    5394                      .dwattr $C$DW$642, DW_AT_name("IdRated")
    5395                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_IdRated")
    5396                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    5397                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    5398              
    5399              $C$DW$643       .dwtag  DW_TAG_member
    5400                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$31)
    5401                      .dwattr $C$DW$643, DW_AT_name("spd_ref")
    5402                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_spd_ref")
    5403                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    5404                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    5405              
    5406              $C$DW$644       .dwtag  DW_TAG_member
    5407                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$31)
    5408                      .dwattr $C$DW$644, DW_AT_name("spd_max")
    5409                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_spd_max")
    5410                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    5411                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    5412              
    5413              $C$DW$645       .dwtag  DW_TAG_member
    5414                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$66)
    5415                      .dwattr $C$DW$645, DW_AT_name("counter_current")
    5416                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_counter_current")
    5417                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    5418                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    5419              
    5420              $C$DW$646       .dwtag  DW_TAG_member
    5421                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$66)
    5422                      .dwattr $C$DW$646, DW_AT_name("counter_isr")
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  105

    5423                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_counter_isr")
    5424                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    5425                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    5426              
    5427              $C$DW$647       .dwtag  DW_TAG_member
    5428                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$66)
    5429                      .dwattr $C$DW$647, DW_AT_name("counter_speed")
    5430                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_counter_speed")
    5431                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    5432                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    5433              
    5434              $C$DW$648       .dwtag  DW_TAG_member
    5435                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$66)
    5436                      .dwattr $C$DW$648, DW_AT_name("counter_traj")
    5437                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_counter_traj")
    5438                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    5439                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    5440              
    5441              $C$DW$649       .dwtag  DW_TAG_member
    5442                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$69)
    5443                      .dwattr $C$DW$649, DW_AT_name("flag_enableCtrl")
    5444                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_flag_enableCtrl")
    5445                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    5446                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    5447              
    5448              $C$DW$650       .dwtag  DW_TAG_member
    5449                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$69)
    5450                      .dwattr $C$DW$650, DW_AT_name("flag_enableDcBusComp")
    5451                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    5452                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    5453                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    5454              
    5455              $C$DW$651       .dwtag  DW_TAG_member
    5456                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$69)
    5457                      .dwattr $C$DW$651, DW_AT_name("flag_enablePowerWarp")
    5458                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    5459                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    5460                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    5461              
    5462              $C$DW$652       .dwtag  DW_TAG_member
    5463                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$69)
    5464                      .dwattr $C$DW$652, DW_AT_name("flag_enableOffset")
    5465                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_flag_enableOffset")
    5466                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    5467                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    5468              
    5469              $C$DW$653       .dwtag  DW_TAG_member
    5470                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$69)
    5471                      .dwattr $C$DW$653, DW_AT_name("flag_enableSpeedCtrl")
    5472                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    5473                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    5474                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    5475              
    5476              $C$DW$654       .dwtag  DW_TAG_member
    5477                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  106

    5478                      .dwattr $C$DW$654, DW_AT_name("flag_enableUserMotorParams")
    5479                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    5480                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    5481                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    5482              
    5483              $C$DW$655       .dwtag  DW_TAG_member
    5484                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$68)
    5485                      .dwattr $C$DW$655, DW_AT_name("Idq_offset_pu")
    5486                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_Idq_offset_pu")
    5487                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    5488                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    5489              
    5490              $C$DW$656       .dwtag  DW_TAG_member
    5491                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$68)
    5492                      .dwattr $C$DW$656, DW_AT_name("Vdq_offset_pu")
    5493                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    5494                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    5495                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    5496              
    5497              $C$DW$657       .dwtag  DW_TAG_member
    5498                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$31)
    5499                      .dwattr $C$DW$657, DW_AT_name("angle_pu")
    5500                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_angle_pu")
    5501                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    5502                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    5503              
    5504              $C$DW$658       .dwtag  DW_TAG_member
    5505                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$31)
    5506                      .dwattr $C$DW$658, DW_AT_name("speed_ref_pu")
    5507                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_speed_ref_pu")
    5508                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    5509                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5510              
    5511              $C$DW$659       .dwtag  DW_TAG_member
    5512                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$31)
    5513                      .dwattr $C$DW$659, DW_AT_name("speed_fb_pu")
    5514                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_speed_fb_pu")
    5515                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    5516                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5517              
    5518              $C$DW$660       .dwtag  DW_TAG_member
    5519                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$31)
    5520                      .dwattr $C$DW$660, DW_AT_name("speed_outMax_pu")
    5521                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_speed_outMax_pu")
    5522                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    5523                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5524              
    5525              $C$DW$661       .dwtag  DW_TAG_member
    5526                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$69)
    5527                      .dwattr $C$DW$661, DW_AT_name("flag_enableCurrentCtrl")
    5528                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    5529                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    5530                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5531              
    5532                      .dwendtag $C$DW$T$70
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  107

    5533              
    5534              $C$DW$T$232     .dwtag  DW_TAG_typedef
    5535                      .dwattr $C$DW$T$232, DW_AT_name("CTRL_Obj")
    5536                      .dwattr $C$DW$T$232, DW_AT_type(*$C$DW$T$70)
    5537                      .dwattr $C$DW$T$232, DW_AT_language(DW_LANG_C)
    5538              
    5539              $C$DW$T$233     .dwtag  DW_TAG_pointer_type
    5540                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$232)
    5541                      .dwattr $C$DW$T$233, DW_AT_address_class(0x20)
    5542              
    5543              $C$DW$T$199     .dwtag  DW_TAG_pointer_type
    5544                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$70)
    5545                      .dwattr $C$DW$T$199, DW_AT_address_class(0x20)
    5546              
    5547              $C$DW$T$200     .dwtag  DW_TAG_typedef
    5548                      .dwattr $C$DW$T$200, DW_AT_name("CTRL_Handle")
    5549                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
    5550                      .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    5551              
    5552              $C$DW$662       .dwtag  DW_TAG_TI_far_type
    5553                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$200)
    5554              
    5555              $C$DW$T$234     .dwtag  DW_TAG_const_type
    5556                      .dwattr $C$DW$T$234, DW_AT_type(*$C$DW$662)
    5557              
    5558              
    5559              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    5560                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    5561                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    5562              $C$DW$663       .dwtag  DW_TAG_member
    5563                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$22)
    5564                      .dwattr $C$DW$663, DW_AT_name("rsvd")
    5565                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_rsvd")
    5566                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5567                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    5568              
    5569              $C$DW$664       .dwtag  DW_TAG_member
    5570                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$72)
    5571                      .dwattr $C$DW$664, DW_AT_name("targetProc")
    5572                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_targetProc")
    5573                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5574                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5575              
    5576              $C$DW$665       .dwtag  DW_TAG_member
    5577                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$22)
    5578                      .dwattr $C$DW$665, DW_AT_name("major")
    5579                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_major")
    5580                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5581                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5582              
    5583              $C$DW$666       .dwtag  DW_TAG_member
    5584                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$22)
    5585                      .dwattr $C$DW$666, DW_AT_name("minor")
    5586                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_minor")
    5587                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  108

    5588                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5589              
    5590                      .dwendtag $C$DW$T$73
    5591              
    5592              $C$DW$T$37      .dwtag  DW_TAG_typedef
    5593                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
    5594                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    5595                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    5596              
    5597              $C$DW$T$242     .dwtag  DW_TAG_pointer_type
    5598                      .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$37)
    5599                      .dwattr $C$DW$T$242, DW_AT_address_class(0x20)
    5600              
    5601              
    5602              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    5603                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8301_Obj_")
    5604                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    5605              $C$DW$667       .dwtag  DW_TAG_member
    5606                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$75)
    5607                      .dwattr $C$DW$667, DW_AT_name("spiHandle")
    5608                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_spiHandle")
    5609                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5610                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5611              
    5612              $C$DW$668       .dwtag  DW_TAG_member
    5613                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$77)
    5614                      .dwattr $C$DW$668, DW_AT_name("gpioHandle")
    5615                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_gpioHandle")
    5616                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5617                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5618              
    5619              $C$DW$669       .dwtag  DW_TAG_member
    5620                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$79)
    5621                      .dwattr $C$DW$669, DW_AT_name("gpioNumber")
    5622                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_gpioNumber")
    5623                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5624                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5625              
    5626              $C$DW$670       .dwtag  DW_TAG_member
    5627                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$69)
    5628                      .dwattr $C$DW$670, DW_AT_name("RxTimeOut")
    5629                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_RxTimeOut")
    5630                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5631                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5632              
    5633              $C$DW$671       .dwtag  DW_TAG_member
    5634                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$69)
    5635                      .dwattr $C$DW$671, DW_AT_name("enableTimeOut")
    5636                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_enableTimeOut")
    5637                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5638                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    5639              
    5640                      .dwendtag $C$DW$T$80
    5641              
    5642              $C$DW$T$149     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  109

    5643                      .dwattr $C$DW$T$149, DW_AT_name("DRV8301_Obj")
    5644                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$80)
    5645                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    5646              
    5647              $C$DW$T$147     .dwtag  DW_TAG_pointer_type
    5648                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$80)
    5649                      .dwattr $C$DW$T$147, DW_AT_address_class(0x20)
    5650              
    5651              $C$DW$T$148     .dwtag  DW_TAG_typedef
    5652                      .dwattr $C$DW$T$148, DW_AT_name("DRV8301_Handle")
    5653                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
    5654                      .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    5655              
    5656              
    5657              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    5658                      .dwattr $C$DW$T$91, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    5659                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x05)
    5660              $C$DW$672       .dwtag  DW_TAG_member
    5661                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$82)
    5662                      .dwattr $C$DW$672, DW_AT_name("DRV8301_CURRENT")
    5663                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    5664                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5665                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5666              
    5667              $C$DW$673       .dwtag  DW_TAG_member
    5668                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$84)
    5669                      .dwattr $C$DW$673, DW_AT_name("DRV8301_RESET")
    5670                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_DRV8301_RESET")
    5671                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5672                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5673              
    5674              $C$DW$674       .dwtag  DW_TAG_member
    5675                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$86)
    5676                      .dwattr $C$DW$674, DW_AT_name("PWM_MODE")
    5677                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_PWM_MODE")
    5678                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5679                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5680              
    5681              $C$DW$675       .dwtag  DW_TAG_member
    5682                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$88)
    5683                      .dwattr $C$DW$675, DW_AT_name("OC_MODE")
    5684                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_OC_MODE")
    5685                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5686                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5687              
    5688              $C$DW$676       .dwtag  DW_TAG_member
    5689                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$90)
    5690                      .dwattr $C$DW$676, DW_AT_name("OC_ADJ_SET")
    5691                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    5692                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5693                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5694              
    5695                      .dwendtag $C$DW$T$91
    5696              
    5697              $C$DW$T$105     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  110

    5698                      .dwattr $C$DW$T$105, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    5699                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$91)
    5700                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    5701              
    5702              
    5703              $C$DW$T$100     .dwtag  DW_TAG_structure_type
    5704                      .dwattr $C$DW$T$100, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    5705                      .dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
    5706              $C$DW$677       .dwtag  DW_TAG_member
    5707                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$93)
    5708                      .dwattr $C$DW$677, DW_AT_name("OCTW_SET")
    5709                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_OCTW_SET")
    5710                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5711                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5712              
    5713              $C$DW$678       .dwtag  DW_TAG_member
    5714                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$95)
    5715                      .dwattr $C$DW$678, DW_AT_name("GAIN")
    5716                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_GAIN")
    5717                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5718                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5719              
    5720              $C$DW$679       .dwtag  DW_TAG_member
    5721                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$97)
    5722                      .dwattr $C$DW$679, DW_AT_name("DC_CAL_CH1p2")
    5723                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    5724                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5725                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5726              
    5727              $C$DW$680       .dwtag  DW_TAG_member
    5728                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$99)
    5729                      .dwattr $C$DW$680, DW_AT_name("OC_TOFF")
    5730                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_OC_TOFF")
    5731                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5732                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5733              
    5734                      .dwendtag $C$DW$T$100
    5735              
    5736              $C$DW$T$106     .dwtag  DW_TAG_typedef
    5737                      .dwattr $C$DW$T$106, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    5738                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$100)
    5739                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    5740              
    5741              
    5742              $C$DW$T$101     .dwtag  DW_TAG_structure_type
    5743                      .dwattr $C$DW$T$101, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    5744                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x0b)
    5745              $C$DW$681       .dwtag  DW_TAG_member
    5746                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$69)
    5747                      .dwattr $C$DW$681, DW_AT_name("FAULT")
    5748                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_FAULT")
    5749                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5750                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5751              
    5752              $C$DW$682       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  111

    5753                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$69)
    5754                      .dwattr $C$DW$682, DW_AT_name("GVDD_UV")
    5755                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_GVDD_UV")
    5756                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5757                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5758              
    5759              $C$DW$683       .dwtag  DW_TAG_member
    5760                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$69)
    5761                      .dwattr $C$DW$683, DW_AT_name("PVDD_UV")
    5762                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_PVDD_UV")
    5763                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5764                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5765              
    5766              $C$DW$684       .dwtag  DW_TAG_member
    5767                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$69)
    5768                      .dwattr $C$DW$684, DW_AT_name("OTSD")
    5769                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_OTSD")
    5770                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5771                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5772              
    5773              $C$DW$685       .dwtag  DW_TAG_member
    5774                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$69)
    5775                      .dwattr $C$DW$685, DW_AT_name("OTW")
    5776                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_OTW")
    5777                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5778                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5779              
    5780              $C$DW$686       .dwtag  DW_TAG_member
    5781                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$69)
    5782                      .dwattr $C$DW$686, DW_AT_name("FETHA_OC")
    5783                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_FETHA_OC")
    5784                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5785                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5786              
    5787              $C$DW$687       .dwtag  DW_TAG_member
    5788                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$69)
    5789                      .dwattr $C$DW$687, DW_AT_name("FETLA_OC")
    5790                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_FETLA_OC")
    5791                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5792                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5793              
    5794              $C$DW$688       .dwtag  DW_TAG_member
    5795                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$69)
    5796                      .dwattr $C$DW$688, DW_AT_name("FETHB_OC")
    5797                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_FETHB_OC")
    5798                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5799                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5800              
    5801              $C$DW$689       .dwtag  DW_TAG_member
    5802                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$69)
    5803                      .dwattr $C$DW$689, DW_AT_name("FETLB_OC")
    5804                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_FETLB_OC")
    5805                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5806                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5807              
TMS320C2000 Assembler PC v15.12.3 Mon Mar 20 21:32:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0460811                          PAGE  112

    5808              $C$DW$690       .dwtag  DW_TAG_member
    5809                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$69)
    5810                      .dwattr $C$DW$690, DW_AT_name("FETHC_OC")
    5811                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_FETHC_OC")
    5812                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5813                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5814              
    5815              $C$DW$691       .dwtag  DW_TAG_member
    5816                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$69)
    5817                      .dwattr $C$DW$691, DW_AT_name("FETLC_OC")
    5818                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_FETLC_OC")
    5819                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5820                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    5821              
    5822                      .dwendtag $C$DW$T$101
    5823              
    5824              $C$DW$T$103     .dwtag  DW_TAG_typedef
    5825                      .dwattr $C$DW$T$103, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    5826                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$101)
    5827                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    5828              
    5829              
    5830              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    5831                      .dwattr $C$DW$T$102, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    5832                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x02)
    5833              $C$DW$692       .dwtag  DW_TAG_member
    5834                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$69)
    5835                      .dwattr $C$DW$692, DW_AT_name("GVDD_OV")
