TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Nov 29 20:40:17 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    2228              $C$DW$336       .dwtag  DW_TAG_enumerator
    2229                      .dwattr $C$DW$336, DW_AT_name("ADC_ResultNumber_11")
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   44

    2230                      .dwattr $C$DW$336, DW_AT_const_value(0x0b)
    2231              
    2232              $C$DW$337       .dwtag  DW_TAG_enumerator
    2233                      .dwattr $C$DW$337, DW_AT_name("ADC_ResultNumber_12")
    2234                      .dwattr $C$DW$337, DW_AT_const_value(0x0c)
    2235              
    2236              $C$DW$338       .dwtag  DW_TAG_enumerator
    2237                      .dwattr $C$DW$338, DW_AT_name("ADC_ResultNumber_13")
    2238                      .dwattr $C$DW$338, DW_AT_const_value(0x0d)
    2239              
    2240              $C$DW$339       .dwtag  DW_TAG_enumerator
    2241                      .dwattr $C$DW$339, DW_AT_name("ADC_ResultNumber_14")
    2242                      .dwattr $C$DW$339, DW_AT_const_value(0x0e)
    2243              
    2244              $C$DW$340       .dwtag  DW_TAG_enumerator
    2245                      .dwattr $C$DW$340, DW_AT_name("ADC_ResultNumber_15")
    2246                      .dwattr $C$DW$340, DW_AT_const_value(0x0f)
    2247              
    2248                      .dwendtag $C$DW$T$173
    2249              
    2250              $C$DW$T$174     .dwtag  DW_TAG_typedef
    2251                      .dwattr $C$DW$T$174, DW_AT_name("ADC_ResultNumber_e")
    2252                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
    2253                      .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    2254              
    2255              
    2256              $C$DW$T$176     .dwtag  DW_TAG_enumeration_type
    2257                      .dwattr $C$DW$T$176, DW_AT_byte_size(0x01)
    2258              $C$DW$341       .dwtag  DW_TAG_enumerator
    2259                      .dwattr $C$DW$341, DW_AT_name("PIE_GroupNumber_1")
    2260                      .dwattr $C$DW$341, DW_AT_const_value(0x00)
    2261              
    2262              $C$DW$342       .dwtag  DW_TAG_enumerator
    2263                      .dwattr $C$DW$342, DW_AT_name("PIE_GroupNumber_2")
    2264                      .dwattr $C$DW$342, DW_AT_const_value(0x01)
    2265              
    2266              $C$DW$343       .dwtag  DW_TAG_enumerator
    2267                      .dwattr $C$DW$343, DW_AT_name("PIE_GroupNumber_3")
    2268                      .dwattr $C$DW$343, DW_AT_const_value(0x02)
    2269              
    2270              $C$DW$344       .dwtag  DW_TAG_enumerator
    2271                      .dwattr $C$DW$344, DW_AT_name("PIE_GroupNumber_4")
    2272                      .dwattr $C$DW$344, DW_AT_const_value(0x03)
    2273              
    2274              $C$DW$345       .dwtag  DW_TAG_enumerator
    2275                      .dwattr $C$DW$345, DW_AT_name("PIE_GroupNumber_5")
    2276                      .dwattr $C$DW$345, DW_AT_const_value(0x04)
    2277              
    2278              $C$DW$346       .dwtag  DW_TAG_enumerator
    2279                      .dwattr $C$DW$346, DW_AT_name("PIE_GroupNumber_6")
    2280                      .dwattr $C$DW$346, DW_AT_const_value(0x05)
    2281              
    2282              $C$DW$347       .dwtag  DW_TAG_enumerator
    2283                      .dwattr $C$DW$347, DW_AT_name("PIE_GroupNumber_7")
    2284                      .dwattr $C$DW$347, DW_AT_const_value(0x06)
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   45

    2285              
    2286              $C$DW$348       .dwtag  DW_TAG_enumerator
    2287                      .dwattr $C$DW$348, DW_AT_name("PIE_GroupNumber_8")
    2288                      .dwattr $C$DW$348, DW_AT_const_value(0x07)
    2289              
    2290              $C$DW$349       .dwtag  DW_TAG_enumerator
    2291                      .dwattr $C$DW$349, DW_AT_name("PIE_GroupNumber_9")
    2292                      .dwattr $C$DW$349, DW_AT_const_value(0x08)
    2293              
    2294              $C$DW$350       .dwtag  DW_TAG_enumerator
    2295                      .dwattr $C$DW$350, DW_AT_name("PIE_GroupNumber_10")
    2296                      .dwattr $C$DW$350, DW_AT_const_value(0x09)
    2297              
    2298              $C$DW$351       .dwtag  DW_TAG_enumerator
    2299                      .dwattr $C$DW$351, DW_AT_name("PIE_GroupNumber_11")
    2300                      .dwattr $C$DW$351, DW_AT_const_value(0x0a)
    2301              
    2302              $C$DW$352       .dwtag  DW_TAG_enumerator
    2303                      .dwattr $C$DW$352, DW_AT_name("PIE_GroupNumber_12")
    2304                      .dwattr $C$DW$352, DW_AT_const_value(0x0b)
    2305              
    2306                      .dwendtag $C$DW$T$176
    2307              
    2308              $C$DW$T$177     .dwtag  DW_TAG_typedef
    2309                      .dwattr $C$DW$T$177, DW_AT_name("PIE_GroupNumber_e")
    2310                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    2311                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    2312              
    2313              
    2314              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2315                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    2316                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    2317              $C$DW$353       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
    2319                      .dwattr $C$DW$353, DW_AT_name("ADCRESULT")
    2320                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_ADCRESULT")
    2321                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2322                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2323              
    2324              $C$DW$354       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$24)
    2326                      .dwattr $C$DW$354, DW_AT_name("resvd_1")
    2327                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_resvd_1")
    2328                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2329                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2330              
    2331              $C$DW$355       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$22)
    2333                      .dwattr $C$DW$355, DW_AT_name("ADCCTL1")
    2334                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_ADCCTL1")
    2335                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    2336                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2337              
    2338              $C$DW$356       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   46

    2340                      .dwattr $C$DW$356, DW_AT_name("ADCCTL2")
    2341                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_ADCCTL2")
    2342                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    2343                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2344              
    2345              $C$DW$357       .dwtag  DW_TAG_member
    2346                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$25)
    2347                      .dwattr $C$DW$357, DW_AT_name("rsvd_2")
    2348                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_rsvd_2")
    2349                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    2350                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2351              
    2352              $C$DW$358       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$22)
    2354                      .dwattr $C$DW$358, DW_AT_name("ADCINTFLG")
    2355                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_ADCINTFLG")
    2356                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    2357                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2358              
    2359              $C$DW$359       .dwtag  DW_TAG_member
    2360                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$22)
    2361                      .dwattr $C$DW$359, DW_AT_name("ADCINTFLGCLR")
    2362                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    2363                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    2364                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2365              
    2366              $C$DW$360       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$22)
    2368                      .dwattr $C$DW$360, DW_AT_name("ADCINTOVF")
    2369                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_ADCINTOVF")
    2370                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    2371                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2372              
    2373              $C$DW$361       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$22)
    2375                      .dwattr $C$DW$361, DW_AT_name("ADCINTOVFCLR")
    2376                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    2377                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    2378                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2379              
    2380              $C$DW$362       .dwtag  DW_TAG_member
    2381                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$26)
    2382                      .dwattr $C$DW$362, DW_AT_name("INTSELxNy")
    2383                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_INTSELxNy")
    2384                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    2385                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2386              
    2387              $C$DW$363       .dwtag  DW_TAG_member
    2388                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$27)
    2389                      .dwattr $C$DW$363, DW_AT_name("rsvd_3")
    2390                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_rsvd_3")
    2391                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    2392                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2393              
    2394              $C$DW$364       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   47

    2395                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$22)
    2396                      .dwattr $C$DW$364, DW_AT_name("SOCPRICTRL")
    2397                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_SOCPRICTRL")
    2398                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    2399                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2400              
    2401              $C$DW$365       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$22)
    2403                      .dwattr $C$DW$365, DW_AT_name("rsvd_4")
    2404                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_rsvd_4")
    2405                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    2406                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2407              
    2408              $C$DW$366       .dwtag  DW_TAG_member
    2409                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$22)
    2410                      .dwattr $C$DW$366, DW_AT_name("ADCSAMPLEMODE")
    2411                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    2412                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    2413                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2414              
    2415              $C$DW$367       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$22)
    2417                      .dwattr $C$DW$367, DW_AT_name("rsvd_5")
    2418                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_rsvd_5")
    2419                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    2420                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2421              
    2422              $C$DW$368       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$22)
    2424                      .dwattr $C$DW$368, DW_AT_name("ADCINTSOCSEL1")
    2425                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    2426                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    2427                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2428              
    2429              $C$DW$369       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$22)
    2431                      .dwattr $C$DW$369, DW_AT_name("ADCINTSOCSEL2")
    2432                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    2433                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    2434                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2435              
    2436              $C$DW$370       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$25)
    2438                      .dwattr $C$DW$370, DW_AT_name("rsvd_6")
    2439                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_rsvd_6")
    2440                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    2441                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2442              
    2443              $C$DW$371       .dwtag  DW_TAG_member
    2444                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$22)
    2445                      .dwattr $C$DW$371, DW_AT_name("ADCSOCFLG1")
    2446                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    2447                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    2448                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2449              
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   48

    2450              $C$DW$372       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$22)
    2452                      .dwattr $C$DW$372, DW_AT_name("rsvd_7")
    2453                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_rsvd_7")
    2454                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    2455                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2456              
    2457              $C$DW$373       .dwtag  DW_TAG_member
    2458                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$22)
    2459                      .dwattr $C$DW$373, DW_AT_name("ADCSOCFRC1")
    2460                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    2461                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    2462                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2463              
    2464              $C$DW$374       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$22)
    2466                      .dwattr $C$DW$374, DW_AT_name("rsvd_8")
    2467                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_rsvd_8")
    2468                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    2469                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2470              
    2471              $C$DW$375       .dwtag  DW_TAG_member
    2472                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$22)
    2473                      .dwattr $C$DW$375, DW_AT_name("ADCSOCOVF1")
    2474                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    2475                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    2476                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2477              
    2478              $C$DW$376       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$22)
    2480                      .dwattr $C$DW$376, DW_AT_name("rsvd_9")
    2481                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_rsvd_9")
    2482                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    2483                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2484              
    2485              $C$DW$377       .dwtag  DW_TAG_member
    2486                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$22)
    2487                      .dwattr $C$DW$377, DW_AT_name("ADCSOCOVFCLR1")
    2488                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    2489                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    2490                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2491              
    2492              $C$DW$378       .dwtag  DW_TAG_member
    2493                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$22)
    2494                      .dwattr $C$DW$378, DW_AT_name("rsvd_10")
    2495                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_rsvd_10")
    2496                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    2497                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2498              
    2499              $C$DW$379       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$23)
    2501                      .dwattr $C$DW$379, DW_AT_name("ADCSOCxCTL")
    2502                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    2503                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    2504                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   49

    2505              
    2506              $C$DW$380       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$23)
    2508                      .dwattr $C$DW$380, DW_AT_name("rsvd_11")
    2509                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd_11")
    2510                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    2511                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2512              
    2513              $C$DW$381       .dwtag  DW_TAG_member
    2514                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$22)
    2515                      .dwattr $C$DW$381, DW_AT_name("ADCREFTRIM")
    2516                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ADCREFTRIM")
    2517                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    2518                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2519              
    2520              $C$DW$382       .dwtag  DW_TAG_member
    2521                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$22)
    2522                      .dwattr $C$DW$382, DW_AT_name("ADCOFFTRIM")
    2523                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    2524                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    2525                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2526              
    2527              $C$DW$383       .dwtag  DW_TAG_member
    2528                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$28)
    2529                      .dwattr $C$DW$383, DW_AT_name("resvd_12")
    2530                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_resvd_12")
    2531                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    2532                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2533              
    2534              $C$DW$384       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$22)
    2536                      .dwattr $C$DW$384, DW_AT_name("ADCREV")
    2537                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_ADCREV")
    2538                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    2539                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2540              
    2541                      .dwendtag $C$DW$T$29
    2542              
    2543              $C$DW$T$179     .dwtag  DW_TAG_typedef
    2544                      .dwattr $C$DW$T$179, DW_AT_name("ADC_Obj")
    2545                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$29)
    2546                      .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    2547              
    2548              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    2549                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$29)
    2550                      .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    2551              
    2552              $C$DW$T$83      .dwtag  DW_TAG_typedef
    2553                      .dwattr $C$DW$T$83, DW_AT_name("ADC_Handle")
    2554                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    2555                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2556              
    2557              
    2558              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2559                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   50

    2560                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    2561              $C$DW$385       .dwtag  DW_TAG_member
    2562                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$22)
    2563                      .dwattr $C$DW$385, DW_AT_name("XCLK")
    2564                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_XCLK")
    2565                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2566                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2567              
    2568              $C$DW$386       .dwtag  DW_TAG_member
    2569                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$22)
    2570                      .dwattr $C$DW$386, DW_AT_name("rsvd_1")
    2571                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_rsvd_1")
    2572                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2573                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2574              
    2575              $C$DW$387       .dwtag  DW_TAG_member
    2576                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$22)
    2577                      .dwattr $C$DW$387, DW_AT_name("CLKCTL")
    2578                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_CLKCTL")
    2579                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2580                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2581              
    2582              $C$DW$388       .dwtag  DW_TAG_member
    2583                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$30)
    2584                      .dwattr $C$DW$388, DW_AT_name("rsvd_2")
    2585                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd_2")
    2586                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2587                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2588              
    2589              $C$DW$389       .dwtag  DW_TAG_member
    2590                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$22)
    2591                      .dwattr $C$DW$389, DW_AT_name("LOSPCP")
    2592                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_LOSPCP")
    2593                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2594                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2595              
    2596              $C$DW$390       .dwtag  DW_TAG_member
    2597                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$22)
    2598                      .dwattr $C$DW$390, DW_AT_name("PCLKCR0")
    2599                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_PCLKCR0")
    2600                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2601                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2602              
    2603              $C$DW$391       .dwtag  DW_TAG_member
    2604                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$22)
    2605                      .dwattr $C$DW$391, DW_AT_name("PCLKCR1")
    2606                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_PCLKCR1")
    2607                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2608                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2609              
    2610              $C$DW$392       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$25)
    2612                      .dwattr $C$DW$392, DW_AT_name("rsvd_3")
    2613                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_rsvd_3")
    2614                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   51

    2615                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2616              
    2617              $C$DW$393       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$22)
    2619                      .dwattr $C$DW$393, DW_AT_name("PCLKCR3")
    2620                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_PCLKCR3")
    2621                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2622                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2623              
    2624                      .dwendtag $C$DW$T$31
    2625              
    2626              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    2627                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$31)
    2628                      .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
    2629              
    2630              $C$DW$T$85      .dwtag  DW_TAG_typedef
    2631                      .dwattr $C$DW$T$85, DW_AT_name("CLK_Handle")
    2632                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    2633                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2634              
    2635              
    2636              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2637                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    2638                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2639              $C$DW$394       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$32)
    2641                      .dwattr $C$DW$394, DW_AT_name("tmp")
    2642                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_tmp")
    2643                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2644                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2645              
    2646                      .dwendtag $C$DW$T$33
    2647              
    2648              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    2649                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$33)
    2650                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    2651              
    2652              $C$DW$T$87      .dwtag  DW_TAG_typedef
    2653                      .dwattr $C$DW$T$87, DW_AT_name("CPU_Handle")
    2654                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    2655                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2656              
    2657              
    2658              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2659                      .dwattr $C$DW$T$36, DW_AT_name("_CTRL_Version_")
    2660                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2661              $C$DW$395       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$21)
    2663                      .dwattr $C$DW$395, DW_AT_name("rsvd")
    2664                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_rsvd")
    2665                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2666                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    2667              
    2668              $C$DW$396       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   52

    2670                      .dwattr $C$DW$396, DW_AT_name("targetProc")
    2671                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_targetProc")
    2672                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2673                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    2674              
    2675              $C$DW$397       .dwtag  DW_TAG_member
    2676                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$21)
    2677                      .dwattr $C$DW$397, DW_AT_name("major")
    2678                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_major")
    2679                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2680                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    2681              
    2682              $C$DW$398       .dwtag  DW_TAG_member
    2683                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$21)
    2684                      .dwattr $C$DW$398, DW_AT_name("minor")
    2685                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_minor")
    2686                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2687                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    2688              
    2689                      .dwendtag $C$DW$T$36
    2690              
    2691              $C$DW$T$128     .dwtag  DW_TAG_typedef
    2692                      .dwattr $C$DW$T$128, DW_AT_name("CTRL_Version")
    2693                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$36)
    2694                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    2695              
    2696              
    2697              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2698                      .dwattr $C$DW$T$44, DW_AT_name("_DRV8301_Obj_")
    2699                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    2700              $C$DW$399       .dwtag  DW_TAG_member
    2701                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$38)
    2702                      .dwattr $C$DW$399, DW_AT_name("spiHandle")
    2703                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_spiHandle")
    2704                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    2706              
    2707              $C$DW$400       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$40)
    2709                      .dwattr $C$DW$400, DW_AT_name("gpioHandle")
    2710                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_gpioHandle")
    2711                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2712                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    2713              
    2714              $C$DW$401       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$42)
    2716                      .dwattr $C$DW$401, DW_AT_name("gpioNumber")
    2717                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_gpioNumber")
    2718                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2719                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    2720              
    2721              $C$DW$402       .dwtag  DW_TAG_member
    2722                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$43)
    2723                      .dwattr $C$DW$402, DW_AT_name("RxTimeOut")
    2724                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_RxTimeOut")
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   53

    2725                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2726                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    2727              
    2728              $C$DW$403       .dwtag  DW_TAG_member
    2729                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$43)
    2730                      .dwattr $C$DW$403, DW_AT_name("enableTimeOut")
    2731                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_enableTimeOut")
    2732                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2733                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    2734              
    2735                      .dwendtag $C$DW$T$44
    2736              
    2737              $C$DW$T$115     .dwtag  DW_TAG_typedef
    2738                      .dwattr $C$DW$T$115, DW_AT_name("DRV8301_Obj")
    2739                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$44)
    2740                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    2741              
    2742              $C$DW$T$113     .dwtag  DW_TAG_pointer_type
    2743                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$44)
    2744                      .dwattr $C$DW$T$113, DW_AT_address_class(0x20)
    2745              
    2746              $C$DW$T$114     .dwtag  DW_TAG_typedef
    2747                      .dwattr $C$DW$T$114, DW_AT_name("DRV8301_Handle")
    2748                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
    2749                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    2750              
    2751              
    2752              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2753                      .dwattr $C$DW$T$55, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    2754                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x05)
    2755              $C$DW$404       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$46)
    2757                      .dwattr $C$DW$404, DW_AT_name("DRV8301_CURRENT")
    2758                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    2759                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2760                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    2761              
    2762              $C$DW$405       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$48)
    2764                      .dwattr $C$DW$405, DW_AT_name("DRV8301_RESET")
    2765                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_DRV8301_RESET")
    2766                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2767                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    2768              
    2769              $C$DW$406       .dwtag  DW_TAG_member
    2770                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$50)
    2771                      .dwattr $C$DW$406, DW_AT_name("PWM_MODE")
    2772                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_PWM_MODE")
    2773                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2774                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    2775              
    2776              $C$DW$407       .dwtag  DW_TAG_member
    2777                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$52)
    2778                      .dwattr $C$DW$407, DW_AT_name("OC_MODE")
    2779                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_OC_MODE")
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   54

    2780                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2781                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    2782              
    2783              $C$DW$408       .dwtag  DW_TAG_member
    2784                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$54)
    2785                      .dwattr $C$DW$408, DW_AT_name("OC_ADJ_SET")
    2786                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    2787                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2788                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    2789              
    2790                      .dwendtag $C$DW$T$55
    2791              
    2792              $C$DW$T$69      .dwtag  DW_TAG_typedef
    2793                      .dwattr $C$DW$T$69, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    2794                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$55)
    2795                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2796              
    2797              
    2798              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    2799                      .dwattr $C$DW$T$64, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    2800                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x04)
    2801              $C$DW$409       .dwtag  DW_TAG_member
    2802                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$57)
    2803                      .dwattr $C$DW$409, DW_AT_name("OCTW_SET")
    2804                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_OCTW_SET")
    2805                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2806                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    2807              
    2808              $C$DW$410       .dwtag  DW_TAG_member
    2809                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$59)
    2810                      .dwattr $C$DW$410, DW_AT_name("GAIN")
    2811                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_GAIN")
    2812                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2813                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    2814              
    2815              $C$DW$411       .dwtag  DW_TAG_member
    2816                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$61)
    2817                      .dwattr $C$DW$411, DW_AT_name("DC_CAL_CH1p2")
    2818                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    2819                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2820                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    2821              
    2822              $C$DW$412       .dwtag  DW_TAG_member
    2823                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$63)
    2824                      .dwattr $C$DW$412, DW_AT_name("OC_TOFF")
    2825                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_OC_TOFF")
    2826                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2827                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    2828              
    2829                      .dwendtag $C$DW$T$64
    2830              
    2831              $C$DW$T$70      .dwtag  DW_TAG_typedef
    2832                      .dwattr $C$DW$T$70, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    2833                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$64)
    2834                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   55

    2835              
    2836              
    2837              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    2838                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    2839                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x0b)
    2840              $C$DW$413       .dwtag  DW_TAG_member
    2841                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$43)
    2842                      .dwattr $C$DW$413, DW_AT_name("FAULT")
    2843                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_FAULT")
    2844                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2845                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    2846              
    2847              $C$DW$414       .dwtag  DW_TAG_member
    2848                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$43)
    2849                      .dwattr $C$DW$414, DW_AT_name("GVDD_UV")
    2850                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_GVDD_UV")
    2851                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2852                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    2853              
    2854              $C$DW$415       .dwtag  DW_TAG_member
    2855                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$43)
    2856                      .dwattr $C$DW$415, DW_AT_name("PVDD_UV")
    2857                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_PVDD_UV")
    2858                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2859                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    2860              
    2861              $C$DW$416       .dwtag  DW_TAG_member
    2862                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$43)
    2863                      .dwattr $C$DW$416, DW_AT_name("OTSD")
    2864                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_OTSD")
    2865                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2866                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    2867              
    2868              $C$DW$417       .dwtag  DW_TAG_member
    2869                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$43)
    2870                      .dwattr $C$DW$417, DW_AT_name("OTW")
    2871                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_OTW")
    2872                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2873                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    2874              
    2875              $C$DW$418       .dwtag  DW_TAG_member
    2876                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$43)
    2877                      .dwattr $C$DW$418, DW_AT_name("FETHA_OC")
    2878                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_FETHA_OC")
    2879                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2880                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    2881              
    2882              $C$DW$419       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$43)
    2884                      .dwattr $C$DW$419, DW_AT_name("FETLA_OC")
    2885                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_FETLA_OC")
    2886                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2887                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    2888              
    2889              $C$DW$420       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   56

    2890                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$43)
    2891                      .dwattr $C$DW$420, DW_AT_name("FETHB_OC")
    2892                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_FETHB_OC")
    2893                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2894                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    2895              
    2896              $C$DW$421       .dwtag  DW_TAG_member
    2897                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$43)
    2898                      .dwattr $C$DW$421, DW_AT_name("FETLB_OC")
    2899                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_FETLB_OC")
    2900                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2901                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    2902              
    2903              $C$DW$422       .dwtag  DW_TAG_member
    2904                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$43)
    2905                      .dwattr $C$DW$422, DW_AT_name("FETHC_OC")
    2906                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_FETHC_OC")
    2907                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2908                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    2909              
    2910              $C$DW$423       .dwtag  DW_TAG_member
    2911                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$43)
    2912                      .dwattr $C$DW$423, DW_AT_name("FETLC_OC")
    2913                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_FETLC_OC")
    2914                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2915                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    2916              
    2917                      .dwendtag $C$DW$T$65
    2918              
    2919              $C$DW$T$67      .dwtag  DW_TAG_typedef
    2920                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    2921                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$65)
    2922                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2923              
    2924              
    2925              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    2926                      .dwattr $C$DW$T$66, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    2927                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x02)
    2928              $C$DW$424       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$43)
    2930                      .dwattr $C$DW$424, DW_AT_name("GVDD_OV")
    2931                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_GVDD_OV")
    2932                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2933                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    2934              
    2935              $C$DW$425       .dwtag  DW_TAG_member
    2936                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$21)
    2937                      .dwattr $C$DW$425, DW_AT_name("DeviceID")
    2938                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_DeviceID")
    2939                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2940                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    2941              
    2942                      .dwendtag $C$DW$T$66
    2943              
    2944              $C$DW$T$68      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   57

    2945                      .dwattr $C$DW$T$68, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    2946                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$66)
    2947                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2948              
    2949              
    2950              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    2951                      .dwattr $C$DW$T$71, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    2952                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x18)
    2953              $C$DW$426       .dwtag  DW_TAG_member
    2954                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$67)
    2955                      .dwattr $C$DW$426, DW_AT_name("Stat_Reg_1")
    2956                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Stat_Reg_1")
    2957                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2958                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    2959              
    2960              $C$DW$427       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$68)
    2962                      .dwattr $C$DW$427, DW_AT_name("Stat_Reg_2")
    2963                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Stat_Reg_2")
    2964                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2965                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    2966              
    2967              $C$DW$428       .dwtag  DW_TAG_member
    2968                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$69)
    2969                      .dwattr $C$DW$428, DW_AT_name("Ctrl_Reg_1")
    2970                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    2971                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2972                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    2973              
    2974              $C$DW$429       .dwtag  DW_TAG_member
    2975                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$70)
    2976                      .dwattr $C$DW$429, DW_AT_name("Ctrl_Reg_2")
    2977                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    2978                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2979                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    2980              
    2981              $C$DW$430       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$43)
    2983                      .dwattr $C$DW$430, DW_AT_name("SndCmd")
    2984                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_SndCmd")
    2985                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2986                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    2987              
    2988              $C$DW$431       .dwtag  DW_TAG_member
    2989                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$43)
    2990                      .dwattr $C$DW$431, DW_AT_name("RcvCmd")
    2991                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_RcvCmd")
    2992                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2993                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    2994              
    2995                      .dwendtag $C$DW$T$71
    2996              
    2997              $C$DW$T$180     .dwtag  DW_TAG_typedef
    2998                      .dwattr $C$DW$T$180, DW_AT_name("DRV_SPI_8301_Vars_t")
    2999                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$71)
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   58

    3000                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    3001              
    3002              $C$DW$T$181     .dwtag  DW_TAG_pointer_type
    3003                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$180)
    3004                      .dwattr $C$DW$T$181, DW_AT_address_class(0x20)
    3005              
    3006              
    3007              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    3008                      .dwattr $C$DW$T$73, DW_AT_name("_FILTER_FO_")
    3009                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x0a)
    3010              $C$DW$432       .dwtag  DW_TAG_member
    3011                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$72)
    3012                      .dwattr $C$DW$432, DW_AT_name("a1")
    3013                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_a1")
    3014                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3015                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3016              
    3017              $C$DW$433       .dwtag  DW_TAG_member
    3018                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$72)
    3019                      .dwattr $C$DW$433, DW_AT_name("b0")
    3020                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_b0")
    3021                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3022                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3023              
    3024              $C$DW$434       .dwtag  DW_TAG_member
    3025                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$72)
    3026                      .dwattr $C$DW$434, DW_AT_name("b1")
    3027                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_b1")
    3028                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3029                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3030              
    3031              $C$DW$435       .dwtag  DW_TAG_member
    3032                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$72)
    3033                      .dwattr $C$DW$435, DW_AT_name("x1")
    3034                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_x1")
    3035                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3036                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3037              
    3038              $C$DW$436       .dwtag  DW_TAG_member
    3039                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$72)
    3040                      .dwattr $C$DW$436, DW_AT_name("y1")
    3041                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_y1")
    3042                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3043                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3044              
    3045                      .dwendtag $C$DW$T$73
    3046              
    3047              $C$DW$T$131     .dwtag  DW_TAG_typedef
    3048                      .dwattr $C$DW$T$131, DW_AT_name("FILTER_FO_Obj")
    3049                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$73)
    3050                      .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    3051              
    3052              
    3053              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3054                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   59

    3055                      .dwattr $C$DW$T$19, DW_AT_declaration
    3056                      .dwendtag $C$DW$T$19
    3057              
    3058              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    3059                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$19)
    3060                      .dwattr $C$DW$T$132, DW_AT_address_class(0x20)
    3061              
    3062              $C$DW$T$133     .dwtag  DW_TAG_typedef
    3063                      .dwattr $C$DW$T$133, DW_AT_name("FILTER_FO_Handle")
    3064                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    3065                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    3066              
    3067              
    3068              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    3069                      .dwattr $C$DW$T$74, DW_AT_name("_FLASH_Obj_")
    3070                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x08)
    3071              $C$DW$437       .dwtag  DW_TAG_member
    3072                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$22)
    3073                      .dwattr $C$DW$437, DW_AT_name("FOPT")
    3074                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_FOPT")
    3075                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3076                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3077              
    3078              $C$DW$438       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$22)
    3080                      .dwattr $C$DW$438, DW_AT_name("rsvd_1")
    3081                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_rsvd_1")
    3082                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3083                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3084              
    3085              $C$DW$439       .dwtag  DW_TAG_member
    3086                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$22)
    3087                      .dwattr $C$DW$439, DW_AT_name("FPWR")
    3088                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_FPWR")
    3089                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3090                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3091              
    3092              $C$DW$440       .dwtag  DW_TAG_member
    3093                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$22)
    3094                      .dwattr $C$DW$440, DW_AT_name("FSTATUS")
    3095                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_FSTATUS")
    3096                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3097                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3098              
    3099              $C$DW$441       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
    3101                      .dwattr $C$DW$441, DW_AT_name("FSTDBYWAIT")
    3102                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    3103                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3104                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3105              
    3106              $C$DW$442       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$22)
    3108                      .dwattr $C$DW$442, DW_AT_name("FACTIVEWAIT")
    3109                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_FACTIVEWAIT")
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   60

    3110                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3111                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3112              
    3113              $C$DW$443       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$22)
    3115                      .dwattr $C$DW$443, DW_AT_name("FBANKWAIT")
    3116                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_FBANKWAIT")
    3117                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3118                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3119              
    3120              $C$DW$444       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$22)
    3122                      .dwattr $C$DW$444, DW_AT_name("FOTPWAIT")
    3123                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_FOTPWAIT")
    3124                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3125                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3126              
    3127                      .dwendtag $C$DW$T$74
    3128              
    3129              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    3130                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$74)
    3131                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
    3132              
    3133              $C$DW$T$89      .dwtag  DW_TAG_typedef
    3134                      .dwattr $C$DW$T$89, DW_AT_name("FLASH_Handle")
    3135                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    3136                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    3137              
    3138              
    3139              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    3140                      .dwattr $C$DW$T$79, DW_AT_name("_GPIO_Obj_")
    3141                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x6a)
    3142              $C$DW$445       .dwtag  DW_TAG_member
    3143                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$76)
    3144                      .dwattr $C$DW$445, DW_AT_name("GPACTRL")
    3145                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_GPACTRL")
    3146                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3147                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3148              
    3149              $C$DW$446       .dwtag  DW_TAG_member
    3150                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$76)
    3151                      .dwattr $C$DW$446, DW_AT_name("GPAQSEL1")
    3152                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_GPAQSEL1")
    3153                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3154                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3155              
    3156              $C$DW$447       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$76)
    3158                      .dwattr $C$DW$447, DW_AT_name("GPAQSEL2")
    3159                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_GPAQSEL2")
    3160                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3161                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3162              
    3163              $C$DW$448       .dwtag  DW_TAG_member
    3164                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$76)
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   61

    3165                      .dwattr $C$DW$448, DW_AT_name("GPAMUX1")
    3166                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_GPAMUX1")
    3167                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3168                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3169              
    3170              $C$DW$449       .dwtag  DW_TAG_member
    3171                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$76)
    3172                      .dwattr $C$DW$449, DW_AT_name("GPAMUX2")
    3173                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_GPAMUX2")
    3174                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3175                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3176              
    3177              $C$DW$450       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$76)
    3179                      .dwattr $C$DW$450, DW_AT_name("GPADIR")
    3180                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_GPADIR")
    3181                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3182                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3183              
    3184              $C$DW$451       .dwtag  DW_TAG_member
    3185                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$76)
    3186                      .dwattr $C$DW$451, DW_AT_name("GPAPUD")
    3187                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_GPAPUD")
    3188                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3189                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3190              
    3191              $C$DW$452       .dwtag  DW_TAG_member
    3192                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$25)
    3193                      .dwattr $C$DW$452, DW_AT_name("rsvd_1")
    3194                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_rsvd_1")
    3195                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3196                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3197              
    3198              $C$DW$453       .dwtag  DW_TAG_member
    3199                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$76)
    3200                      .dwattr $C$DW$453, DW_AT_name("GPBCTRL")
    3201                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_GPBCTRL")
    3202                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3203                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3204              
    3205              $C$DW$454       .dwtag  DW_TAG_member
    3206                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$76)
    3207                      .dwattr $C$DW$454, DW_AT_name("GPBQSEL1")
    3208                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_GPBQSEL1")
    3209                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3210                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3211              
    3212              $C$DW$455       .dwtag  DW_TAG_member
    3213                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$25)
    3214                      .dwattr $C$DW$455, DW_AT_name("rsvd_2")
    3215                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_rsvd_2")
    3216                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3217                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3218              
    3219              $C$DW$456       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   62

    3220                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$76)
    3221                      .dwattr $C$DW$456, DW_AT_name("GPBMUX1")
    3222                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_GPBMUX1")
    3223                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3224                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3225              
    3226              $C$DW$457       .dwtag  DW_TAG_member
    3227                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$25)
    3228                      .dwattr $C$DW$457, DW_AT_name("rsvd_3")
    3229                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_rsvd_3")
    3230                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3231                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3232              
    3233              $C$DW$458       .dwtag  DW_TAG_member
    3234                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$76)
    3235                      .dwattr $C$DW$458, DW_AT_name("GPBDIR")
    3236                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_GPBDIR")
    3237                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3238                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3239              
    3240              $C$DW$459       .dwtag  DW_TAG_member
    3241                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$76)
    3242                      .dwattr $C$DW$459, DW_AT_name("GPBPUD")
    3243                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_GPBPUD")
    3244                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3245                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3246              
    3247              $C$DW$460       .dwtag  DW_TAG_member
    3248                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$77)
    3249                      .dwattr $C$DW$460, DW_AT_name("rsvd_4")
    3250                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_rsvd_4")
    3251                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3252                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3253              
    3254              $C$DW$461       .dwtag  DW_TAG_member
    3255                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$76)
    3256                      .dwattr $C$DW$461, DW_AT_name("AIOMUX1")
    3257                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_AIOMUX1")
    3258                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3259                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3260              
    3261              $C$DW$462       .dwtag  DW_TAG_member
    3262                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$25)
    3263                      .dwattr $C$DW$462, DW_AT_name("rsvd_5")
    3264                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_rsvd_5")
    3265                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3266                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3267              
    3268              $C$DW$463       .dwtag  DW_TAG_member
    3269                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$76)
    3270                      .dwattr $C$DW$463, DW_AT_name("AIODIR")
    3271                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_AIODIR")
    3272                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3273                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3274              
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   63

    3275              $C$DW$464       .dwtag  DW_TAG_member
    3276                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$78)
    3277                      .dwattr $C$DW$464, DW_AT_name("rsvd_6")
    3278                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_rsvd_6")
    3279                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3280                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3281              
    3282              $C$DW$465       .dwtag  DW_TAG_member
    3283                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$76)
    3284                      .dwattr $C$DW$465, DW_AT_name("GPADAT")
    3285                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_GPADAT")
    3286                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3287                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3288              
    3289              $C$DW$466       .dwtag  DW_TAG_member
    3290                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$76)
    3291                      .dwattr $C$DW$466, DW_AT_name("GPASET")
    3292                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_GPASET")
    3293                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3294                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3295              
    3296              $C$DW$467       .dwtag  DW_TAG_member
    3297                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$76)
    3298                      .dwattr $C$DW$467, DW_AT_name("GPACLEAR")
    3299                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_GPACLEAR")
    3300                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3301                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3302              
    3303              $C$DW$468       .dwtag  DW_TAG_member
    3304                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$76)
    3305                      .dwattr $C$DW$468, DW_AT_name("GPATOGGLE")
    3306                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_GPATOGGLE")
    3307                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3308                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3309              
    3310              $C$DW$469       .dwtag  DW_TAG_member
    3311                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$76)
    3312                      .dwattr $C$DW$469, DW_AT_name("GPBDAT")
    3313                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_GPBDAT")
    3314                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3315                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3316              
    3317              $C$DW$470       .dwtag  DW_TAG_member
    3318                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$76)
    3319                      .dwattr $C$DW$470, DW_AT_name("GPBSET")
    3320                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_GPBSET")
    3321                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    3322                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3323              
    3324              $C$DW$471       .dwtag  DW_TAG_member
    3325                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$76)
    3326                      .dwattr $C$DW$471, DW_AT_name("GPBCLEAR")
    3327                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_GPBCLEAR")
    3328                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3329                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   64

    3330              
    3331              $C$DW$472       .dwtag  DW_TAG_member
    3332                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$76)
    3333                      .dwattr $C$DW$472, DW_AT_name("GPBTOGGLE")
    3334                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_GPBTOGGLE")
    3335                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    3336                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3337              
    3338              $C$DW$473       .dwtag  DW_TAG_member
    3339                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$30)
    3340                      .dwattr $C$DW$473, DW_AT_name("rsvd_7")
    3341                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_rsvd_7")
    3342                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3343                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3344              
    3345              $C$DW$474       .dwtag  DW_TAG_member
    3346                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$76)
    3347                      .dwattr $C$DW$474, DW_AT_name("AIODAT")
    3348                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_AIODAT")
    3349                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3350                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3351              
    3352              $C$DW$475       .dwtag  DW_TAG_member
    3353                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$76)
    3354                      .dwattr $C$DW$475, DW_AT_name("AIOSET")
    3355                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_AIOSET")
    3356                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    3357                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3358              
    3359              $C$DW$476       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$76)
    3361                      .dwattr $C$DW$476, DW_AT_name("AIOCLEAR")
    3362                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_AIOCLEAR")
    3363                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3364                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3365              
    3366              $C$DW$477       .dwtag  DW_TAG_member
    3367                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$76)
    3368                      .dwattr $C$DW$477, DW_AT_name("AIOTOGGLE")
    3369                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_AIOTOGGLE")
    3370                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3371                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3372              
    3373              $C$DW$478       .dwtag  DW_TAG_member
    3374                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$27)
    3375                      .dwattr $C$DW$478, DW_AT_name("GPIOXINTnSEL")
    3376                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    3377                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3378                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3379              
    3380              $C$DW$479       .dwtag  DW_TAG_member
    3381                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$26)
    3382                      .dwattr $C$DW$479, DW_AT_name("rsvd_8")
    3383                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_rsvd_8")
    3384                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   65

    3385                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3386              
    3387              $C$DW$480       .dwtag  DW_TAG_member
    3388                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$76)
    3389                      .dwattr $C$DW$480, DW_AT_name("GPIOLPMSEL")
    3390                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    3391                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3392                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3393              
    3394                      .dwendtag $C$DW$T$79
    3395              
    3396              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    3397                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$79)
    3398                      .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    3399              
    3400              $C$DW$T$40      .dwtag  DW_TAG_typedef
    3401                      .dwattr $C$DW$T$40, DW_AT_name("GPIO_Handle")
    3402                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    3403                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    3404              
    3405              
    3406              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    3407                      .dwattr $C$DW$T$81, DW_AT_name("_HAL_AdcData_t_")
    3408                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0e)
    3409              $C$DW$481       .dwtag  DW_TAG_member
    3410                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$80)
    3411                      .dwattr $C$DW$481, DW_AT_name("I")
    3412                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_I")
    3413                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3414                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3415              
    3416              $C$DW$482       .dwtag  DW_TAG_member
    3417                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$80)
    3418                      .dwattr $C$DW$482, DW_AT_name("V")
    3419                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_V")
    3420                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3421                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3422              
    3423              $C$DW$483       .dwtag  DW_TAG_member
    3424                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$72)
    3425                      .dwattr $C$DW$483, DW_AT_name("dcBus")
    3426                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_dcBus")
    3427                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3428                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3429              
    3430                      .dwendtag $C$DW$T$81
    3431              
    3432              $C$DW$T$111     .dwtag  DW_TAG_typedef
    3433                      .dwattr $C$DW$T$111, DW_AT_name("HAL_AdcData_t")
    3434                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$81)
    3435                      .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    3436              
    3437              
    3438              $C$DW$T$118     .dwtag  DW_TAG_structure_type
    3439                      .dwattr $C$DW$T$118, DW_AT_name("_HAL_Obj_")
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   66

    3440                      .dwattr $C$DW$T$118, DW_AT_byte_size(0xc4)
    3441              $C$DW$484       .dwtag  DW_TAG_member
    3442                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$83)
    3443                      .dwattr $C$DW$484, DW_AT_name("adcHandle")
    3444                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_adcHandle")
    3445                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3446                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3447              
    3448              $C$DW$485       .dwtag  DW_TAG_member
    3449                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$85)
    3450                      .dwattr $C$DW$485, DW_AT_name("clkHandle")
    3451                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_clkHandle")
    3452                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3453                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3454              
    3455              $C$DW$486       .dwtag  DW_TAG_member
    3456                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$87)
    3457                      .dwattr $C$DW$486, DW_AT_name("cpuHandle")
    3458                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_cpuHandle")
    3459                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3460                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3461              
    3462              $C$DW$487       .dwtag  DW_TAG_member
    3463                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$89)
    3464                      .dwattr $C$DW$487, DW_AT_name("flashHandle")
    3465                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_flashHandle")
    3466                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3467                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3468              
    3469              $C$DW$488       .dwtag  DW_TAG_member
    3470                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$40)
    3471                      .dwattr $C$DW$488, DW_AT_name("gpioHandle")
    3472                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_gpioHandle")
    3473                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3474                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3475              
    3476              $C$DW$489       .dwtag  DW_TAG_member
    3477                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$92)
    3478                      .dwattr $C$DW$489, DW_AT_name("offsetHandle_I")
    3479                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_offsetHandle_I")
    3480                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3481                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3482              
    3483              $C$DW$490       .dwtag  DW_TAG_member
    3484                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$94)
    3485                      .dwattr $C$DW$490, DW_AT_name("offset_I")
    3486                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_offset_I")
    3487                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3488                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3489              
    3490              $C$DW$491       .dwtag  DW_TAG_member
    3491                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$92)
    3492                      .dwattr $C$DW$491, DW_AT_name("offsetHandle_V")
    3493                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_offsetHandle_V")
    3494                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   67

    3495                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3496              
    3497              $C$DW$492       .dwtag  DW_TAG_member
    3498                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$94)
    3499                      .dwattr $C$DW$492, DW_AT_name("offset_V")
    3500                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_offset_V")
    3501                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3502                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3503              
    3504              $C$DW$493       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$96)
    3506                      .dwattr $C$DW$493, DW_AT_name("oscHandle")
    3507                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_oscHandle")
    3508                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    3509                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3510              
    3511              $C$DW$494       .dwtag  DW_TAG_member
    3512                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$98)
    3513                      .dwattr $C$DW$494, DW_AT_name("pieHandle")
    3514                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_pieHandle")
    3515                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3516                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3517              
    3518              $C$DW$495       .dwtag  DW_TAG_member
    3519                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$100)
    3520                      .dwattr $C$DW$495, DW_AT_name("pllHandle")
    3521                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_pllHandle")
    3522                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3523                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3524              
    3525              $C$DW$496       .dwtag  DW_TAG_member
    3526                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$103)
    3527                      .dwattr $C$DW$496, DW_AT_name("pwmHandle")
    3528                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_pwmHandle")
    3529                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    3530                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3531              
    3532              $C$DW$497       .dwtag  DW_TAG_member
    3533                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$103)
    3534                      .dwattr $C$DW$497, DW_AT_name("pwmDacHandle")
    3535                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_pwmDacHandle")
    3536                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    3537                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3538              
    3539              $C$DW$498       .dwtag  DW_TAG_member
    3540                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$105)
    3541                      .dwattr $C$DW$498, DW_AT_name("pwrHandle")
    3542                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_pwrHandle")
    3543                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3544                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3545              
    3546              $C$DW$499       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$108)
    3548                      .dwattr $C$DW$499, DW_AT_name("timerHandle")
    3549                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_timerHandle")
TMS320C2000 Assembler PC v15.12.3 Tue Nov 29 20:40:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Cameron\AppData\Local\Temp\0172010                          PAGE   68

    3550                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    3551                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3552              
    3553              $C$DW$500       .dwtag  DW_TAG_member
    3554                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$110)
    3555                      .dwattr $C$DW$500, DW_AT_name("wdogHandle")
    3556                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_wdogHandle")
    3557                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    3558                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3559              
    3560              $C$DW$501       .dwtag  DW_TAG_member
    3561                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$111)
    3562                      .dwattr $C$DW$501, DW_AT_name("adcBias")
    3563                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_adcBias")
    3564                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3565                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3566              
    3567              $C$DW$502       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$72)
    3569                      .dwattr $C$DW$502, DW_AT_name("current_sf")
    3570                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_current_sf")
    3571                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3572                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3573              
    3574              $C$DW$503       .dwtag  DW_TAG_member
    3575                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$72)
    3576                      .dwattr $C$DW$503, DW_AT_name("voltage_sf")
    3577                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_voltage_sf")
    3578                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3579                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3580              
    3581              $C$DW$504       .dwtag  DW_TAG_member
    3582                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$32)
    3583                      .dwattr $C$DW$504, DW_AT_name("numCurrentSensors")
    3584                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_numCurrentSensors")
    3585                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3586                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3587              
    3588              $C$DW$505       .dwtag  DW_TAG_member
    3589                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$32)
    3590                      .dwattr $C$DW$505, DW_AT_name("numVoltageSensors")
    3591                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_numVoltageSensors")
    3592                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0xa5]
    3593                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3594              
